{
  "type": "Movie",
  "name": "Inheritance",
  "url": "https://www.imdb.com/tt7923220/",
  "poster": "https://m.media-amazon.com/images/M/MV5BODY4MmFkNTgtNWZjMC00NmE4LWE2ZmQtNmFkY2FkZjJhNjY3XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
  "description": "The patriarch of a wealthy and powerful family suddenly passes away, leaving his daughter with a shocking secret inheritance that threatens to unravel and destroy the family.",
  "review": {
    "author": "TxMike",
    "dateCreated": "2020-07-22",
    "inLanguage": "English",
    "heading": "Father suddenly dies and leaves a very big surprise for daughter.",
    "reviewBody": "This movie has gotten consistently mediocre to poor ratings from various professional viewers. The premise is very interesting but highly unlikely, and many of the choices of the various characters seem unusual and unlikely. Still, my wife and I were entertained, as a Tuesday evening viewing at home on the Kanopy site it entertained us more than many recent movies.\n\nVery cute but maybe too young Lily Collins is powerful NYC prosecutor Lauren Monroe. When her wealthy and influential dad dies suddenly and the will is executed she receives an inheritance she wishes she could give back. Dad&apos;s video on the USB drive and a set of keys gets the story into its main thrust. Lauren has to clean up the mess but has no idea how to proceed.\n\nPerhaps the best part of this movie is Simon Pegg, mostly known for his silly, comedic roles, is dead serious here as menacing Morgan Warner. The rest of the cast are adequate. The story has a resolution but in total it is just a B movie. Set in NYC much of it was filmed in Alabama.\n\nI am glad we watched it, I would not want a second viewing.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 18599,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2020-07-06",
  "keywords": "secret underground bunker,captive man,family secret,death of father,interracial romance",
  "duration": "PT1H51M",
  "actor": [
    {
      "name": "Lily Collins",
      "url": "https://www.imdb.com/name/nm2934314/"
    },
    {
      "name": "Simon Pegg",
      "url": "https://www.imdb.com/name/nm0670408/"
    },
    {
      "name": "Connie Nielsen",
      "url": "https://www.imdb.com/name/nm0001567/"
    }
  ],
  "director": [
    {
      "name": "Vaughn Stein",
      "url": "https://www.imdb.com/name/nm2389363/"
    }
  ],
  "creator": [
    {
      "name": "Matthew Kennedy",
      "url": "https://www.imdb.com/name/nm5755883/"
    }
  ]
}