{
  "type": "Movie",
  "name": "Let Him Go",
  "url": "https://www.imdb.com/tt9340860/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNGNhN2I2NzEtMzFiMy00Y2IzLTk0OTctNjcxZmYwYjIyMzEzXkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_.jpg",
  "description": "A retired sheriff and his wife, grieving over the death of their son, set out to find their only grandson.",
  "review": {
    "author": "JohnDeSando",
    "dateCreated": "2020-11-08",
    "inLanguage": "English",
    "heading": "An modern gothic western set in the 50&apos;s with top performances.",
    "reviewBody": "Let Him Go is a western-gothic crime thriller with a North Western setting and some resemblance to vintage oaters like The Searchers. The search has elemental film roots with mental and physical violence enhanced by Leslie Manville as a bad grandma and her wicked sons.\n\nIt&apos;s fun to see the bad guys get roughed up. It&apos;s also satisfying to see the searching-for-family motif of contemporary super-hero films played out in the Western plains even if it was filmed in Calgary. The craggy mountains and little towns complement the late fifties setting when love and crime occur in simple but stark ways.\n\nRetired Montana Sheriff George (Kevin Costner) and his wife, Margaret (Diane Lane), search for their grandson, Jimmy (Bram Hornung and Otto Hornung) after the death of their son, James (Ryan Bruce). Former daughter in law Lorna (Kavli Carter) has left abruptly with new husband, Donny Weboy (Will Britain), and grandson, relocating under duress to North Dakota and his family- Weboy territory where matriarch Blanche (Manville) wields absolute power. Very bad move. The chase begins.\n\nLane and Costner are in top-aging form, tough and tenderhearted enough to fight the Weboy clan for the grandson. This is a different, more nuanced role for them when they were Superman&apos;s parents. Let Him Go adds an authenticity to the thriller formula by emphasizing the devotion of the loving couple to each other and their quest to keep the family whole, or at least provide a fitting family life for their grandson.\n\nThe usual Western tropes apply like the corrupt sheriff, bad grandma and sons, the kind stranger, the tough mother, and the epic ending battle. What goes beyond the formula is the sincere love propelling the plot and corralling our hearts. And, of course, the fully-seasoned Lane and Costner.\n\nLet Him Go is much more than the genre it represents.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 34295,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "15",
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "datePublished": "2020-12-18",
  "keywords": "based on novel,husband wife relationship,grief,final battle,final showdown",
  "duration": "PT1H53M",
  "actor": [
    {
      "name": "Diane Lane",
      "url": "https://www.imdb.com/name/nm0000178/"
    },
    {
      "name": "Kevin Costner",
      "url": "https://www.imdb.com/name/nm0000126/"
    },
    {
      "name": "Kayli Carter",
      "url": "https://www.imdb.com/name/nm7371202/"
    }
  ],
  "director": [
    {
      "name": "Thomas Bezucha",
      "url": "https://www.imdb.com/name/nm0080120/"
    }
  ],
  "creator": [
    {
      "name": "Thomas Bezucha",
      "url": "https://www.imdb.com/name/nm0080120/"
    },
    {
      "name": "Larry Watson",
      "url": "https://www.imdb.com/name/nm10284372/"
    }
  ]
}