{
  "type": "Movie",
  "name": "1UP",
  "url": "https://www.imdb.com/tt13487922/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjZmZWExZjUtZWEzMy00ZTkyLWIzNjAtNTc0ZTJiMmRlOTE5XkEyXkFqcGdeQXVyMTEwMTQ0Njk3._V1_.jpg",
  "description": "Follows a gamer who quits her college esports team due to sexism from her male counterparts.",
  "review": {
    "author": "tilljonas",
    "dateCreated": "2022-07-08",
    "inLanguage": "English",
    "heading": "They could&apos;ve done better than that",
    "reviewBody": "Production value was not the problem, it was more like the story and what they try to attend with this movie. It´s about a girl who founds an all womens esports team with a few non-professional gamers. At this point you can guess the whole plot already. At the beginning the´re really bad and then they rise and get better and all that stuff...Predictable. Screenwriting wasn´t any better, some dialogues are just cringe, some actions just not fitting. Feels like a B-movie, but not a good one. But I can see it that way, that the filmmakers were given the possibility to make movie, to get experience. Nobody can expect to be pro just in a minute. That´s why I am suprised with the production value, it´s not over the top, but still high for an amateur like movie.\n\nActing was ok, i guess they intended to overact a little.\n\nThe main reason, why this movie is not working out is that they don´t really have choosen a target group. I mean it is about gaming, you can make movie for gamers or you can try to get non-gamers, too. I guess they tried to get the whole audience, but it´s not working out. It´s difficult to get an whole audience, Free Guy would be a good example were it worked out, but this is an another level of filmmaking. If they just focused on gamers, they could´ve focused on a more advanced plot, built tension by using all what competitive gaming contains and not just building a rivaly between teams.\n\nBut in the end they missed the gamer audience as well as the non-gamers.\n\nStill 3/10, because I like that they tried and they had the possibility to make this movie. If they learned from it and come up with more experience it was worth it.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 1665,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.4
  },
  "contentRating": "R",
  "genre": [
    "Comedy",
    "Sport"
  ],
  "datePublished": "2022-07-15",
  "keywords": "esports,gamer,teen comedy,competition,teenage girl",
  "duration": "PT1H40M",
  "actor": [
    {
      "name": "Paris Berelc",
      "url": "https://www.imdb.com/name/nm5514372/"
    },
    {
      "name": "Taylor Zakhar Perez",
      "url": "https://www.imdb.com/name/nm3253943/"
    },
    {
      "name": "Ruby Rose",
      "url": "https://www.imdb.com/name/nm3199307/"
    }
  ],
  "director": [
    {
      "name": "Kyle Newman",
      "url": "https://www.imdb.com/name/nm1381100/"
    }
  ],
  "creator": [
    {
      "name": "Julia Yorks",
      "url": "https://www.imdb.com/name/nm0948823/"
    }
  ]
}