{
  "type": "Movie",
  "name": "Honk for Jesus. Save Your Soul.",
  "url": "https://www.imdb.com/tt12655436/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYWUwZjNiMzQtNzZiOC00YjdjLWFiMTctOGNlMWI3ZDZkN2MxXkEyXkFqcGdeQXVyMDA4NzMyOA@@._V1_.jpg",
  "description": "In the aftermath of a huge scandal, Trinitie Childs, the first lady of a prominent Southern Baptist Mega Church, attempts to help her pastor-husband, Lee-Curtis Childs, rebuild their congregation.",
  "review": {
    "author": "IonicBreezeMachine",
    "dateCreated": "2022-09-02",
    "inLanguage": "English",
    "heading": "Adamma Ebo expands her short film to feature length and despite a longer runtime and larger scope, isn&apos;t much more substantive than the original short",
    "reviewBody": "Set in Atlanta, Georgia, a husband and wife team of pastors consisting of Lee-Curtis (Sterling K. Brown) and Trinitie Childs (Regina Hall) operate the Wander to Greater Paths Baptist megachurch which has brought them great wealth and fame and at their apex had 25,000 congregants. Following allegations of sexual behavior done by Lee-Curtis, the church has been temporarily closed as the Childs have tried to ride out the fallout and settle with the accusers. The Childs enlists the aid of a documentary crew to follow them around as they attempt to revitalize the church and Lee-Curtis&apos; image, however a rising star Baptist church, Heaven&apos;s House run by Shakura (Nicole Beharie) and Keon Sumpter (Conphidance) is positioned for a major opening the same day as Wander to Greater Paths&apos; reopening.\n\nHonk for Jesus. Save Your Soul is the feature deubt of Adamma Ebo whose previous credits are short films. The movie is an adaptation of her 2018 short film of the same name following the same plot, but is now given a major remake with behind the scenes support from Daniel Kaluuya and Jordan Peele who are executive producers as their companies 59% Productions and Monkeypaw Productions are listed producers on the film. Debuting simultaneously in theaters and Universal&apos;s Peacock streaming service, I wasn&apos;t all that sure what to expect of the film but was mildly intrigued by the premise having watched the original short film prior to my viewing. Unfortunately what was good material for a short film struggles to be substantive enough to justify a 100 minute runtime.\n\nAssuming you&apos;ve seen the original short film, the film follows many of the major plot and comedic beats that were present in the original short albeit remixed ever so slightly so some may happen sooner or later in relation to others as to not make this a complete 1:1. With a greatly expanded budget from what Ebo worked with on the original short she does get a little more ambitious such as playing with the aspect ratio and using 4:3 footage that&apos;s been mocked up to look like a megachurch telecast, and we&apos;re also given a greater view of the opulence and excess in which the Childs live with both the Childs espousing empty religious platitudes whilst showing off their expensive fashions, foreign luxury cars, and elaborate mansion that runs counter to many of their biblical teachings in some solid enough satire even if the two sitting on gilded thrones as seen on the poster maybe throws a little too much subtlety out the window.\n\nHowever despite us getting to see more of Lee-Childs and Trinitie than we did in the short we never really learn much more about them than we did in the short with many of the scenes that have been added more or less variations on the same point and additions like the Childs five remaining parishioners or the sub-plot of a rival Baptist church stealing their congregation don&apos;t really add much. The movie kind of keeps the mockumentary format used in the short as the setup and premise is more or less the same between both, but in a rather strange decision the Mockumentary format isn&apos;t consistently applied and there are many scenes where no cameras are present and they&apos;re presented as a straight forward narrative which breaks the verisimilitude of the presentation, not that the format is used all that well as the key comic bits used in the short are all revisited and while they were funny in mockumentary format, when they&apos;re presented in straightforward narrative style it makes gags that were awkwardly funny too self-aware with usage of non-diegetic sound and that robs a few scenes of the comic punch they once had. The movie also strangely tries to make Trinite and Lee-Curtis more sympathetic than they were in the original short down to removing the original context in the short that the act in question was with a minor and I&apos;m honestly not sure why Ebo did this because it places the Childs in this weird gray zone where they&apos;re not hateful enough to be laughed at but they&apos;re also too unlikable to be seen as underdogs making the whole thing come off pretty depressing.\n\nHonk for Jesus. Save Your Soul unfortunately is not a good debut for Adamma Ebo and if you are curious in seeing this film I recommend just watching the original short as it contains the best parts in the movie anyway. I think Ebo has promise as a filmmaker and the movie is competently made, but perhaps she needs a co-writer to help her flesh out her ideas in the future.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 3983,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": "15",
  "genre": [
    "Comedy"
  ],
  "datePublished": "2022-09-02",
  "keywords": "megachurch,pastor,scandal exposed,marriage,atlanta georgia",
  "duration": "PT1H46M",
  "actor": [
    {
      "name": "Regina Hall",
      "url": "https://www.imdb.com/name/nm0356021/"
    },
    {
      "name": "Sterling K. Brown",
      "url": "https://www.imdb.com/name/nm1250791/"
    },
    {
      "name": "Nicole Beharie",
      "url": "https://www.imdb.com/name/nm2718512/"
    }
  ],
  "director": [
    {
      "name": "Adamma Ebo",
      "url": "https://www.imdb.com/name/nm8015244/"
    }
  ],
  "creator": [
    {
      "name": "Adamma Ebo",
      "url": "https://www.imdb.com/name/nm8015244/"
    }
  ]
}