

{
  "type": "Movie",
  "name": "Goon",
  "url": "https://www.imdb.com/tt1456635/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTcxOTQwMTQ3MF5BMl5BanBnXkFtZTcwMDcyOTQwNw@@._V1_.jpg",
  "description": "Labeled an outcast by his brainy family, a bouncer overcomes long odds to lead a team of under performing misfits to semi-pro hockey glory, beating the crap out of everything that stands in his way.",
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama",
    "Sport"
  ],
  "datePublished": "2012-01-06",
  "keywords": "hockey,newfoundland canada,locker room,bare chested male,flamboyance",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Seann William Scott",
      "url": "https://www.imdb.com/name/nm0005405/"
    },
    {
      "name": "Jay Baruchel",
      "url": "https://www.imdb.com/name/nm0059431/"
    },
    {
      "name": "Alison Pill",
      "url": "https://www.imdb.com/name/nm0683467/"
    }
  ],
  "director": [
    {
      "name": "Michael Dowse",
      "url": "https://www.imdb.com/name/nm0236226/"
    }
  ],
  "creator": [
    {
      "name": "Jay Baruchel",
      "url": "https://www.imdb.com/name/nm0059431/"
    },
    {
      "name": "Evan Goldberg",
      "url": "https://www.imdb.com/name/nm1698571/"
    },
    {
      "name": "Adam Frattasio",
      "url": "https://www.imdb.com/name/nm4106750/"
    }
  ],
  "review": {
    "author": "tomhemingway11",
    "dateCreated": "2012-01-10",
    "inLanguage": "English",
    "heading": "Pleasantly surprised at the years first 'dumb' comedy.",
    "reviewBody": "'Goon' revolves around a very simple idea that a lovable but stupid nobody gets a chance at becoming an ice hockey champion because of his very powerful fists. Cue some of the most incredibly violent, unnecessary fight scenes seen in cinema for a long time. It makes a Quentin Tarantino film look normal! However, If you buy the idea, despite the familiar and predictable narrative, you will leave the cinema with a big grin on your face; At heart, 'Goon' is just another Indie feel-good comedy.\n\nWritten by Jay Baruchel (also starring) and Evan Goldberg (the man to thank for 'Superbad' & 'Pineapple Express'), the words come to life on screen and audiences should delight in some incredibly amusing one-liners (watch out for the foul-mouthed Baruchel) but also be engaged in the kind hearted and naive Sean William-Scott. You will realise after a while that the pacing of the film is unorthodox as it doesn't focus on the story of the ice hockey team, rather than the 'Goon' himself. This shows a focus which is integral to the film's unique quality and it often takes many unexpected turns as far as typical narratives go. The Goon is the heart of this film and has many redeeming features. This softer approach to a predictably comic performance from William-Scott and the introduction of a possible love story between him and Alison Pill's character (also giving her best shot in this picture) are what elevates the film to a level most comedy's fail to reach.\n\nHaving said that, this film is no 'Juno' or '(500) Days Of Summer'. It mixes the soft, charming and comedic elements with often harsh truths and big fights. There is blood, lost teeth, broken bones and sliced ankles throughout. Never has there been such realistic sounding punches! However, in the end, 'Goon' proves that you don't need a film crammed full of laughs to make a good comedy. It has charm, honesty, some very big fights, some very funny moments and an undeniably uplifting, feel-good ending which makes it just that cut above your average 'dumb' comedy.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 90435,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  }
}