

{
  "type": "Movie",
  "name": "Jesus Henry Christ",
  "url": "https://www.imdb.com/tt1393742/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTA1NjQ0NTYzNjZeQTJeQWpwZ15BbWU3MDc2OTM1NTc@._V1_.jpg",
  "description": "At the age of ten, Henry James Herman, a boy who was conceived in a petri-dish and raised by his feminist mother, follows a string of Post-It notes in hopes of finding his biological father.",
  "contentRating": "PG-13",
  "genre": [
    "Comedy"
  ],
  "datePublished": null,
  "keywords": "boy,single mother,biological father,in vitro fertilization,artificial insemination",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Jason Spevack",
      "url": "https://www.imdb.com/name/nm1555151/"
    },
    {
      "name": "Toni Collette",
      "url": "https://www.imdb.com/name/nm0001057/"
    },
    {
      "name": "Michael Sheen",
      "url": "https://www.imdb.com/name/nm0790688/"
    }
  ],
  "director": [
    {
      "name": "Dennis Lee",
      "url": "https://www.imdb.com/name/nm1433720/"
    }
  ],
  "creator": [
    {
      "name": "Dennis Lee",
      "url": "https://www.imdb.com/name/nm1433720/"
    }
  ],
  "review": {
    "author": "TroyeEvans",
    "dateCreated": "2012-04-20",
    "inLanguage": "English",
    "heading": "An Unconventional Gem",
    "reviewBody": "It is movies like this that reminds me of the sweetness of little films off the mainstream. And this very film, it is one that captures innocent adolescence and somewhat touches moral standards. But to put it simply, it is intriguing story-telling that really moves me.\\n\\nThis is not a standard film. There is hardly a way to compare, nor is comparison required if you ask me. My sole impression is that it is a feel-good and relaxing movie, mostly comedic with seemingly unrelated silliness, yet it also possesses the qualities of an inspiring drama: family relationships and coming-of-age themes, and perhaps more if you&apos;re eager to look further. Other than that it is a heartfelt comedy, not one of those laugh-out-loud ones, but one that manages to bind loose and scattered things and thoughts into a bittersweet experience, and a truly interesting tale of Henry James Herman, or Jesus Henry Christ if you like.\\n\\nThe backdrop of the plot is the extraordinary abilities of Henry, and from there it evolves unpredictably and fast to a reunion of Henry and Audrey, who he believes is his sister. And of course it continues.\\n\\nThe performances are not exceptionally surprising but the power of story has made that problem minor, as my love of the film emanates from the bravely unconventional story than from the acting.\\n\\nMovies like this need to be made. For people who enjoy something different and relaxing from time to time, this film is not to be missed.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 6288,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  }
}