

{
  "type": "Movie",
  "name": "Safe House",
  "url": "https://www.imdb.com/tt1599348/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI5ODkyMjA2Nl5BMl5BanBnXkFtZTcwNTcyNTgzNw@@._V1_.jpg",
  "description": "A young CIA agent is tasked with looking after a fugitive in a safe house. But when the safe house is attacked, he finds himself on the run with his charge.",
  "review": {
    "author": "FFman-847-460126",
    "dateCreated": "2012-02-11",
    "inLanguage": "English",
    "heading": "Reynolds & Washington a Strong Duo",
    "reviewBody": "It is so very difficult to find new material when you piece together a governmental conspiracy movie. Safe House is able to do it to a point. The greatest success of this movie is the usage of modern film techniques. Too often the bulging budget and ability to edit in effects makes action/thriller movies extremely unrealistic. Safe House does the opposite. It takes all of these techniques and uses them to make the movie raw and real.\\n\\nThe actors were hand-picked perfectly for their roles. Ryan Reynolds is the actor you have to use when you want to put a likable, relatable family man in a difficult situation. As a CIA operative caught up in something far outside his experience, he fits in perfectly. As for Denzel Washington, there is little that he can&apos;t do. For the unique character of Tobin Frost, there is no better man to fill the role. Together they form a storyline that merely needs to be able to stand on its own two feet. The storyline does stand on its own. That being said, it is the weakest part of the movie. The twists have all been seen before. This movie doesn&apos;t offer new plot points to the old conspiracy theory movie. It merely adds new characters. The new characters are great, but it is not enough. In order for the movie to be great, it needed to give something new to the story.\\n\\nI must say that the end was beautiful. Without giving anything away, it was gracefully preformed. It wrapped up the loose ends that too many other movies simply leave hanging. It adds a whole other dimension to Ryan Reynolds&apos; character. It will, without a doubt, leave you wanting more but somehow completely satisfied.\\n\\nSafe House is worth a trip to the theatre. With thrillers such as this one, the action is better on the big screen. Between the action and the actors, you will not be disappointed. Next to Liam Neeson&apos;s The Grey, this is one of the best action movies so far this year. The thing is, it could have been even better. Too bad.\\n\\nreillyreviews.wordpress.com",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 234251,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Thriller"
  ],
  "datePublished": "2012-02-24",
  "keywords": [
    "on the run",
    "south africa",
    "cia agent",
    "cape town south africa",
    "two in a shower"
  ],
  "duration": "PT1H55M",
  "actor": [
    {
      "name": "Denzel Washington",
      "url": "https://www.imdb.com/name/nm0000243/"
    },
    {
      "name": "Ryan Reynolds",
      "url": "https://www.imdb.com/name/nm0005351/"
    },
    {
      "name": "Robert Patrick",
      "url": "https://www.imdb.com/name/nm0001598/"
    }
  ],
  "director": [
    {
      "name": "Daniel Espinosa",
      "url": "https://www.imdb.com/name/nm1174251/"
    }
  ],
  "creator": [
    {
      "name": "David Guggenheim",
      "url": "https://www.imdb.com/name/nm1638756/"
    }
  ]
}