

{
  "type": "Movie",
  "name": "Savages",
  "url": "https://www.imdb.com/tt1615065/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTk0ODIyNDAyMF5BMl5BanBnXkFtZTcwMTQ5Nzg3Nw@@._V1_.jpg",
  "description": "Pot growers Ben and Chon face off against the Mexican drug cartel who kidnapped their shared girlfriend.",
  "datePublished": "2012-09-21",
  "contentRating": "18",
  "genre": [
    "Action",
    "Crime",
    "Drama"
  ],
  "duration": "PT2H11M",
  "rating": {
    "ratingCount": 134030,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "review": {
    "author": "mbs",
    "dateCreated": "2012-08-23",
    "inLanguage": "English",
    "heading": "entertaining enough to be worth watching but the 2 guys were like cardboard and i hate to say it but Blake Lively is terrible in it .",
    "reviewBody": "It was OK enough---it was definitely well directed--but the film would&apos;ve benefited a lot from three better actors in the central roles. Don&apos;t get me wrong--its not that Taylor Kitch or Aaron Johnson aren&apos;t decent enough--both play their roles with exactly the same kind of stiffness that i guess suit their characters&apos; circumstance but neither really add anything beyond what the screenplay has already provided them.. like if this were made say 10-15 years ago and you&apos;d of had Steve Zhan and Ben Affleck in it i&apos;m not saying it would&apos;ve been batter but the two of them would&apos;ve made you care for what might happen to the main characters a bit more i feel like. I&apos;d rather not get into the lack of any kind of convincing emoting from Blake Lively here--- (She&apos;s supposed to be afraid for her life here--and somehow its like she&apos;s barely miffed---its as if instead of her life that&apos;s being threatened its her wi-fi connection.) having read the book this was based on--the character O in the story was a lot more resourceful and a lot more crazy then Blake Lively ever suggests in the two hours of running time---would that they had cast literally anybody else in her part,just off the top of my head would Lauren Ambrose from six feet under have been considered too old??? would Krysten Ritter??? would Kirsten Bell?? hell Alexis Bidel might of been able to pull this off better (and as much as i love Rory Gilmore emoting was never exactly her strong suit) at least Blake Lively&apos;s narrating was OK...i just really wish they could&apos;ve found someone who could have really put this movie over the top here. God again if this was made like 10-15 years ago--imagine what a younger Juliette Lewis or a younger Illeana Douglas could&apos;ve done with this.\\n\\nThat&apos;s really all i actually wanted to say cause everything else was fine enough--i was kind of expecting it to be more over the top if anything given that its Oliver St one&apos;s first crime film in a little while but its definitely over the top enough to satisfy anyone looking for an over the top crime movie. Its good enough that it overcomes the somewhat major obstacles in its path to keep you watching and keep you entertained but again with a little different casting--this could of been first rate.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 134030,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "keywords": "marijuana,one female two males threesome,rear nudity,woman on top sex,clothed female naked male scene",
  "actor": [
    {
      "name": "Aaron Taylor-Johnson",
      "url": "https://www.imdb.com/name/nm1093951/"
    },
    {
      "name": "Taylor Kitsch",
      "url": "https://www.imdb.com/name/nm2018237/"
    },
    {
      "name": "Blake Lively",
      "url": "https://www.imdb.com/name/nm0515116/"
    }
  ],
  "director": [
    {
      "name": "Oliver Stone",
      "url": "https://www.imdb.com/name/nm0000231/"
    }
  ],
  "creator": [
    {
      "name": "Shane Salerno",
      "url": "https://www.imdb.com/name/nm0004307/"
    },
    {
      "name": "Don Winslow",
      "url": "https://www.imdb.com/name/nm0972454/"
    },
    {
      "name": "Oliver Stone",
      "url": "https://www.imdb.com/name/nm0000231/"
    }
  ]
}