

{
  "type": "Movie",
  "name": "Karigurashi no Arietti",
  "url": "https://www.imdb.com/tt1568921/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZDY3ZGI0ZDAtMThlNy00MzAxLTg4YjAtNjkwYTkxNmQ4MjdlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
  "description": null,
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Drama"
  ],
  "datePublished": "2011-07-29",
  "keywords": "studio ghibli,female protagonist,the borrowers,miniature person,cat",
  "duration": "PT1H34M",
  "actor": [
    {
      "name": "Bridgit Mendler",
      "url": "https://www.imdb.com/name/nm1847099/"
    },
    {
      "name": "Amy Poehler",
      "url": "https://www.imdb.com/name/nm0688132/"
    },
    {
      "name": "Will Arnett",
      "url": "https://www.imdb.com/name/nm0004715/"
    }
  ],
  "director": [
    {
      "name": "Hiromasa Yonebayashi",
      "url": "https://www.imdb.com/name/nm0948488/"
    }
  ],
  "creator": [
    {
      "name": "Mary Norton",
      "url": "https://www.imdb.com/name/nm0636260/"
    },
    {
      "name": "Hayao Miyazaki",
      "url": "https://www.imdb.com/name/nm0594503/"
    },
    {
      "name": "Keiko Niwa",
      "url": "https://www.imdb.com/name/nm2146668/"
    }
  ],
  "review": {
    "author": "joemonkey1",
    "dateCreated": "2011-08-08",
    "inLanguage": "English",
    "heading": "Another Charming Ghibli",
    "reviewBody": "http://bit.ly/qEdJCp\n\nYou can't beat hand drawn animation. No matter how realistic your computer generated image is or how much the train conductor looks like Tom Hanks, you can't really compete with the beauty of Ghibli's animation. And that really comes across when seeing this new offering on the big screen. Along with some descent English dubbing and the humour that always accompanies tiny people with giant sugar cubes, Arrietty is the usual charming goodness from team Ghibli.\n\nArrietty is The Borrowers (in fact many cinemas are calling it just that) Tiny people live under the floorboards of a house where a young boy with a heart condition is gathering some much needed rest before his impending risky operation. They hide themselves from us humans waiting until night to sneak into our homes and 'Borrow' the things we wont miss, like sugar cubes and tissues. The majority of the fun in this film comes from watching the tiny borrowers clamber around the shelves using string to rappel off cupboards. \n\nOlivia Colman (Peep Show, Hot Fuzz) Is brilliant as the panicky Mum of Arrietty constantly fretting about the humans and her daughter running off all the time. Geraldine McEwan (Miss Marple) is also great as Haru, she is a classic creepy Ghibli old lady and some of the noises she makes are making me laugh just now thinking of them. \n\nIt's easy for kids to follow and endlessly beautiful to watch. Not really surprising that they have done it again and thanks to Pixar dropping the ball (again) with Cars 2, Oscar this year please?\n\nSee http://brotherscinemazov.blogspot.com/ for more on all things film.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 102893,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.6
  }
}