

{
  "type": "Movie",
  "name": "Aloha, Scooby-Doo!",
  "url": "https://www.imdb.com/tt0433771/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTJkOGM1MDUtZTkxOS00MmYxLTk2ZWYtMTQzZmMyOWI3ODgzXkEyXkFqcGdeQXVyNDQ5MDYzMTk@._V1_.jpg",
  "description": "The Mystery Gang goes to Hawaii for the Big Kahuna of Hanahuna Surfing Contest. However, the gang and the locals find the island invaded by the vengeful Wiki Tiki spirit and his demons.",
  "review": {
    "author": "XueHuaBingYu",
    "dateCreated": "2019-11-09",
    "inLanguage": "English",
    "heading": "A good film for surfing lovers.",
    "reviewBody": "Aloha Scooby-Doo is one of the Scooby-Doo animations produced in 2005. So, I&apos;d say it&apos;s a bit old compared to those ones produced in 2010s. Still, I was surprised to see it&apos;s awesome quality. I&apos;m not quite sure that they&apos;ve enhanced the quality or they didn&apos;t, but based on the one I&apos;ve got, the quality is so good to be the one produced in 2005. The images are sharp and yeah, it&apos;s quality is very good.\\n\\nAs I&apos;ve said in the title, this film is concerning with surfing thing. I&apos;m not that much into surfing, and I don&apos;t surf, but it&apos;s good to see how people are surfing and happy. And also, I like to see some Hawaii cultures. I&apos;ve never seen it in any films. So, I&apos;d say it&apos;s good to see in this one.\\n\\nMoreover, I was so surprised to see it&apos;s very huge inside the volcano. Even people can live inside there. It&apos;s like a whole underground city. Thus, the creators&apos; ideas are very cool.\\n\\nThat being said, there&apos;s something that is not possible. Dental floss scene. It&apos;s quite impossible that Dental Floss could hold a person. No matter Daphne&apos;s body is so light, I find it it&apos;s not possible that dental floss could hold it. So, it&apos;s entirely impossible. Furthermore, I find this film is somehow a bit boring. I was feeling sleepy during the movie. I know that Scooby-Doo films are interesting. But this one made me feel a little sleepy. I was trying not to fall asleep. So, if they have made it a bit less boring, it&apos;d be good.\\n\\nThe mystery is also quite good. It&apos;s concerning with the Hawaii cultures and so, it seems to be a little difficult to guess the one who is responsible for all disturbances. But I could guess who that one is. They made it so obvious at the beginning of the film. That was a big mistake they&apos;ve ever made in this film.\\n\\nTo say it overall, Aloha Scooby-Doo seems to be a good film to enjoy. But as for me, it&apos;s kind of boring and so predictable, so, compared to the other ones, this one is a little inferior to them. But if you&apos;re not sleepy and not thinking the other things when the film&apos;s started, you might find this one quite enjoyable.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 5344,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2005-02-08",
  "keywords": "2000s,animal character name in title,scooby doo character,fred jones character,velma dinkley character",
  "duration": "PT1H14M",
  "actor": [
    {
      "name": "Casey Kasem",
      "url": "https://www.imdb.com/name/nm0440487/"
    },
    {
      "name": "Frank Welker",
      "url": "https://www.imdb.com/name/nm0919798/"
    },
    {
      "name": "Mindy Cohn",
      "url": "https://www.imdb.com/name/nm0169934/"
    }
  ],
  "director": [
    {
      "name": "Tim Maltby",
      "url": "https://www.imdb.com/name/nm1207195/"
    }
  ],
  "creator": [
    {
      "name": "Temple Mathews",
      "url": "https://www.imdb.com/name/nm0558721/"
    }
  ]
}