

{
  "type": "Movie",
  "name": "King's Ransom",
  "url": "https://www.imdb.com/tt0388183/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5ODk3NzI1MF5BMl5BanBnXkFtZTcwODk2NTgyMQ@@._V1_.jpg",
  "description": "Hoping to foil his own gold-digging wife's plan, a loathsome businessman arranges his own kidnapping, only to realize that there are plenty of other people interested in his wealth as well.",
  "review": {
    "author": "StevePulaski",
    "dateCreated": "2011-06-18",
    "inLanguage": "English",
    "heading": "Another comedian held ransom to his material",
    "reviewBody": "King's Ransom starts very weak, continues at a snail's pace, then finally gets interesting with fifteen minutes left. At that point, it's whatever. More than half the movie is weak so the likelihood of a rewatch is extremely slim. While the overwhelming amount of negative reviews online is a little too much for this film, it still comes off as just a poorly made, unfunny comedy.\\n\\nAnthony Anderson is always one of the highlights in every film he is in. I liked his goofy Louis persona in Kangaroo Jack, his idiotic antics in Malibu's Most Wanted stood out from the entire film, and most recently in Scream 4 he was a great addition to the cast. He's always stuck in movies that fail to achieve anything they are trying to achieve. He is a funny and energetic actor with instant recognition even with his respective weight-loss. I will say even in this poor comedy, he still manages to impress.\\n\\nThe film centers around an arrogant, self indulgent rich man named Malcolm King (Anderson). Upset his wife Renee (Smith) is divorcing him and is expected to get half his earnings, he fakes his own kidnapping, but a crazy fast-food employee (Mohr) and a mad employee (Parker) also want to kidnap him to teach him a lesson.\\n\\nThe first forty five minutes of the film are nothing but overacted events that showcase nothing but the film's hyper activity and craziness. I liked both Anderson and Mohr's characters, but their antics aren't as funny that I would even come close to recommend this at all.\\n\\nThe writer of King's Ransom was one of the many writers for one of my favorite television shows, Kenan & Kel. It seems the jokes could've worked in a twenty minute episode of a Nickelodeon, they absolutely do not work for a ninety seven minute movie that is nothing but one poorly done slap sticky joke after another barely saved by two likable actors.\\n\\nStarring: Anthony Anderson, Jay Mohr, Donald Faison, Kellita Smith, Nicole Ari Parker, Charlie Murphy, Regina Hall, and Roger Cross. Directed by: Jeffrey W. Byrd.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 3904,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.4
  },
  "contentRating": "12",
  "genre": [
    "Comedy",
    "Crime"
  ],
  "datePublished": "2005-04-22",
  "keywords": "kidnapping,release from prison,police,nail gun,hit in the groin",
  "duration": "PT1H35M",
  "actor": [
    {
      "name": "Anthony Anderson",
      "url": "https://www.imdb.com/name/nm0026364/"
    },
    {
      "name": "Kellita Smith",
      "url": "https://www.imdb.com/name/nm0808917/"
    },
    {
      "name": "Jay Mohr",
      "url": "https://www.imdb.com/name/nm0001542/"
    }
  ],
  "director": [
    {
      "name": "Jeffrey W. Byrd",
      "url": "https://www.imdb.com/name/nm0126032/"
    }
  ],
  "creator": [
    {
      "name": "Wayne Conley",
      "url": "https://www.imdb.com/name/nm0174806/"
    }
  ]
}