

{
  "type": "Movie",
  "name": "Kingdom of Heaven",
  "url": "https://www.imdb.com/tt0320661/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTI2ODhkMjMtYWU2Yy00MjI1LThlNDctZTJmNDE2MDE4ZDYzXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
  "description": "Balian of Ibelin travels to Jerusalem during the Crusades of the 12th century, and there he finds himself as the defender of the city and its people.",
  "datePublished": "2005-05-06",
  "duration": "PT2H24M",
  "contentRating": "15",
  "genre": [
    "Action",
    "Adventure",
    "Drama"
  ],
  "keywords": "crusader,12th century,medieval times,sword,muslim",
  "rating": {
    "ratingCount": 311088,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.3
  },
  "review": {
    "author": "Fella_shibby",
    "dateCreated": "2021-06-05",
    "inLanguage": "English",
    "heading": "Definitely deserves to be seen on a big screen but the Director's Cut is top notch.",
    "reviewBody": "I first saw this in a theatre in 2005 and inspite of owning a dvd (theatrical version) i never revisited it but revisited the 194 mins Director's Cut few days back.\\n\\nThe film has amazing visuals, the landscapes n the battle scenes are stunning.\\n\\nWhile these kinda movies are enjoyed on the big screen, the Director's Cut makes more sense and has many scenes included, battle scenes are depicted with more violence than in the theatrical cut and the subplot involving Sybilla's son Baldwin V, is added but its very poignant.\\n\\nAlso more scenes with Hospitaller offering guidance to Balian are present in the Director's Cut. But a scene where Hospitaller guides Balian after Balian survives an attack by Guy's men looked a bit supernatural.\\n\\nI am generous with a 9 cos the movie is very entertaining.\\n\\nWud have easily rated it a 10 if the makers wud have given more footage to the character of Saladin, a true chivalrous knight.\\n\\nIt is equally true that his generosity, his piety, devoid of fanaticism, that flower of liberality and courtesy which had been the model of our old chroniclers, won him no less popularity in Frankish Syria than in the lands of Islam - Ren\\u00e9 Grousset (writer).\\n\\nDespite the Crusaders' slaughter when they originally conquered Jerusalem in 1099, Saladin granted amnesty and free passage to all common Catholics and even to the defeated Christian army, (the Greek Orthodox Christians were treated even better, because they often opposed the western Crusaders).",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "actor": [
    {
      "name": "Orlando Bloom",
      "url": "https://www.imdb.com/name/nm0089217/"
    },
    {
      "name": "Eva Green",
      "url": "https://www.imdb.com/name/nm1200692/"
    },
    {
      "name": "Liam Neeson",
      "url": "https://www.imdb.com/name/nm0000553/"
    }
  ],
  "director": [
    {
      "name": "Ridley Scott",
      "url": "https://www.imdb.com/name/nm0000631/"
    }
  ],
  "creator": [
    {
      "name": "William Monahan",
      "url": "https://www.imdb.com/name/nm1184258/"
    }
  ]
}