

{
  "type": "Movie",
  "name": "The Weather Man",
  "url": "https://www.imdb.com/tt0384680/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4NzAxMTE3Ml5BMl5BanBnXkFtZTYwMDAwMjY3._V1_.jpg",
  "description": "A Chicago weather man, separated from his wife and children, debates whether professional and personal success are mutually exclusive.",
  "datePublished": "2006-03-03",
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "duration": "PT1H42M",
  "rating": {
    "ratingCount": 82979,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "review": {
    "author": "taramascara2",
    "dateCreated": "2005-11-05",
    "inLanguage": "English",
    "heading": "Excellent Social Commentary",
    "reviewBody": "This movie was a great piece of social commentary on the emptiness of our current American culture. Being the weatherman appears to be a great job. It pays almost $300 Grand a year, and you can afford a nice apartment and a mansion for your beautiful blonde ex-wife and your two estranged children. \\n\\nA job as a weatherman, without a meteorological degree entails absolutely no challenges. You become lazy and bored, because you think you have everything. After all, isn&apos;t the entire purpose of life to make money, drive nice cars, and wear nice clothes, and eat out every night of the week? You are able to spoil your children, hence never teaching them the value of challenging themselves and depriving them of ever working toward a goal and feeling satisfied. \\n\\nThis is what we think living is today in this country! We have no depth! We have toxic vocabulary, eat useless toxic food, we watch useless toxic entertainment, and we have completely useless jobs that create nothing. We wonder why our children have no idea what to do with themselves? Wealthy Americans, which most of us are by the standards of the world, have no skills, no integrity, and no character. The only things our children grow up knowing for sure, are what a Frosty is, and a Big Gulp. The gap between this generation and their grandparents is vast. Our elders worked hard at jobs which created the foundation of wealth and substance that we erode every day with our irresponsible selfish consumerist conduct. Mr. Spritz has no idea what a Big Gulp is, but he&apos;s dying of the cancer that eats this country.\\n\\nThe Weatherman (Nicholas Cage) has a better time with himself, and everyone else as soon as he figures this out. Hilariously, he had to actually get hit in the head with a Big Gulp. We need to focus on the things that matter, take responsibility for our children, and ourselves. The one thing that I think was off in the movie was the line about how being an adult does not include the word easy. The big secret to life, is that when we do things the correct way, often the hard way, life actually gets easier, for everyone.\\n\\nI went to the theater expecting the usual vacuous Hollywood bomb. I was blown away with the power of this movie. On the way out, we asked a young man that was working the theater what he thought. He said that he thought The Weatherman was incredibly dark and very far fetched. I agree, our culture is dark and far fetched. The movie, however, was dead on. Our current life is a bubble about to burst. This movie offered a solution - find some meaning in your life and get after it. Pretending this vacuum doesn&apos;t exist, and that Jessica and Ashley Simpson are talented individuals worth our time and interest, is incredibly bleak to me. On the other hand, I was pretty sure this young man had no idea the scale of these problems. How could he, when he has never experienced anything else.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "keywords": "new york city,living funeral,father daughter relationship,woman on top sex,woman uses crutches",
  "actor": [
    {
      "name": "Nicolas Cage",
      "url": "https://www.imdb.com/name/nm0000115/"
    },
    {
      "name": "Hope Davis",
      "url": "https://www.imdb.com/name/nm0204706/"
    },
    {
      "name": "Nicholas Hoult",
      "url": "https://www.imdb.com/name/nm0396558/"
    }
  ],
  "director": [
    {
      "name": "Gore Verbinski",
      "url": "https://www.imdb.com/name/nm0893659/"
    }
  ],
  "creator": [
    {
      "name": "Steve Conrad",
      "url": "https://www.imdb.com/name/nm0175726/"
    }
  ]
}