

{
  "type": "Movie",
  "name": "Valiant",
  "url": "https://www.imdb.com/tt0361089/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYWQ4ZDVhMDUtNTFjNi00YWE1LWI0NTMtYTZhZTFlZTE2NWY2XkEyXkFqcGdeQXVyNjIzODI5OTQ@._V1_.jpg",
  "description": "At the height of World War II, a tiny wood pigeon enlists in the elite Royal Homing Pigeon Service to serve Britain, as the fearsome General Von Talon (Tim Curry) and his deadly squadron of falcons patrol the English Channel. Is h...",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2009-02-03",
    "inLanguage": "English",
    "heading": "Surprisingly good for a CGI animation",
    "reviewBody": "Valiant, in my opinion is a very good movie, that only suffers from being too short and sometimes the humour falls flat. I&apos;m 16, and I think it is miles better than Doogal. The animation actually was very good, colourful and smooth a majority of the time. In particular the action sequences, beautifully done. And the thing I liked most about the story was that it was based on a true story. Lots of people didn&apos;t like it, because they felt that the subject matter was uninspired. Can I just say, that the birds looked real to me, and that&apos;s what you want in an animation. The script was very funny at times, but I think the bathroom humour got a little too much. It did actually raise a lot of laughs for me. What impressed me most was that most of the jokes were visual. The story was well written and went along at a reasonable pace. The highlight of the movie was the chase of Valiant by Von Talon. The other problem I had was that the overall movie was too short. But I have to mention George Fenton&apos;s music, it was outstanding. As for the voice talents, what a talented cast. Ewen Macgregor was likable as the hero Valiant, and the actor even put some of his earnestness into the character. Ricky Gervais was Ricky Gervais, but this is one of the few times when I found him sidesplittingly funny. Tim Curry voiced Von Talon with such menace, that I found it difficult to recognise him, in a positive way (he stole the show for me). John Cleese was hilarious, that I didn&apos;t hear everything he said from laughing so much. Jim Broadbent, likewise, and he also gave a dynamic performance that totally suited his character. Very good movie, well recommended! 8/10. Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 24287,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.5
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2005-08-19",
  "keywords": "slimehouse,shrekcore,big ben,flying,cg animation",
  "duration": "PT1H16M",
  "actor": [
    {
      "name": "Ewan McGregor",
      "url": "https://www.imdb.com/name/nm0000191/"
    },
    {
      "name": "Ricky Gervais",
      "url": "https://www.imdb.com/name/nm0315041/"
    },
    {
      "name": "Tim Curry",
      "url": "https://www.imdb.com/name/nm0000347/"
    }
  ],
  "director": [
    {
      "name": "Gary Chapman",
      "url": "https://www.imdb.com/name/nm1369705/"
    }
  ],
  "creator": [
    {
      "name": "George Webster",
      "url": "https://www.imdb.com/name/nm1498344/"
    },
    {
      "name": "Jordan Katz",
      "url": "https://www.imdb.com/name/nm0441750/"
    },
    {
      "name": "George Melrod",
      "url": "https://www.imdb.com/name/nm1276664/"
    }
  ]
}