

{
  "type": "Movie",
  "name": "Training Day",
  "url": "https://www.imdb.com/tt0139654/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMDZkMTUxYWEtMDY5NS00ZTA5LTg3MTItNTlkZWE1YWRjYjMwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "A rookie cop spends his first day as a Los Angeles narcotics officer with a rogue detective who isn't what he appears to be.",
  "review": {
    "author": "TBJCSKCNRRQTreviews",
    "dateCreated": "2020-04-11",
    "inLanguage": "English",
    "heading": "Still relevant nearly two decades later",
    "reviewBody": "Jake(Hawke, innocent yet with some edge) has been on the force for over a year and a half now. He wants to make detective, and that means joining Narcotics. For his titular training day he must impress Alonzo(Washington, simultaneously threatening and charming). He will soon find that this is a cop who crosses the line frequently. Exactly how far is he willing to go?\\n\\nThe acting by both leads is amazing. Honestly, for everyone in this. Denzel steals the show, but Ethan still really makes a mark. This is immensely gritty, with many honest looks at what happens in the bad neighborhoods of LA, as told by a screenwriter and director who actually lived there. The authenticity is a huge part of why this is so compelling. With a few exceptions, you really feel like this could happen(there are things that are not very credible. Others have already detailed them, I don't really have anything to add), and it really provokes a discussion of police brutality. Despite an episodic nature, every scene has a distinct purpose in the overall narrative, although for a number of them, you won't realise what it is until later.\\n\\nThis contains a lot of strong language, some brutal violence, and a little nudity. I recommend it to everyone who can stomach the contents. 8/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 468677,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "18",
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "datePublished": "2002-02-01",
  "keywords": "narc,day of reckoning,die hard scenario,police officer killed,violent cop",
  "duration": "PT2H2M",
  "actor": [
    {
      "name": "Denzel Washington",
      "url": "https://www.imdb.com/name/nm0000243/"
    },
    {
      "name": "Ethan Hawke",
      "url": "https://www.imdb.com/name/nm0000160/"
    },
    {
      "name": "Scott Glenn",
      "url": "https://www.imdb.com/name/nm0001277/"
    }
  ],
  "director": [
    {
      "name": "Antoine Fuqua",
      "url": "https://www.imdb.com/name/nm0298807/"
    }
  ],
  "creator": [
    {
      "name": "David Ayer",
      "url": "https://www.imdb.com/name/nm0043742/"
    }
  ]
}