

{
  "type": "Movie",
  "name": "G-Force",
  "url": "https://www.imdb.com/tt0436339/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTM4NTY3MzY2MV5BMl5BanBnXkFtZTcwMDQ1NTM2Mg@@._V1_.jpg",
  "description": "A specially trained squad of guinea pigs is dispatched to stop a diabolical billionaire from taking over the world.",
  "review": {
    "author": "Matt_Layden",
    "dateCreated": "2009-07-24",
    "inLanguage": "English",
    "heading": "Family Friendly Adventure, Just Lacks Laughs.",
    "reviewBody": "G-Force is a specially trained team of guinea pigs, a mole and a fly. They must foil the plans of Saber, a millionaire, who wants to take over the world with these home appliances that ultimately transform into Megatron. Or something along those lines.\\n\\nI watched this one because it was available in 3-D. My first Disney Digital 3-d film. From the aspect, the kids will enjoy the things that pop out at you. This film has a few of those moments, water, debris and glass. Although it just didn't do it for me. The 3-D in this film didn't enhance the film or astonish me. Thus, it ultimately feels like a gimmick and will until a certain film that is planned to be released in the near future apparently plans to change that. I'm not saying it wasn't well done, I just expected more.\\n\\nThe film is mixed animation and live action. The animation is obviously the rodents and insects, while the cast is formed of Hangover star Zach Galifianakis, Will Arnett and Bill Nighy. Galifianakis is really timid here and Nighy does his whole British thing, while Arnett plays the G-Rated version of an A-hole. Nothing memorable, and the kids won't care about these people. They want to see the funny guinea pigs do funny things. Yet, in the theatre I was in, which was full of kids, had hardly any laughs. That's not to say they won't enjoy themselves, because the film is entertaining. It's just not that great a comedy.\\n\\nThe voice acting is great, Sam Rockwell plays Darwin, the lead commando. Tracy Morgan is Blaster, if anyone has seen him on 30 Rock, it's the same here. Penelope Cruz is the female character, who toys with the boys on which one she likes. Nicolas Cage plays Speckles, the mole who is a tech whiz. In this film if you did not know it was Cage playing this character, you would never know it was him. The voice is so different that is makes you scratch your head, well done on all parts.\\n\\nThe child favourite without a doubt is Hurley, the guinea pig that our team meets in a pet shop. He has a bad case of flatulence and is the 'dumb' friendly character. He gets the most laughs, which like I said, wasn't many. Finally Steve Buscemi has a small role as a hamster and he plays it exactly as you would picture Buscemi to play it. The voice work from everyone was top notch, but if I were to hand it to anyone, it wold be cage for his transformation to the unknown.\\n\\nThe animation is well done, the final action sequence does feel like it comes straight out of transformers, but it looks neat. The interaction between human and creature is still noticeably fake, even after all these years they can't seem to perfect this. Since this is a Bruckheimer film, you know there has to be non-stop action. This involves car chases left right and centre, covert-operations and battles with giant creatures. The film is fuel injected to the bone with this. There are moments here and there to slow everything down, yet they are extremely short and don't seem to do much to create conflict for the characters. When the guinea pigs are told they aren't special, they get doubt themselves, this lasts all but one scene because in the next they get a pep talk and are back to the chase sequences.\\n\\nThe plot is one that we've all seen before. Unlikely heroes stopping someone from world domination. So don't expect anything new in the story department. The reveal at the end is lame and predictable, the whole bad guy plan is extremely far fetched and doesn't make sense. Although if you're expecting this film to make sense I guess you're in the wrong theatre. These are talking guinea pigs after all.\\n\\nThe film is entertaining and the kids will most likely enjoy it. It does seem like a typical Hollywood kid flick and it is exactly that. There's no life lessons learned and by the end of the film your kid will want a new pet.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 49629,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.1
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Action",
    "Adventure"
  ],
  "datePublished": "2009-07-31",
  "keywords": "live action cgi hybrid,woman wears eyeglasses,fly,animal spy,animal hero",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Will Arnett",
      "url": "https://www.imdb.com/name/nm0004715/"
    },
    {
      "name": "Pen\\u00e9lope Cruz",
      "url": "https://www.imdb.com/name/nm0004851/"
    },
    {
      "name": "Zach Galifianakis",
      "url": "https://www.imdb.com/name/nm0302108/"
    }
  ],
  "director": [
    {
      "name": "Hoyt Yeatman",
      "url": "https://www.imdb.com/name/nm0947087/"
    }
  ],
  "creator": [
    {
      "name": "Cormac Wibberley",
      "url": "https://www.imdb.com/name/nm0926727/"
    },
    {
      "name": "Marianne Wibberley",
      "url": "https://www.imdb.com/name/nm0926729/"
    },
    {
      "name": "Hoyt Yeatman",
      "url": "https://www.imdb.com/name/nm0947087/"
    }
  ]
}