

{
  "type": "Movie",
  "name": "Inkheart",
  "url": "https://www.imdb.com/tt0494238/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTg5NTc2MDEwN15BMl5BanBnXkFtZTcwMTA5ODQ5MQ@@._V1_.jpg",
  "description": "A teenage girl discovers her father has an amazing talent to bring characters out of their books and must try to stop a freed villain from destroying them all, with the help of her father, her aunt, and a storybook's hero.",
  "review": {
    "author": "fantasyescapist",
    "dateCreated": "2008-12-22",
    "inLanguage": "English",
    "heading": "Intriguing concept but repetitive plotting hinders what could've been a really magical, innovative and different fantasy film...",
    "reviewBody": "I saw this on Friday with my friend, and I enjoyed it more than she did(it was between this and Twilight). Thing is, although I'm a fantasy genre fan, I've not read the book but I've vaguely heard about it some years ago. It's a alright film, but does't have that special something to make it rise above others that have been released that are basically the same action adventure fantasy thing.\\n\\nActing: Fraser was decent playing his typical 'hero' role, but the surprisingly natural performance came from Bennet playing his daughter. Alright, she does't look 12 at all, more like 14/15 but considering I'm getting more used wooden acting in the likes of Potter etc, it's a welcome thing. Mirren's bad-tempered charm as the dotty bookworm aunt and a few mildly amusing lines are good to watch. Serkis was relishing his straightforward villain role, although my friend couldn't take him seriously cause of his old Gollum role. Bettany as the fire-spewing Dustfinger is also convincing, conveying depth and I liked the childlike eccentricity of Broadbent as the author, an actor who seems to be turning up in every fantasy film going. Even a small role like Guillory's is done effectively, but could've had more screen time and more back story or what happened to her at a more satisfying length. Good supporting cast of baddies at the castle as well.\\n\\nPacing: Here's my main issue - the storyline gets repetitive in the escape then heading back to the castle again. Also, certain things aren't explained that left me a bit confused as to how they came about, especially regarding the man that comes out of Arabian Nights. It does get clichéd and generic, plus the ending wraps everything up too conveniently in the climax with The Shadow, so more peril and suspense could've helped. It's an interesting story though, as I said, reading aloud and it comes alive out of the book. I just hoped for more surprises and inventiveness with such a cool central idea.\\n\\nCinematography - The special effects, especially for The Shadow(which scared me quite a bit - reminds me of a demon) and the menagerie of storybook creatures in Capricorn's castle is all done to standard expected nowadays, so it's good if not the best you've ever seen. Colourfully shot, with good set pieces. The camera shakes slightly anytime something is read out of the book.\\n\\nScore: Pretty generic, really, didn't notice any themes.\\n\\nOverall: A good, if repetitive family escapist fantasy film that presents an interesting concept, but does't always execute it as well as it could've. Not enough emotional impact or scenes of what happens in these books when a character or characters read out of them are no longer in the pages of the story. Easy to follow and not too long, though, with a handful of somewhat amusing lines and a Lord of the Rings sight gag, and it does have a bit of magic (like seeing well known items from famous books in the castle etc). The theme of books and reading should hopefully, inspire the audience to pick up a few to loose themselves in, which is always a positive thing. 6.4/10",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 81972,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "PG",
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "datePublished": "2008-12-12",
  "keywords": "overalls,minotaur character,rapunzel character,horror for children,crocodile",
  "duration": "PT1H46M",
  "actor": [
    {
      "name": "Brendan Fraser",
      "url": "https://www.imdb.com/name/nm0000409/"
    },
    {
      "name": "Andy Serkis",
      "url": "https://www.imdb.com/name/nm0785227/"
    },
    {
      "name": "Eliza Bennett",
      "url": "https://www.imdb.com/name/nm1146916/"
    }
  ],
  "director": [
    {
      "name": "Iain Softley",
      "url": "https://www.imdb.com/name/nm0812200/"
    }
  ],
  "creator": [
    {
      "name": "David Lindsay-Abaire",
      "url": "https://www.imdb.com/name/nm1865755/"
    },
    {
      "name": "Cornelia Funke",
      "url": "https://www.imdb.com/name/nm1751315/"
    }
  ]
}