

{
  "type": "Movie",
  "name": "Es war nicht die Nachtigall",
  "url": "https://www.imdb.com/tt0071754/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTA3ODg5NzcxMTBeQTJeQWpwZ15BbWU4MDU4MjU5MDMx._V1_.jpg",
  "description": "Pauli is a sexually frustrated young man who's surrounded by sexually liberated women who will not give him the time of day. He meets a beautiful virgin woman, Andrea, who strongly resists his charms, which compounds his frustration.",
  "review": {
    "author": "PeterMitchell-506-564364",
    "dateCreated": "2013-05-06",
    "inLanguage": "English",
    "heading": "Julia won't grab you",
    "reviewBody": "When finally viewing this, I found the whole exercise, one straining bore. We have a girl desperate to lose her virginity (a younger Sylvia Kristel). She falls for a boy her age, also inexperienced, his dad letting his mistress giving him some pointers but ultimately failing. Seriously folks, this scenario has been done to death in so many other films, especially around 70's time. But here it's done with such uninteresting characters, you don't give two hoots about any of em'. It doesn't have much story either, the surrounds kind of bringing back the ones in Erotic Sex Games, a much better adult title, you'd have an almost nil chance of attaining. Sex hungry Kristel, so angered by her lover, holding back, becomes violent too, like clawing at his face. I couldn't stand the big haughty mistress, either. Julia isn't a film I'd watch again. I remember it as such a disappointing view, where not much happens, a limited adult film in many ways, where The Emmanuelle series is a much better pick. I honesty regretted hiring this one. Trust me, leave this one where it belongs-on the shelf.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 585,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.7
  },
  "contentRating": "X",
  "genre": [
    "Drama"
  ],
  "datePublished": "1975-06-19",
  "keywords": [
    "loss of virginity",
    "male rear nudity",
    "female nudity",
    "coming of age",
    "whipped cream"
  ],
  "duration": "PT1H22M",
  "actor": [
    {
      "name": "Jean-Claude Bouillon",
      "url": "https://www.imdb.com/name/nm0099352/"
    },
    {
      "name": "Sylvia Kristel",
      "url": "https://www.imdb.com/name/nm0000482/"
    },
    {
      "name": "Teri Tordai",
      "url": "https://www.imdb.com/name/nm0867888/"
    }
  ],
  "director": [
    {
      "name": "Sigi Rothemund",
      "url": "https://www.imdb.com/name/nm0351486/"
    }
  ],
  "creator": [
    {
      "name": "Wolfgang Bauer",
      "url": "https://www.imdb.com/name/nm0061953/"
    }
  ]
}