

{
  "type": "Movie",
  "name": "Lymelife",
  "url": "https://www.imdb.com/tt0363780/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDc5ZjRhNDktNWMwYi00NDljLTlmYjEtZDE0NWQ0ZTU4ZDU4XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
  "description": "A family unit begins to bow under the pressure of a failing marriage.",
  "datePublished": "2009-11-12",
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "duration": "PT1H35M",
  "keywords": "female stockinged legs, pantyhose, reference to r2 d2, reference to pubic hair, cuckolded husband",
  "rating": {
    "ratingCount": 14579,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "review": {
    "author": "harvkytl",
    "dateCreated": "2009-06-09",
    "inLanguage": "English",
    "heading": "Nicely done",
    "reviewBody": "Finally, a movie that doesn't take itself too seriously while tackling some serious issues. As an American living in Canada I see the condition of my home country today and this film feels like a prelude, or a humorous set up to the state of the country today. It seems this is unintentional as the screenplay was written during better economic times, but it sure is a strange coincidence. The astute observation of how many Americans become consumed with success that failure becomes inevitable. And the story is told with a raw unpretensiousness that doesn't insult you. It unfolds in a credible fashion, parents bickering, kids flirting, a brutal revenge on a bully then turns as serious as it is funny. the line between serious drama and hilariouis humor is so finely balanced that it's almost surgically seamless. I like when a movie keeps me off balance and in Lymelife you never quite know if you're going to kicked in the stomach or laughing hysterically. According to IMDb the film was made in 22 days for 1 million dollars. This I don't believe. It just doesn't seem possible. But then again, you can argue that the time and money constraints forced some very clever film-making. I especially enjoyed the cuts to little model homes with little plastic people and the characters being seen in reflections, I'm assuming the idea is the people on screen are reflections of who we are. But I don't know because it's not really spelled out. I'm just using my imagination. I recommend seeing it for yourself. I may even go back again for one scene in particular between the great Timothy Hutton and the brilliant Alec Baldwin. their only time on screen together and it is not only the best scene in the film but one of the most memorable scenes in recent film history. \n\nby\n\nex-patriot who still loves America.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "actor": [
    {
      "name": "Rory Culkin",
      "url": "https://www.imdb.com/name/nm0191412/"
    },
    {
      "name": "Alec Baldwin",
      "url": "https://www.imdb.com/name/nm0000285/"
    },
    {
      "name": "Jill Hennessy",
      "url": "https://www.imdb.com/name/nm0005007/"
    }
  ],
  "director": [
    {
      "name": "Derick Martini",
      "url": "https://www.imdb.com/name/nm0553796/"
    }
  ],
  "creator": [
    {
      "name": "Derick Martini",
      "url": "https://www.imdb.com/name/nm0553796/"
    },
    {
      "name": "Steven Martini",
      "url": "https://www.imdb.com/name/nm0553855/"
    }
  ]
}