

{
  "type": "Movie",
  "name": "Nativity!",
  "url": "https://www.imdb.com/tt1242447/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNmFjNTIxNzMtYzRiMi00ZTY4LWI4ZTktZjM3ZDUwZDViNzZiXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
  "description": "An uptight but secretly heartbroken primary school teacher's little white lie about Hollywood coming to see his class' nativity play grows like wildfire in his rag-tag school low on self-esteem.",
  "contentRating": "U",
  "genre": [
    "Comedy",
    "Family"
  ],
  "datePublished": "2009-11-27",
  "keywords": "christmas,christmas season,christmas movie,nativity,play",
  "duration": "PT1H45M",
  "actor": [
    {
      "name": "Martin Freeman",
      "url": "https://www.imdb.com/name/nm0293509/"
    },
    {
      "name": "Marc Wootton",
      "url": "https://www.imdb.com/name/nm1742630/"
    },
    {
      "name": "Jason Watkins",
      "url": "https://www.imdb.com/name/nm0914327/"
    }
  ],
  "director": [
    {
      "name": "Debbie Isitt",
      "url": "https://www.imdb.com/name/nm0411213/"
    }
  ],
  "creator": [
    {
      "name": "Debbie Isitt",
      "url": "https://www.imdb.com/name/nm0411213/"
    }
  ],
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2017-12-19",
    "inLanguage": "English",
    "heading": "A festive charmer",
    "reviewBody": "Finally decided to write a review in the lead up to Christmas to get used to the layout. And what better film to review than a Christmas film like 'Nativity!', being somebody who likes Christmas films and some of the cast members.\n\n'Nativity!' turned out to be a nice charming film. Not a Christmas cracker by all means, there are better Christmas films out there ('It's a Wonderful Life', the Alastair Sim 'Christmas Carol' and the original 'Miracle on 34th Street'). It's also hardly a piece of coal at the bottom of your stocking, there are also far worse of anything to do with Christmas like 1991's 'The Christmas Tree' and 'The Christmas Foal'. 'Nativity!' clearly knew what it wanted to be and never tried to do any more than needed, also achieving the main objectives of a successful film.\n\nIt's not perfect. The story is very predictable in places, with it not doing much new with some of its elements. The film also has times where momentum is lost, with the finale for example going on longer than needed. Am not a massive fan of Alan Carr, so was not sure what to make of his small role. \n\nThere is so much to enjoy in 'Nativity!'. In particular the splendid cast. Martin Freeman is in a role that he's perfect for. Marc Wooton is clearly enjoying himself and has his fair share of scene-stealing moments. Pam Ferris seems to do no wrong, and a big shout out has to go to the children. They are so natural and have great comic timing, they not only are more than a match for the adults but even upstage them.\n\n'Nativity!' looks nice enough in its own simple, un-flashy way. The music is very catchy and gives a real sense of Christmas, while for all the story imperfections the film has a lot of spirit and energy throughout.\n\nA decent script always helps, and 'Nativity!' has that. It has sparkling comic elements and a very warm heart and sweet charm, without being too sentimental.\n\nIn summary, while not mind-blowing 'Nativity!' is a festive charmer that makes do for the festive season and the lead up to it. 7/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 12409,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  }
}