

{
  "type": "Movie",
  "name": "Outlander",
  "url": "https://www.imdb.com/tt0462465/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTBhYmNhZTYtMTEzMi00M2E2LTgyMTYtM2FmYjhjZGFlZWUzXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
  "description": "During the reign of the Vikings, Kainan, a man from a far-off world, crash lands on Earth, bringing with him an alien predator known as the Moorwen. Though both man and monster are seeking revenge for violence committed against th...",
  "review": {
    "author": "Voland-4",
    "dateCreated": "2009-03-27",
    "inLanguage": "English",
    "heading": "Space monster actionfest set in Viking times - what are you waiting for?!!",
    "reviewBody": "It's a real shame I haven't seen a single preview or a billboard for this movie. Whatever, though - the box office opportunity was wasted because someone or other didn't have faith in humanity (I mean seriously, anyone with a droplet of testosterone in them would find this highly entertaining, so of course there's a market for it), but this movie's cult status is assured. \n\nSpaceship carrying terrifying bloodthirsty monster and a mysterious hero (well, not that mysterious) crash lands on Earth during Viking times. I repeat - Vikings! Swords, battles, mead-drinking and all-around Norse badarsery are featured prominently. The acting is good for the most part, the writing isn't stupid and formulaic, and the director keeps a brisk pace throughout the film. And the space monster is simply terrific, imbued with the perfect amount of personality. \n\nIf I was 10 years old when I watched it, I would have been running around on the ceiling for months. Being the mature and responsible grown man I am now, I didn't exactly do that - instead, I recommended it to all my friends and watched it 3 times.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 78274,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2009-04-24",
  "keywords": "viking, alien, ancient astronaut, 700s, monster",
  "duration": "PT1H55M",
  "actor": [
    {
      "name": "Jim Caviezel",
      "url": "https://www.imdb.com/name/nm0001029/"
    },
    {
      "name": "Sophia Myles",
      "url": "https://www.imdb.com/name/nm0617009/"
    },
    {
      "name": "Ron Perlman",
      "url": "https://www.imdb.com/name/nm0000579/"
    }
  ],
  "director": [
    {
      "name": "Howard McCain",
      "url": "https://www.imdb.com/name/nm0564586/"
    }
  ],
  "creator": [
    {
      "name": "Dirk Blackman",
      "url": "https://www.imdb.com/name/nm0085736/"
    },
    {
      "name": "Howard McCain",
      "url": "https://www.imdb.com/name/nm0564586/"
    }
  ]
}