

{
  "type": "Movie",
  "name": "Play the Game",
  "url": "https://www.imdb.com/tt1124388/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzQwMjc5NjExMF5BMl5BanBnXkFtZTcwODc4MTY3Mw@@._V1_.jpg",
  "description": "A young ladies' man teaches his dating tricks to his lonely, widowed grandfather, and plays his best mind games to meet the woman of his dreams.",
  "review": {
    "author": "jbalog3",
    "dateCreated": "2010-11-04",
    "inLanguage": "English",
    "heading": "Solid film",
    "reviewBody": "These reviews are a little harsh. The story is pretty cute. It has its funny parts, but I didn't go in expecting much. It's a very basic plot that with some editing would be really good, but I think it is worth a watch.\\n\\nI am a big fan of Indie films but they can be hit or miss. I thought it was a hit for originality in the story. I can agree with other reviews that it was rather annoying cutting back and forth between the two stories right when you get hooked. It has a feel good ending with a fun twist. \\n\\nI do think the preview for the film is a little misleading. It is a lot more sexual than you would think, but I found it entertaining. Don't take it too literal or you won't have fun with it. There are some parts that might be considered offensive to ages 60 and up. I could see how the movie isn't for everybody. It's definitely aimed at young adults who are still maturing emotionally.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 2889,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "PG-13",
  "genre": [
    "Comedy",
    "Romance"
  ],
  "datePublished": "2009-08-28",
  "keywords": "grandfather grandson relationship, widower, rose, retirement home, salesman",
  "duration": "PT1H45M",
  "actor": [
    {
      "name": "Paul Campbell",
      "url": "https://www.imdb.com/name/nm1353748/"
    },
    {
      "name": "Andy Griffith",
      "url": "https://www.imdb.com/name/nm0341431/"
    },
    {
      "name": "Doris Roberts",
      "url": "https://www.imdb.com/name/nm0005368/"
    }
  ],
  "director": [
    {
      "name": "Marc Fienberg",
      "url": "https://www.imdb.com/name/nm2810280/"
    }
  ],
  "creator": [
    {
      "name": "Marc Fienberg",
      "url": "https://www.imdb.com/name/nm2810280/"
    }
  ]
}