

{
  "type": "Movie",
  "name": "Whiteout",
  "url": "https://www.imdb.com/tt0365929/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTg5NDczMTQ4M15BMl5BanBnXkFtZTcwNzE4MjI4Mg@@._V1_.jpg",
  "description": "U.S. Marshal Carrie Stetko tracks a killer in Antarctica as the sun is about to set for six months.",
  "datePublished": "2009-09-11",
  "contentRating": "15",
  "genre": [
    "Action",
    "Crime",
    "Mystery"
  ],
  "duration": "PT1H41M",
  "keywords": "woman wears a bra and panties,antarctica,female in a shower,nude female silhouette,female nudity",
  "rating": {
    "ratingCount": 40532,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.5
  },
  "review": {
    "author": "fung0",
    "dateCreated": "2011-07-04",
    "inLanguage": "English",
    "heading": "Sorry, but I loved it",
    "reviewBody": "Okay, this isn't a Great movie. It's not even a great whodunit. But in a world where old Charlie Chan pot-boilers have a cult following, and boneheaded Spielberg spectaculars are considered works of genius, I'd say that Whiteout definitely has a place.\n\nWhat did I like about Whiteout? I loved the setting. ANY movie set in the confines of an Antarctic research station is okay with me. (There aren't nearly enough of them!) I loved the characters. Kate Beckinsale isn't in the front ranks of thespians, but she's a solid leading lady, and brings a good mix of likability, vulnerability and toughness to this part. The supporting characters are just fine as well. I loved the idea of setting an action-mystery in this odd locale, and I greatly enjoyed the way the mystery unraveled - predictable though it may have been. And I loved the various ways that the frozen environment is brought in as an element in the story.\n\nWhat did I hate? Not a thing. True, the cold is not treated realistically. Too many people walking around bareheaded and such. Yes, it's a dopey Hollywood convention. But in a little action flick like this one, I wasn't bothered - at all. Did I hate the acting? No. It was just right for this kind of film. Did I have problems with the writing? Okay... there were a few bits of logic that could have been tighter. But, again, no worse than in many movies that get a 10/10 from every blockhead on Earth. (I won't itemize... this review is going to get enough down-checks as it is.)\n\nBottom line, Whiteout is a pile of fun. It's a 'genre' film, with few if any artistic pretensions. But it delivers the goods where it counts. I've watched it several times on DVD, and expect to enjoy it quite a few more. If you don't get it, go watch some Merchant-Ivory drawing room masterpiece, and we'll all be happy.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "actor": [
    {
      "name": "Kate Beckinsale",
      "url": "https://www.imdb.com/name/nm0000295/"
    },
    {
      "name": "Gabriel Macht",
      "url": "https://www.imdb.com/name/nm0532683/"
    },
    {
      "name": "Tom Skerritt",
      "url": "https://www.imdb.com/name/nm0000643/"
    }
  ],
  "director": [
    {
      "name": "Dominic Sena",
      "url": "https://www.imdb.com/name/nm0784061/"
    }
  ],
  "creator": [
    {
      "name": "Jon Hoeber",
      "url": "https://www.imdb.com/name/nm0388377/"
    },
    {
      "name": "Erich Hoeber",
      "url": "https://www.imdb.com/name/nm0388375/"
    },
    {
      "name": "Chad Hayes",
      "url": "https://www.imdb.com/name/nm0370937/"
    }
  ]
}