

{
  "type": "Movie",
  "name": "2 Days in New York",
  "url": "https://www.imdb.com/tt1602472/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI5NTU2MDgyNl5BMl5BanBnXkFtZTcwNzk4NDI5Nw@@._V1_.jpg",
  "description": "Manhattan couple Marion and Mingus, who each have children from prior relationships, find their comfortable family dynamic jostled by a visit from Marion's relatives.",
  "review": {
    "author": "Boba_Fett1138",
    "dateCreated": "2012-07-17",
    "inLanguage": "English",
    "heading": "Cute but no cigar!",
    "reviewBody": "Even though this movie is cute and harmless to watch, I just can't call it a very successful one. I can see what it tried to do and be like and this all works in some parts but more often it just doesn't.\\n\\nI really have some mixed feelings about this movie. Can't say that i hated it and I quite enjoyed it in parts but its approach just doesn't always work out too well. It's a movie that tries to be a realistic drama about life, involving family but it inserts some crazy and highly unlikely situations and characters, that just don't blend in very well with the movie its story and the approach it was taking. It's an approach that could work out very well for a movie of this sort, as long as all of its situations remain somewhat realistic, which just too often isn't the case for this movie.\\n\\nIt even makes the movie somewhat tiresome after a while. You start wondering were it all be heading at and what the overall point and purpose of the entire movie is. Luckily the movie doesn't ever get annoying, so it still remains a watchable enough little film.\\n\\nIt certainly has some charm to it, which is the saving grace for this movie. Cute is a good way to describe this movie, that luckily doesn't ever become a bittersweet, cuddly one. It's deliberately small and simplistic with its story, characters and settings, which makes this an all the more warm movie to watch. I can certainly see some people still really enjoying this movie, especially females in their 30-40's, which this movie seems to aim towards.\\n\\nI definitely like Chris Rock better in this sort of roles, instead of flat out comedy type of roles. Sure, this movie is still being a comedy but a far more subtle one, that also definitely requires its actors to do a whole lot of acting. So really, even if you just can't stand Chris Rock, you are still able to really like him and his performance in this movie. He doesn't goes overboard with anything and it's being a really humble and human-like performance by him.\\n\\nIt still seemed like an odd choice to me to do this movie mostly in French. It's a movie set in New York but yet Julie Delpy manages to still turn this into mostly a French movie. Nothing wrong with that of course but I just feel that this will scare off a lot of people from ever watching this movie.\\n\\nIt's a fun and sweet enough little movie but also nothing more than just that really.\\n\\n6/10 \\n\\nhttp://bobafett1138.blogspot.com/",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 14982,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2012-05-18",
  "keywords": "reference to brain tumor,reference to masturbation,new york city,human soul,nudity",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Julie Delpy",
      "url": "https://www.imdb.com/name/nm0000365/"
    },
    {
      "name": "Chris Rock",
      "url": "https://www.imdb.com/name/nm0001674/"
    },
    {
      "name": "Albert Delpy",
      "url": "https://www.imdb.com/name/nm0217817/"
    }
  ],
  "director": [
    {
      "name": "Julie Delpy",
      "url": "https://www.imdb.com/name/nm0000365/"
    },
    {
      "name": "Marie Pillet",
      "url": "https://www.imdb.com/name/nm0683531/"
    }
  ],
  "creator": [
    {
      "name": "Julie Delpy",
      "url": "https://www.imdb.com/name/nm0000365/"
    },
    {
      "name": "Alexia Landeau",
      "url": "https://www.imdb.com/name/nm0006952/"
    },
    {
      "name": "Alexandre Nahon",
      "url": "https://www.imdb.com/name/nm1595314/"
    }
  ]
}