

{
  "type": "Movie",
  "name": "Arbitrage",
  "url": "https://www.imdb.com/tt1764183/",
  "poster": "https://m.media-amazon.com/images/M/MV5BODU5ODYyNzM1MF5BMl5BanBnXkFtZTcwNDEwNTQwOA@@._V1_.jpg",
  "description": "A troubled hedge fund magnate desperate to complete the sale of his trading empire makes an error that forces him to turn to an unlikely person for help.",
  "datePublished": "2013-03-01",
  "contentRating": "15",
  "genre": [
    "Drama",
    "Thriller"
  ],
  "duration": "PT1H47M",
  "keywords": "dead body with eyes open,false evidence,new york city,tough woman,female manager",
  "rating": {
    "ratingCount": 54590,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "review": {
    "author": "julian-mumford",
    "dateCreated": "2013-04-10",
    "inLanguage": "English",
    "heading": "Nobody does pretend billionaire as well as Gere",
    "reviewBody": "Nobody does make believe billionaire as well as Richard Gere, something about the way he carries himself encourages audiences to believe he really is that rich, powerful and connected.\\n\\nRobert Miller is a hedge fund magnate with it all, money, beautiful wife (Sarandon) who dabbles in charity work and a son and daughter (Marling) who both work for him, to differing levels of competency.\\n\\nMiller has decided to sell his firm to a financial company desperate to plug a gap in their suite of services and products. Talking of gaps, Miller is desperately trying to paper over some financial cracks of his own, borrowing the odd $400 million to ensure pre-sale audits go well.\\n\\nWhen presented with the first few images and sentiments, those with a healthy dose of cynicism are just waiting to be introduced to Miller&apos;s other life. Enter stage left, the struggling beautiful art dealer, who is being kindly helped by Miller to negotiate her way through the perils of small business ownership. Such assistance being mainly bedroom based will come as no surprise.\\n\\nOf course modern thrillers are like buses, there is always another one around the corner. What sets this apart is the supporting cast, including Tim Roth as Detective Bryer, desperate to nail at least one bad guy protected behind expensive lawyers. Nate Parker as Jimmy, the person Miller calls when he really needs help and of course his wife played by Susan Sarandon, supportive, self aware and enjoying the fruits of his labour.\\n\\nCentral to the film is Gere, who has not always chosen parts wisely in the past but here plays a character he can really sell to the audience. Morally ambiguous, ruthless yet loyal, he manages to make a character we really should not like, somehow likable. Arguably encouraging questionable and morally perplexing empathy from the viewer, as his choices dwindle to rock and hard place territory.\\n\\nGere can act and does so here, Roth manages to convey the woes of the world and is especially good in the first scene with Gere. Not so much a modern fable but a story that evokes that feeling afterwards, how far would you go to protect what you have. Also rather curiously, why would you end up rooting for the bad guy?\\n\\nNot perfect, Britt Marling perhaps not making the most of her emotional scenes. At times the film lacks a harder edge, would Jimmy ever really be that reasonable. However overall, a cut above the mainstream and well worth two hours of your time.\\n\\nSummary \\n\\nA smart, deliciously amoral tale with a strong turn from Gere, choosing a role that suits his talents. Ignored at the box office but hopefully finding a well deserved following at home.\\n\\nGood script, pacing and an interesting ending to this financial based thriller that does not require you to know that Arbitrage means to &apos;take advantage of a price difference between two or more markets&apos;.\\n\\nhttp://julesmoviereviews.blogspot.co.nz/",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "actor": [
    {
      "name": "Richard Gere",
      "url": "https://www.imdb.com/name/nm0000152/"
    },
    {
      "name": "Susan Sarandon",
      "url": "https://www.imdb.com/name/nm0000215/"
    },
    {
      "name": "Brit Marling",
      "url": "https://www.imdb.com/name/nm1779870/"
    }
  ],
  "director": [
    {
      "name": "Nicholas Jarecki",
      "url": "https://www.imdb.com/name/nm1906430/"
    }
  ],
  "creator": [
    {
      "name": "Nicholas Jarecki",
      "url": "https://www.imdb.com/name/nm1906430/"
    }
  ]
}