

{
  "type": "Movie",
  "name": "Argo",
  "url": "https://www.imdb.com/tt1024648/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzljNjY3MDYtYzc0Ni00YjU0LWIyNDUtNTE0ZDRiMGExMjZlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
  "description": "Acting under the cover of a Hollywood producer scouting a location for a science fiction film, a CIA agent launches a dangerous operation to rescue six Americans in Tehran during the U.S. hostage crisis in Iran in 1979.",
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama",
    "Thriller"
  ],
  "datePublished": "2012-11-07",
  "keywords": "hostage,based on true story,iran,1970s,u.s. embassy",
  "duration": "PT2H",
  "actor": [
    {
      "name": "Ben Affleck",
      "url": "https://www.imdb.com/name/nm0000255/"
    },
    {
      "name": "Bryan Cranston",
      "url": "https://www.imdb.com/name/nm0186505/"
    },
    {
      "name": "John Goodman",
      "url": "https://www.imdb.com/name/nm0000422/"
    }
  ],
  "director": [
    {
      "name": "Ben Affleck",
      "url": "https://www.imdb.com/name/nm0000255/"
    }
  ],
  "creator": [
    {
      "name": "Chris Terrio",
      "url": "https://www.imdb.com/name/nm0006516/"
    },
    {
      "name": "Tony Mendez",
      "url": "https://www.imdb.com/name/nm5410196/"
    },
    {
      "name": "Joshuah Bearman",
      "url": "https://www.imdb.com/name/nm2646452/"
    }
  ],
  "review": {
    "author": "macktan894",
    "dateCreated": "2012-10-12",
    "inLanguage": "English",
    "heading": "Quite suspenseful!",
    "reviewBody": "Ben Affleck continues hitting them out of the park. Based on a true story, Argo re-enacts the events that freed American foreign service employees from their hideout in the Canadian Embassy. The setup involves Affleck's character, Mendes, putting together the cover story of a Canadian film crew scouting locations in the Mideast for a sci-fi movie. Alan Arkin & John Goodman are hilarious as Hollywood hotshots producing this surefire scifi hit. The process follows Mendes as he enters Iran and has to BS his way to some skeptical and hostile Iranian theocrats who almost don't know how to respond to the possibility of a scifi movie set in Iran. Mendes must also deal with frightened and reluctant Americans who are being forced out in the open to pose as a movie crew. Affleck does a good job of injecting suspense and dread all through this section.\\n\\nBut the real nail biter is their exit from Iran. As in other movies of this ilk, the chase heats up with the Iranians on the heels of the Americans. Affleck throws into this chase a huge boulder of an obstacle when President Carter pulls the plug on the film crew ex-filtration & decides to go with Delta soldiers instead. If you want to know what happens, I advise you to see the movie or read the news accounts. \\n\\nThis just goes to show you that not all CIA covert actions are led by armed fighters like Jason Bourne and launched by the Treadstone department. Affleck's character doesn't even carry a gun--he carries a script instead.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 636215,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  }
}