

{
  "type": "Movie",
  "name": "Madea's Witness Protection",
  "url": "https://www.imdb.com/tt2215285/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjAzMjczMTU4Nl5BMl5BanBnXkFtZTcwMDk1MTE5Nw@@._V1_.jpg",
  "description": "A Wall Street investment banker who has been set up as the linchpin of his company's mob-backed Ponzi scheme is relocated with his family to Aunt Madea's southern home.",
  "review": {
    "author": "rgblakey",
    "dateCreated": "2012-10-28",
    "inLanguage": "English",
    "heading": "Madea is back for Witness Protection",
    "reviewBody": "Tyler Perry took the film industry by storm when he introduced Madea in his first film Diary of a Man Black Woman. The stories were always filled with comedy, but surrounded by an emotional story that made them so much more. Over time, the idea stayed intact, but Madea has stepped more into the forefront and they have been losing their serious side. With the latest Madea's Witness Protection it seemed to be another with more comedy than drama, but with an all-new twist taking this story outside the norm with the introduction of a white family into Madea's world.\\n\\nMadea's Witness Protection follows an investment banker who is caught up in a Ponzi scheme to take the fall for the Wall Street firm he works for. In exchange for a lighter sentence he decides to work with the District Attorney's office and is put into witness protection in the home of Madea, the District Attorneys aunt. This is probably one of the weakest of all the Perry movies to date. While it's not horrible, it has almost completely lost all of the dramatic aspect that made these movies so effective. There are a few aspects for this family to grow, but it's played up more on the comedy side instead of the usually powerful drama. The cast is fine with the direction of the film, but really the only truly funny moments are that of Madea and Joe both played by Perry himself. They are the kind of characters that if you like them are really funny if you don't then the entire film falls flat. The story is fine even though the reasoning for them being there is a bit far-fetched, but if you can let that go the movie is pretty fun.\\n\\nIn the bigger picture you are either a Perry fan or not. If you like his films then you will enjoy this one despite the lack of the drama; if you don't then you will most likely not see it anyway. The Madea character is one that has become one of those characters that fans love and others are annoyed by. No matter what you feel of the character or these films you cannot deny Perry's ability as a filmmaker and his creativity on bringing her back to the big screen. This is probably not her last appearance, but let's hope he heads back to his roots to find the passion and drama to team up with the comedy to deliver another powerful movie like the one that started it all.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 11313,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.9
  },
  "contentRating": "PG-13",
  "genre": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "datePublished": "2012-06-29",
  "keywords": "2010s,wall street,investment banker,banker,mabel 'madea' simmons character",
  "duration": "PT1H54M",
  "actor": [
    {
      "name": "Tyler Perry",
      "url": "https://www.imdb.com/name/nm1347153/"
    },
    {
      "name": "Eugene Levy",
      "url": "https://www.imdb.com/name/nm0506405/"
    },
    {
      "name": "Denise Richards",
      "url": "https://www.imdb.com/name/nm0000612/"
    }
  ],
  "director": [
    {
      "name": "Tyler Perry",
      "url": "https://www.imdb.com/name/nm1347153/"
    }
  ],
  "creator": [
    {
      "name": "Tyler Perry",
      "url": "https://www.imdb.com/name/nm1347153/"
    }
  ]
}