

{
  "type": "Movie",
  "name": "Paranormal Activity 4",
  "url": "https://www.imdb.com/tt2109184/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNjAxMzM0MjYwM15BMl5BanBnXkFtZTcwMjMwMjAyOA@@._V1_.jpg",
  "description": "It has been five years since the disappearance of Katie and Hunter, and a suburban family witness strange events in their neighborhood when a woman and a mysterious child move in.",
  "review": {
    "author": "annashewring",
    "dateCreated": "2013-01-21",
    "inLanguage": "English",
    "heading": "Frighteningly disappointing",
    "reviewBody": "Despite only finding at best mixed reviews, I had high hopes for this film as a fan of the series; the original Paranormal Activity was a refreshing change from what had become a stale and repetitive phase of horror films. I was apprehensive that a sequel would be a disappointment but was, if anything, better than the first installment. I enjoyed the third film to an extent, turning a blind eye to the repetitiveness and weak story. The cliff-hanger ending reassured me that the fourth Paranormal Activity would answer the fairly basic questions which are the only reasons that we feel the need to watch every film in this series. \\n\\nHowever, Paranormal Activity 4 is the most disappointing yet. Granted, some moments would make me jumpif those moments weren&apos;t almost identical to the ones in the first, second and third films. Not only are the scares hugely predictable, but this installment doesn&apos;t even answer any of the questions that audiences have. In fact, it somehow manages to raise more, particularly with the frankly terrible ending \\u2013 OK, so a long time ago, someone in the original family made a pact to give the first-born male to this Demon. The first-born male being Hunter, who was kidnapped by Katie in the second film. We still do not known exactly what this has to do with the coven of countless women who are seen in the third film, and at the end of the fourth film. \\n\\nAside from the hopes of sucking more money from viewers who have been drawn into the original genius of these films, I don&apos;t see what is stopping the demon from taking Hunter and that being the end of it. Especially now that the demon has control of a Human body (Katie) and all of Hunters family is dead so there is no one to stop it or try to save him.\\n\\nOverall, this film was hugely disappointing, failing completely to recover from the slump of story line and structure, which the third film saw. As much as I would love to say that I will not bother watching any more of these films, this wouldn&apos;t be true because I need to have my questions answered and find out what it&apos;s all about. All we can hope is that they do something a little bit different next time and finally wrap up the story.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 69915,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.6
  },
  "contentRating": "15",
  "genre": [
    "Horror",
    "Mystery"
  ],
  "datePublished": "2012-10-17",
  "keywords": "door alarm,toy,trail,supernatural horror,supernatural power",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Stephen Dunham",
      "url": "https://www.imdb.com/name/nm0242295/"
    },
    {
      "name": "Katie Featherston",
      "url": "https://www.imdb.com/name/nm2209370/"
    },
    {
      "name": "Matt Shively",
      "url": "https://www.imdb.com/name/nm2397866/"
    }
  ],
  "director": [
    {
      "name": "Henry Joost",
      "url": "https://www.imdb.com/name/nm1160962/"
    },
    {
      "name": "Ariel Schulman",
      "url": "https://www.imdb.com/name/nm1413364/"
    }
  ],
  "creator": [
    {
      "name": "Christopher Landon",
      "url": "https://www.imdb.com/name/nm0484907/"
    },
    {
      "name": "Chad Feehan",
      "url": "https://www.imdb.com/name/nm1739039/"
    },
    {
      "name": "Oren Peli",
      "url": "https://www.imdb.com/name/nm2305431/"
    }
  ]
}