

{
  "type": "Movie",
  "name": "Skyfall",
  "url": "https://www.imdb.com/tt1074638/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMWZiNjE2OWItMTkwNy00ZWQzLWI0NTgtMWE0NjNiYTljN2Q1XkEyXkFqcGdeQXVyNzAwMjYxMzA.jpg",
  "description": "James Bond's loyalty to M is tested when her past comes back to haunt her. When MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost.",
  "review": {
    "author": "anders-rock",
    "dateCreated": "2012-10-25",
    "inLanguage": "English",
    "heading": "Wow!",
    "reviewBody": "This is one of the best Bond movies I have ever seen. The story is superbly put together and has some interesting twists, the action is well done and contains none of the shaky cam which plagued the last film. The actors all do a great job. Some might still be put off by Daniel Craig's rough version of Bond, but I like it and he even has a few good old fashioned one-liners here. I wasn't sure about Javier Bardem as the villain at first. I thought he was a tad too flamboyant but eventually he grew on me, plus he had a very interesting backstory and as you might have guessed already, Judi Dench is fantastic as usual as M and she even has more to do in the story this time arround. This is not a completely formulaic Bond movie. Craig's bond is still more emotional than Connery or Moore ever were and for the first time we get some relatively detailed descriptions of his childhood. And something happens to Bond in the start of the movie that affects him for the rest of the film. But despite all that there are tons of James Bond trademarks like the martini, the introduction and even Q. Some might not like this new very young version of Q but I found him to be funny and very likable. They will never top Desmond Llewelyn's original performance, and instead of making a cheap Llewelyn clone, they make a completely different character which I think is the only right thing to do. This is not only a great Bond movie but just a downright great film.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 727088,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.8
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Thriller"
  ],
  "datePublished": "2012-10-26",
  "keywords": [
    "007",
    "death of major character",
    "official bond film",
    "official james bond series",
    "james bond character"
  ],
  "duration": "PT2H23M",
  "actor": [
    {
      "name": "Daniel Craig",
      "url": "https://www.imdb.com/name/nm0185819/"
    },
    {
      "name": "Javier Bardem",
      "url": "https://www.imdb.com/name/nm0000849/"
    },
    {
      "name": "Naomie Harris",
      "url": "https://www.imdb.com/name/nm0365140/"
    }
  ],
  "director": [
    {
      "name": "Sam Mendes",
      "url": "https://www.imdb.com/name/nm0005222/"
    }
  ],
  "creator": [
    {
      "name": "Neal Purvis",
      "url": "https://www.imdb.com/name/nm0701031/"
    },
    {
      "name": "Robert Wade",
      "url": "https://www.imdb.com/name/nm0905498/"
    },
    {
      "name": "John Logan",
      "url": "https://www.imdb.com/name/nm0517589/"
    }
  ]
}