

{
  "type": "Movie",
  "name": "Take This Waltz",
  "url": "https://www.imdb.com/tt1592281/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjIzOTc1NTExNV5BMl5BanBnXkFtZTcwOTg5MTY2Nw@@._V1_.jpg",
  "description": "A happily married woman falls for the artist who lives across the street.",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2012-08-17",
  "duration": "PT1H56M",
  "contentRating": "15",
  "keywords": "female full frontal nudity,pubic hair,love triangle,female pubic hair,woman undresses",
  "rating": {
    "ratingCount": 30183,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "review": {
    "author": "camillesummercat",
    "dateCreated": "2013-03-08",
    "inLanguage": "English",
    "heading": "In-between of Things",
    "reviewBody": "'I'm afraid of being in-between of things.' That's a beautiful line quoted by Margo from a film called 'Take this waltz'. Attracted by the title which reminded me of Leonard Cohen's song which turned out to be the same source at the first place, also the cast especially Michelle Williams that I find quite special, special in a way that her appearance seems to be fragrant because of how she looks like. I somehow believed that the character resembles a lot with her in real life. We all know her divorced co-star husband Heath Ledger died of an overdose accident, and they have a daughter named Mathilda. After his death she somehow emerges into a characterized actress. You can see her playing depressed wife, Marilyn Monroe, and this confused in-house freelance writer not knowing what to write about. It's all very well chosen with her characters. When I see the way she read out the lines, in a naturally performed way, there's a kind of magic and it must be coming from all what she experienced. Of course every actor's acting style comes from their own life and experience. Yet Michelle has this very sincere attitude of not disguising what went through in her spiritually and physically. Her nudity is not difficult to be found. Although a mother to daughter, her figure remains like a maid, pure and simple. It seems like having a child brings her nothing but growth, growth of innocence and courage of showing the real self inside of her.\n\nThe film involves a freelance writer Margo who married to a cookbook author and they enjoyed leisure house life on a Portugal region in Toronto, Canada. The couple is happily engaged with their friends and natives. Parties are thrown every now and then. They sometimes argue, but generally leading a sweet and contented marriage till she encounters with a handsome guy at a tourism site. The magic connection drew on these two strangers. They both found each other very strangely familiar. And right at the first conversation they felt natural enough to joke each other and explain one's inner feelings. Together they make a couple of innocent child embarking on an intuitive sight of the world sparkling only in their eyes. It's fun and haunting, especially when it's found they're only neighbors across from street.\n\nYet the thrill of encounter only keeps in a very cautious way, which makes it all the more alluring. They interact in an extremely explicit and intimate verbal way to displace physical attraction. Imaginary stroking, kissing and intercourse touched their mind with fulfilled excitement. Every morning she followed him or vice versa to the beach, cafés and the swimming pool, where they swim like dolphins, getting near and dodging away. When he attempted to grab her ankle, the moment suddenly halted and she just left like that. She felt like the spell will be broken once the intimacy takes off to a further step. And she's still guarding herself from the fear of casting herself in the craziness of love affair.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "actor": [
    {
      "name": "Michelle Williams",
      "url": "https://www.imdb.com/name/nm0931329/"
    },
    {
      "name": "Seth Rogen",
      "url": "https://www.imdb.com/name/nm0736622/"
    },
    {
      "name": "Sarah Silverman",
      "url": "https://www.imdb.com/name/nm0798971/"
    }
  ],
  "director": [
    {
      "name": "Sarah Polley",
      "url": "https://www.imdb.com/name/nm0001631/"
    }
  ],
  "creator": [
    {
      "name": "Sarah Polley",
      "url": "https://www.imdb.com/name/nm0001631/"
    }
  ]
}