

{
  "type": "Movie",
  "name": "The Odd Life of Timothy Green",
  "url": "https://www.imdb.com/tt1462769/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOTNkYjM1YTAtYTFiOC00ZDY2LWI5ZDYtODEwZDM4ZDljNDgwXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
  "description": "A childless couple bury a box in their backyard, containing all of their wishes for an infant. Soon, a child is born, though Timothy Green is not all that he appears.",
  "contentRating": "U",
  "genre": [
    "Comedy",
    "Drama",
    "Family"
  ],
  "datePublished": "2013-04-05",
  "keywords": "adoption,prologue,scene during opening credits,10 year old,little boy",
  "duration": "PT1H45M",
  "rating": {
    "ratingCount": 48430,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "review": {
    "author": "Boba_Fett1138",
    "dateCreated": "2012-09-16",
    "inLanguage": "English",
    "heading": "There is something odd about this movie, indeed.",
    "reviewBody": "Something is missing from this movie. By all means, this should had been a great, entertaining and heartfelt, modern fairy tale, for the whole family to enjoy but the movie handles certain themes poorly and make some odd choices with its story at times.\\n\\nAnd honestly, I still foremost really liked the movie. It&apos;s harmless and cute enough still and the movie has its moments. But that doesn&apos;t take away anything from the fact that this movie still is being a bit of a missed opportunity.\\n\\nAll of the right intentions were there, it just didn&apos;t always worked out successfully. The approach they were going for was a heartfelt family movie, in which a mysterious young boy brings people together and changes their lives for the positive. It just happen to do it all in a wrong way, for most of the time. First of all; it does far too little with its mystery/fantasy aspects. They accept the boy for who he is and where he came from pretty early on- and easily. Besides, it all seems like the boy is doing very little special actually, as if the movie was afraid it would loose some of its viewers if it was going to be more heavy on its fantasy aspects.\\n\\nThat perhaps was the movie its biggest problem; it wasn&apos;t heavy on its fantasy. The movie rather picks some uninteresting plot developments instead. It prefers to be about pencils, as opposed to something more heartfelt or bigger than life. It seems like the movie still wanted to be about morals and wanted to teach you about life but it mostly does so by inserting stereotypical characters and some forced or formulaic dramatic moments. It&apos;s not as warm and emotional involving as this movie required to be, in order for it to let it all work out.\\n\\nI am also still a bit confused about it who this movie was aimed for. It seems to be a bit too slow and uninteresting for young children and not convincing enough for adults. It&apos;s a bit in between of being an entertaining children&apos;s movie and a modern fairy tale for adults. I did wished they had balanced certain things out a bit better, so the movie would had been better and more fun to watch for both adults and youngsters. \\n\\nThe movie is still being fine as it is. I mean, all the things I had problems with didn&apos;t ruined the movie for me in any way and I could certainly still enjoy and appreciate it for what it was. It&apos;s cuteness factor and innocence still make this a recommendable film. Just don&apos;t expect to be very taken- or blown away by any of it.\\n\\n7/10 \\n\\nhttp://bobafett1138.blogspot.com/",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 48430,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "actor": [
    {
      "name": "Jennifer Garner",
      "url": "https://www.imdb.com/name/nm0004950/"
    },
    {
      "name": "Joel Edgerton",
      "url": "https://www.imdb.com/name/nm0249291/"
    },
    {
      "name": "CJ Adams",
      "url": "https://www.imdb.com/name/nm2640264/"
    }
  ],
  "director": [
    {
      "name": "Peter Hedges",
      "url": "https://www.imdb.com/name/nm0373282/"
    }
  ],
  "creator": [
    {
      "name": "Peter Hedges",
      "url": "https://www.imdb.com/name/nm0373282/"
    },
    {
      "name": "Ahmet Zappa",
      "url": "https://www.imdb.com/name/nm0953257/"
    }
  ]
}