

{
  "type": "Movie",
  "name": "Fright Night",
  "url": "https://www.imdb.com/tt0089175/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjQzMTM4NzUyM15BMl5BanBnXkFtZTgwNDYyODgwNzE@._V1_.jpg",
  "description": "A teenager believes that the newcomer in his neighborhood is a vampire. He turns to an actor in a television horror show for help to deal with the undead.",
  "datePublished": "1986-04-11",
  "contentRating": "18",
  "genre": [
    "Horror"
  ],
  "duration": "PT1H46M",
  "keywords": "vampire,horror host,teenager,homosexual subtext,killed by a vampire",
  "rating": {
    "ratingCount": 77917,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "review": {
    "author": "Krug Stillo",
    "dateCreated": "2003-05-31",
    "inLanguage": "English",
    "heading": "They had Scream in the 90s, some of us had Fright Night in the 80s",
    "reviewBody": "A Classic! Spawning a whole new subgenre of vampire movies e.g. Vamp (Richard Wenk, 1986), Near Dark (Katheryn Bigelow, 1987), Bram Stoker's Dracula (Coppola. 1991) and Blade (Stephen Norrington, 1998), Fright Night is very similar to Count Yoga - Vampire, but is a brilliant film in its own right. If you can get past those eighties fashions and mannerisms this is a timeless treasure.\n\nCharlie Brewster (Ragsdale) is the student/horror film fanatic accusing his super-suave next door neighbour, Jerry Dandridge (Sarandon) of being a bloodsucker. He begs cowardly, unemployed has-been horror veteran, Peter Vincent, 'The Great Vampire Killer' (excellent performance by McDowell) to help him stake the Vampire. Cue lots of laughs, scares and some genuine unforgettable sequences. Fright Night predates the Scream trilogy by over a decade and does a much better job of combining the chills and jokes with tongue in cheek all the way. Like the homoerotic Interview with the Vampire (Neil Jordan, 1994), there's a subplot concerning Brewster loosing interest in his girlfriend and obsessing over the good looking man next door.\n\nBrad Fiedel (The Terminator & Serpent and the Rainbow) and Tangerine Dream (Firestarter & The Keep)'s soundtrack here is also perfect and almost steals the show. Tom Holland, who had previously gained recognition and flashed his genre credentials for his screenplays for The Beast Within (Philippe Mora, 1982) and Psycho 2 (Richard Franklin, 1983), would go on to give us the charismatic killer doll, Chucky, in the original Child's Play movie, also starring Chris Sarandon.\n\nThe Fright Night sequel followed in 1987, but was too similar to its predecessor and lacked the intense, roller-coaster feeling. It's still worth seeing though, for McDowell and Ragsdale's return to the characters, I for one, will mostly remember them for. Stephen Geoffreys also deserves a mention for his OTT performance as Charlie's manic best friend, Evil Ed.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "actor": [
    {
      "name": "Chris Sarandon",
      "url": "https://www.imdb.com/name/nm0001697/"
    },
    {
      "name": "William Ragsdale",
      "url": "https://www.imdb.com/name/nm0706619/"
    },
    {
      "name": "Amanda Bearse",
      "url": "https://www.imdb.com/name/nm0000294/"
    }
  ],
  "director": [
    {
      "name": "Tom Holland",
      "url": "https://www.imdb.com/name/nm0276169/"
    }
  ],
  "creator": [
    {
      "name": "Tom Holland",
      "url": "https://www.imdb.com/name/nm0276169/"
    }
  ]
}