

{
  "type": "Movie",
  "name": "Happy Feet Two",
  "url": "https://www.imdb.com/tt1402488/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQxYzliYWMtYjkwYi00YjMxLWIxNDgtODYxYmQyYjZkMGFlXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
  "description": "Mumble's son, Erik, is struggling to realize his talents in the Emperor Penguin world. Meanwhile, Mumble and his family and friends discover a new threat their home -- one that will take everyone working together to save them.",
  "review": {
    "author": "EmmaDinkins",
    "dateCreated": "2011-11-21",
    "inLanguage": "English",
    "heading": "Chix Chat on Film review: Mumble is still heroic and he's a dad.",
    "reviewBody": "It is very difficult to make an entertaining movie that has a lesson in the consequences of climate change on the Antarctic wildlife, just as it is always hard to live up to the original when you're a sequel. This sequel made the lesson entertaining but the film did not live up to the original. I really enjoyed the original and watched it many times over, I'm not so sure I would do the same with Two. The lesson in Happy Feet was clear cut and the scandalous humans did try to resolve the atrocity of depleting the penguins food source, but in Happy Feet Two nothing was really clear except that the polar icecaps are melting and now the Emperor penguins fully accept song and dance. Mumble (Elijah Wood) and Gloria (P!nk) now have had an egg of their own, and are now parents to Erik (Ava Acres). Mumble is challenged to be a good father and Erik is on a path of self discovery. The role of Gloria is filled nicely, her singing prowess made the opening Rhythm Nation production amazing, it was actually the most outstanding compilation in the entire film and would have been more fitting as the grand finale song. I unlike Catt was not thrilled by the krill, I have yet to figure out what the krill was the point of the krill storyline with Bill the Krill (Matt Damon) and Will the Krill (Brad Pitt) other than to add some big names to the film since Norma Jean (Nicole Kidman) and Memphis (Hugh Jackman) did not reprise their roles. I really liked what was happening with Ramon (Robin Williams) in this story, with the whole hatin' on The Mighty Sven (Hank Azaria) while pursuing Carmen (Sofia Vergara), the chase could have been expanded in place of the krill story filler. The movie just seemed to have a number of encounters loosely strung together with no outstanding purpose of it all, unlike the original with the fact that different can be the one thing that saves everybody. Maybe the message of this film was if humans venture to aid the wildlife and we don't succeed, they'll figure out a resolution to their problem themselves. Or when everyone works together to deal with a problem no matter how big or how small you are you can overcome any obstacle. Or maybe I just didn't get the point, which is why this film gets an amber light.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 47395,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2011-12-02",
  "keywords": "anthropomorphic penguin,seal the animal,computer animation,furry,slimehouse",
  "duration": "PT1H57M",
  "actor": [
    {
      "name": "Elijah Wood",
      "url": "https://www.imdb.com/name/nm0000704/"
    },
    {
      "name": "Robin Williams",
      "url": "https://www.imdb.com/name/nm0000245/"
    },
    {
      "name": "Pink",
      "url": "https://www.imdb.com/name/nm0600877/"
    }
  ],
  "director": [
    {
      "name": "George Miller",
      "url": "https://www.imdb.com/name/nm0004306/"
    },
    {
      "name": "Gary Eck",
      "url": "https://www.imdb.com/name/nm0248495/"
    },
    {
      "name": "David Peers",
      "url": "https://www.imdb.com/name/nm1668276/"
    }
  ],
  "creator": [
    {
      "name": "George Miller",
      "url": "https://www.imdb.com/name/nm0004306/"
    },
    {
      "name": "Gary Eck",
      "url": "https://www.imdb.com/name/nm0248495/"
    },
    {
      "name": "Warren Coleman",
      "url": "https://www.imdb.com/name/nm0171253/"
    }
  ]
}