

{
  "type": "Movie",
  "name": "Kung Fu Panda 2",
  "url": "https://www.imdb.com/tt1302011/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzQ0ZWIxZjAtYWI3Yy00MGM0LWFjOGYtNzcyYThiOTA3ODI1XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
  "description": "Po and his friends fight to stop a peacock villain from conquering China with a deadly new weapon, but first the Dragon Warrior must come to terms with his past.",
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Action",
    "Adventure"
  ],
  "datePublished": "2011-06-10",
  "keywords": "courage,chinese food,china,father son relationship,genocide",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Jack Black",
      "url": "https://www.imdb.com/name/nm0085312/"
    },
    {
      "name": "Angelina Jolie",
      "url": "https://www.imdb.com/name/nm0001401/"
    },
    {
      "name": "Jackie Chan",
      "url": "https://www.imdb.com/name/nm0000329/"
    }
  ],
  "director": [
    {
      "name": "Jennifer Yuh Nelson",
      "url": "https://www.imdb.com/name/nm0950775/"
    }
  ],
  "creator": [
    {
      "name": "Jonathan Aibel",
      "url": "https://www.imdb.com/name/nm0008743/"
    },
    {
      "name": "Glenn Berger",
      "url": "https://www.imdb.com/name/nm0074184/"
    },
    {
      "name": "Ethan Reiff",
      "url": "https://www.imdb.com/name/nm0717550/"
    }
  ],
  "review": {
    "author": "bob the moo",
    "dateCreated": "2019-06-02",
    "inLanguage": "English",
    "heading": "Enjoyable family film that adds a bit of darkness, and a lot of scale, to the strengths of the first film",
    "reviewBody": "I'd not seen the first Kung-Fu Panda film since it had come out in the late noughties, and I hadn't seen any of the other ones at all until it my toddler started watching them and I picked up 2 and 3 for her. After watching the first one loads, I managed to move her to the second, for my own variety as much as anything else. The plot sees Po trying to settle into his new role as Dragon Warrior, at the same time as a banished son returns to the city to use a new powerful weapon to seize control of the city and country. It has a slightly darker tone than the first film, because it touches on Po's backstory, and it carries itself with more dramatic sequences than the first film did (where we only got to see the power and anger of Tai Lung in a handful of scenes - mostly the film was about Po's training).\\n\\nThis slightly extra weight adds to the characters and the narrative, and at the same time the scale of the film feels bigger as we move into a city, with the stakes high. This means the action sequences feel like they mean more, and in return the actions is bigger, more polished, and fits well with the gravity-defying excess of the genre that the film is referencing and drawing from. It did this well in the first film too, but here it feels much more satisfying in the scale of it all. At its heart though the film remains funny, entertaining, easy for families, and with good moral messages throughout. As with the first film, the use of Chinese culture swings from mostly feeling well used and cleverly adopted, to being a bit cheap - but mostly it works well.\\n\\nAnimation and production is of a very high standard, and the voice cast is even deeper than in the first film, with people like Oldman, Yeoh, Haysbert, Garber, Van Damme, and McBride joining an already very starry cast. Black doesn't always work for me, but he keeps Po funny but likeable, while Oldman manages to bring gravity to his performance and have good comic timing too.\\n\\nIn my mind, the Kung-Fu Panda films were sort of 'lesser' films because I always saw Pixar's deeper content as being superior to Dreamworks stuff, however this second film lifts from the already good first, and is a very enjoyable and satisfying family film.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 313466,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.2
  }
}