

{
  "type": "Movie",
  "name": "New Year's Eve",
  "url": "https://www.imdb.com/tt1598822/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI2Mzg2MDQxOV5BMl5BanBnXkFtZTcwNzc3NTY5Ng@@._V1_.jpg",
  "description": "The lives of several couples and singles in New York City intertwine over the course of New Year's Eve.",
  "review": {
    "author": "gradyharp",
    "dateCreated": "2012-05-09",
    "inLanguage": "English",
    "heading": "Popcorn",
    "reviewBody": "NEW YEAR'S EVE falls into that class of films best labeled 'cute'. Lots of stories, most of little consequence, an attempt to pull everything together with the premise that new Year's Eve gives everyone a chance to make things different in the following year (the New Year's Resolution carried to the extreme), some funny jokes pushed over the edge toward silly, and a script full of holes. But the bouncing around from micro story to micro story works OK because it gives the actors involved a chance to come on set for a day or two of work and leave unstressed and financially healthy. Katherine Fugate wrote the stewed ingredient stories for Garry Marshall to stir, and the list of actors involved is staggering: Michelle Pfeiffer, Zac Efron, Robert De Niro, Halle Berry, Cary Elwes, Jessica Biel, Seth Meyers , Sarah Paulson, Til Schweiger, Carla Gugino, Katherine Heigl, Jon Bon Jovi, Sofía Vergara, Ashton Kutcher, Lea Michele, Sarah Jessica Parker, Abigail Breslin, Josh Duhamel, Larry Miller, Penny Marshall, Cherry Jones, Hilary Swank, Ludicrous, Hector Elizondo, Ryan Seacrest, Matthew Broderick, John Lithgow and more.\n\nThis is a razzle dazzle movie with some good moments, improbable though they mostly are, and a nice mindless evening to enjoy popcorn. Enter with low expectations and take it for what it is - entertainment. \n\nGrady Harp",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 89647,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Romance"
  ],
  "datePublished": "2011-12-08",
  "keywords": "statue of liberty new york city,video conferencing,guilty pleasure,warner bros.,new year",
  "duration": "PT1H58M",
  "actor": [
    {
      "name": "Sarah Jessica Parker",
      "url": "https://www.imdb.com/name/nm0000572/"
    },
    {
      "name": "Jessica Biel",
      "url": "https://www.imdb.com/name/nm0004754/"
    },
    {
      "name": "Ashton Kutcher",
      "url": "https://www.imdb.com/name/nm0005110/"
    }
  ],
  "director": [
    {
      "name": "Garry Marshall",
      "url": "https://www.imdb.com/name/nm0005190/"
    }
  ],
  "creator": [
    {
      "name": "Katherine Fugate",
      "url": "https://www.imdb.com/name/nm0297545/"
    }
  ]
}