

{
  "type": "Movie",
  "name": "Wrecked",
  "url": "https://www.imdb.com/tt1316622/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjE1MTc5NjQxMV5BMl5BanBnXkFtZTcwODIwNDc3NA@@._V1_.jpg",
  "description": "A man wakes in a car wreck at the bottom of a ravine and must overcome incredible odds to survive.",
  "review": {
    "author": "Leopoldus",
    "dateCreated": "2011-07-29",
    "inLanguage": "English",
    "heading": "Fasten your seat belt",
    "reviewBody": "For you never know what is going to happen. I haven't heard anything about this movie and went to IMDb to check out the reviews about it prior to watching it. Considering them exceedingly bad, I decided to check it out anyway, to make my own mind. Well, I have a few things to say. It is a slow movie. I understand some viewers might find it annoying. BUT If you read the Trivias about this flick, you will learn it has been written without knowing where it was going. Without being aware of that I too found this movie exceedingly boring, because it lacks proper timing for twists or actions in a way. Knowing that, and if you're not afraid of independent (even experimental) movies, you can go on and you might enjoy it. If you are a fan of Adrien Brody, you should probably watch this movie as well, because he really fits well in the part of a man knowing as much as the viewer do as the movie begins, sadly he has to fight until the end, and so does the viewer who thought he was in for a special thriller and survival movie like Cast Away and/or 127 hours. You have to be aware that even though it's quite close to those films due to the subject, you cannot compare at all, for this is, I repeat, a whole experience considering the non- conventional way of writing. All that to say, if you're looking for some strong thrills watching a man struggling for his own survival, you should probably stick to Cast Away & 127 hours. On the other hand, if you're willing to witness another type of setting for a man trying to figure out what he is doing here and why, a low budget movie exploring the nothingness as the new standard for making a story, then Wrecked is a movie to watch. Thanks to Adrien Brody's performance, and the nature of the experimental writing process revealed, this movie deserves a 6 out of 10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 16904,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": "15",
  "genre": [
    "Adventure",
    "Drama",
    "Mystery"
  ],
  "datePublished": "2011-06-10",
  "keywords": "memory,man with no name,minimal cast,amnesia,hallucination",
  "duration": "PT1H31M",
  "actor": [
    {
      "name": "Adrien Brody",
      "url": "https://www.imdb.com/name/nm0004778/"
    },
    {
      "name": "Caroline Dhavernas",
      "url": "https://www.imdb.com/name/nm0223518/"
    },
    {
      "name": "Ryan Robbins",
      "url": "https://www.imdb.com/name/nm0730455/"
    }
  ],
  "director": [
    {
      "name": "Michael Greenspan",
      "url": "https://www.imdb.com/name/nm1042371/"
    }
  ],
  "creator": [
    {
      "name": "Christopher Dodd",
      "url": "https://www.imdb.com/name/nm1027626/"
    }
  ]
}