{
  "type": "Movie",
  "name": "Seed of Chucky",
  "url": "https://www.imdb.com/tt0387575/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTIwMTczMjc3M15BMl5BanBnXkFtZTcwODcxMzcyMQ@@._V1_.jpg",
  "description": "Chucky and Tiffany are resurrected by their innocent gender-confused child, Glen/Glenda, and hit Hollywood, where a movie depicting the killer dolls&apos; murder spree is underway.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2018-12-29",
    "inLanguage": "English",
    "heading": "Deliverance of evil",
    "reviewBody": "Having been on a roll watching and reviewing gradually over time films belonging in horror film franchises, the Chucky/&apos;Child&apos;s Play&apos; films were the most recent to get this treatment. Part of my want to see them was my fascination to see if killer doll Chucky deserved his horror icon status. My conclusion seeing the films is that he does deserve it and a hugely entertaining and creepy character, that is quite a bit better than the films.\n\nThe Chucky/&apos;Child&apos;s Play&apos; films are a mixed bag. The best of the series is still the first film followed quite closely by &apos;Bride of Chucky&apos;, enjoyed both immensely while acknowledging their imperfections. Did sort of like the second too while being mixed to indifferent on the third (which gets a lot of dislike but for me it wasn&apos;t that bad). &apos;Seed of Chucky&apos; is a step or two down from &apos;Bride of Chucky&apos; and my feelings are the same as those for &apos;Child&apos;s Play 3&apos;, thinking it was not that bad but didn&apos;t do an awful lot for me at the end of the day. Whether it&apos;s the worst of the series is debatable, have heard from friends that the films that followed are worse, having said that it is not hard to see why it is one of the lower rated films of the series here and why many dislike it. This is disappointing as this did have potential to be one of the best Chucky/&apos;Child&apos;s Play&apos; films if it was as good as &apos;Bride of Chucky&apos;, considering that Chucky and Tiffany return and there is again emphasis on comedy.\n\nLets start with the good things. &apos;Seed of Chucky&apos; looks great. It is filmed with a lot of atmosphere, has a suitably eerie look and the special effects are nothing short of terrific. The music score is one of the best of the series, its hauntingly ominous sounds not easy to forget in the long run. Tiffany steals the show here pretty much, being both amusing and creepy, and Jennifer Tilly does have a ball playing her, wisely not taking it too seriously. Brad Dourif is still deliciously malevolent as Chucky, though he should have had more to do.\n\nWhile not near as fresh or witty as the humour in &apos;Bride of Chucky&apos;, there are some darkly funny parts and lines. The parodies and in-jokes need familiarity in order to get them, being familiar with a vast majority of them this was not a problem for me, but some do work. The memorable being a quite hilarious cameo from John Waters. Another scene stealer was Glen/Glenda, hilariously played by Billy Boyd.\n\n&apos;Seed of Chucky&apos; however has a number of serious problems. The story is both daft and lacking oomph, also suffering from trying to cram in too much and struggling to balance it all and properly exploring it. Meaning it all feels muddled and over-stuffed with the Glen/Glenda being particularly over-complicated. With the funny moments, there are moments but it&apos;s not consistent. Other parts feel very limp and stale.\n\nFound that the supporting cast on the most part were very bland, with one of the biggest faults of the film being the utterly wretched performance from Redman, out of place and annoying. &apos;Seed of Chucky&apos; is severely lacking in the horror elements, where there is pretty much no atmosphere or mood. It is more reliant on gore rather than suspense or creepiness, and it is a big problem as it is overused to the point of abuse and too much of it is rather gratuitously tasteless. The kills are neither creative, palm-sweating or nail-biting, instead being predictable, sometimes silly and the overuse and gratuity of the gore hampers them. Don Mancini&apos;s directorial ineperience is all over.\n\nAltogether, a lot of serious faults here but there are things that prevent it from being a complete waste of time. 5/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 49497,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.9
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Horror",
    "Thriller"
  ],
  "datePublished": "2005-05-13",
  "keywords": "back from the dead,murderer duo,female villain,victim,murder spree",
  "duration": "PT1H27M",
  "actor": [
    {
      "name": "Jennifer Tilly",
      "url": "https://www.imdb.com/name/nm0000236/"
    },
    {
      "name": "Brad Dourif",
      "url": "https://www.imdb.com/name/nm0000374/"
    },
    {
      "name": "John Waters",
      "url": "https://www.imdb.com/name/nm0000691/"
    }
  ],
  "director": [
    {
      "name": "Don Mancini",
      "url": "https://www.imdb.com/name/nm0238841/"
    }
  ],
  "creator": [
    {
      "name": "Don Mancini",
      "url": "https://www.imdb.com/name/nm0238841/"
    }
  ]
}