{
  "type": "Movie",
  "name": "The Big Bounce",
  "url": "https://www.imdb.com/tt0315824/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTU5NDM5ODEyM15BMl5BanBnXkFtZTYwMTcyMTY3._V1_.jpg",
  "description": "A small-time con artist and a Hawaiian real estate developer&apos;s mischevious, enterprising mistress team up for a potential $200,000 score.",
  "review": {
    "author": "christian123",
    "dateCreated": "2004-12-01",
    "inLanguage": "English",
    "heading": "Big waste of time and talent",
    "reviewBody": "Based on an Elmore Leonard novel, Owen Wilson plays Jack Ryan, an affable surfer who gets pulled into a crime caper by Nancy (Sara Foster), the beautiful mistress of a wealthy developer in Oahu, Hawaii. Soon, he and a judge, played by Morgan Freeman, are plotting against the developer, but Jack finds that he got more than he bargained for with Nancy.\n\nI have never read the novel so I can&apos;t compare the movie to the book but I doubt the book is this bad. If Elmore Leonard doesn&apos;t like it then it&apos;s probably a disgrace to the book. The story itself isn&apos;t very fresh or new though the film does have an impressive cast. Unfortunately, the cast did little to help this very poor film. It ended up being a big waste of time and talent. The movie is just very dull and stupid. There really isn&apos;t a very clear idea of what type of genre this movie is supposed to be in. It wasn&apos;t a comedy because it wasn&apos;t funny at all. It wasn&apos;t a thriller because it offered no surprises. It was a crime caper except it wasn&apos;t very exciting and it offered no intrigue at all.\n\nThe acting is surprisingly flat and dull. Most of the actors seem to be more interested in a paycheck than anything else. This is Owen Wilson&apos;s worst film to date and it&apos;s also his worst performance. He just didn&apos;t seem to be trying at all. Gary Sinise wasn&apos;t used much which is a good thing because his performance was pretty mundane. Charlie Sheen tried way too hard to be funny and he ended up just being annoying. Morgan Freeman just gave a dull performance and Sara Foster was pretty weak but she is beautiful.\n\nI blame director George Armitage for this garbage. He had the right actors and the right story, he just couldn&apos;t keep a good focus on it. There were a bunch of ideas going all over the place and the film was just so messy. He doesn&apos;t keep the audience guessing because they most likely won&apos;t care. He doesn&apos;t keep the audience entertained because there are very few engaging scenes. He really has nothing important to say either and The Big Bounce is just a very unnecessary movie. In the end, The Big Bounce is simply not worth watching. Rating 3/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 18741,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.9
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Crime"
  ],
  "datePublished": "2004-01-30",
  "keywords": "white panties,blonde,female nudity,consensual sex,yellow bikini",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Owen Wilson",
      "url": "https://www.imdb.com/name/nm0005562/"
    },
    {
      "name": "Morgan Freeman",
      "url": "https://www.imdb.com/name/nm0000151/"
    },
    {
      "name": "Gary Sinise",
      "url": "https://www.imdb.com/name/nm0000641/"
    }
  ],
  "director": [
    {
      "name": "George Armitage",
      "url": "https://www.imdb.com/name/nm0000786/"
    }
  ],
  "creator": [
    {
      "name": "Elmore Leonard",
      "url": "https://www.imdb.com/name/nm0001465/"
    },
    {
      "name": "Sebastian Gutierrez",
      "url": "https://www.imdb.com/name/nm0349406/"
    }
  ]
}