{
  "type": "Movie",
  "name": "The Day After Tomorrow",
  "url": "https://www.imdb.com/tt0319262/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNWNkNzljZjktY2MwNi00OWExLTliNTMtOTk0NGU2ZDQ3ZTEyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
  "description": "Jack Hall, paleoclimatologist, must make a daring trek from Washington, D.C. to New York City to reach his son, trapped in the cross-hairs of a sudden international storm which plunges the planet into a new Ice Age.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2009-11-29",
    "inLanguage": "English",
    "heading": "Spectacular special effects, uneven film",
    "reviewBody": "The Day After Tomorrow is not a bad movie by all means. In fact, it&apos;s an uneven but decent film. The film does start off absolutely brilliantly, with a wonderful idea for a story and truly spectacular special effects. As a matter of fact, the whole film is well worth watching for the special effects alone. The acting is not too bad; Jake Gyllanhaal is rather bland, but Dennis Quaid is a superb lead. Plus Emmy Rosum looks positively radiant and Ian Holm is as reliable as ever. The direction from Roland Emmerich was surprisingly good, there have been times when I have found his direction too murky and unfocused, but no it was above decent here.\n\nHowever, the second half isn&apos;t as impressive. Whereas the first half is very like a typical disaster movie, the second half for me as it focused on the rescue mission felt more of a thriller. The screenplay in general could have done with more precision and focus too, there is good interplay sometimes but on the whole I found the screenplay and some of the characters underdeveloped. My main problem though with The Day After Tomorrow was the pace, for my liking it was too leisurely and too stodgy.\n\nAll in all, uneven it is but it is a decent disaster movie. The first half I can watch again and again, but the second half for me was a bit of a letdown. 7/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 472976,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2004-05-27",
  "keywords": "global warming,end of the world,climate crisis,disaster film,climate",
  "duration": "PT2H4M",
  "actor": [
    {
      "name": "Dennis Quaid",
      "url": "https://www.imdb.com/name/nm0000598/"
    },
    {
      "name": "Jake Gyllenhaal",
      "url": "https://www.imdb.com/name/nm0350453/"
    },
    {
      "name": "Emmy Rossum",
      "url": "https://www.imdb.com/name/nm0002536/"
    }
  ],
  "director": [
    {
      "name": "Roland Emmerich",
      "url": "https://www.imdb.com/name/nm0000386/"
    }
  ],
  "creator": [
    {
      "name": "Roland Emmerich",
      "url": "https://www.imdb.com/name/nm0000386/"
    },
    {
      "name": "Jeffrey Nachmanoff",
      "url": "https://www.imdb.com/name/nm0618680/"
    }
  ]
}