{
  "type": "Movie",
  "name": "White Chicks",
  "url": "https://www.imdb.com/tt0381707/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTY3OTg2OTM3OV5BMl5BanBnXkFtZTYwNzY5OTA3._V1_.jpg",
  "description": "Two disgraced FBI agents go way undercover in an effort to protect hotel heiresses the Wilson sisters from a kidnapping plot.",
  "review": {
    "author": "Sweetestsixteen",
    "dateCreated": "2006-04-09",
    "inLanguage": "English",
    "heading": "Not about colour.",
    "reviewBody": "Let me just say firstly the title of the movie was wrong. It obviously made people assume that the film was about the differences between black and white people. I would say about less than ten of the jokes, out of the film containing tens upon tens of funny lines, was about the racial differences.\n\nIt was about men learning about what women go through in life. They get to experience different people that women encounter, such as strong overpowering men, rude devious women, fashion, shopping, waxes (ouch!), etc.\n\nBut instead of making you feel like you&apos;re being lectured, they make you laugh and learn instead.\n\nThe Wayans are not making fun of white people, they&apos;re mocking people such as the Hiltons; the false life that people like them can lead; how money can hide people from reality and can lead to corruption.\n\nOn the DVD, you can see for yourself what the white actresses have to say. That they enjoyed themselves, and love the concept. Who would join a cast who were making fun of your race? If the Wayans disliked white people so much, they would&apos;ve gotten black actors/actresses and put them under make-up, instead of hiring white actors/actresses in the first place. Even the director states that this film is about the differences between men and women.\n\nPlease give this film the same chance that you would give any other.\n\nP.S. Was Mrs. Doubtfire making fun of old people?",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 161285,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Crime"
  ],
  "datePublished": "2004-10-15",
  "keywords": "whiteface,undercover,dress shop,dancing,gender disguise",
  "duration": "PT1H49M",
  "actor": [
    {
      "name": "Marlon Wayans",
      "url": "https://www.imdb.com/name/nm0005541/"
    },
    {
      "name": "Shawn Wayans",
      "url": "https://www.imdb.com/name/nm0915465/"
    },
    {
      "name": "Busy Philipps",
      "url": "https://www.imdb.com/name/nm0005311/"
    }
  ],
  "director": [
    {
      "name": "Keenen Ivory Wayans",
      "url": "https://www.imdb.com/name/nm0005540/"
    }
  ],
  "creator": [
    {
      "name": "Keenen Ivory Wayans",
      "url": "https://www.imdb.com/name/nm0005540/"
    },
    {
      "name": "Shawn Wayans",
      "url": "https://www.imdb.com/name/nm0915465/"
    },
    {
      "name": "Marlon Wayans",
      "url": "https://www.imdb.com/name/nm0005541/"
    }
  ]
}