{
  "type": "Movie",
  "name": "Annabelle Comes Home",
  "url": "https://www.imdb.com/tt8350360/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYmI4NDNiMmQtZTFkYi00ZDVmLThlYTAtMWJlMjU1M2I2ZmViXkEyXkFqcGdeQXVyNjg2NjQwMDQ@._V1_.jpg",
  "description": null,
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2019-07-17",
    "inLanguage": "English",
    "heading": "Return to the Conjuring universe",
    "reviewBody": "Although horror is not my favourite film genre, and have made that known more than once before in the past, there is still high appreciation for it. Although there are a fair share of average at best films or even clunkers (even when trying to take them for what they are or intend to be), there are also an equal fair share of good horror films as well as classics, which won&apos;t be named in order to be fair.\n\nReally enjoyed the two &apos;The Conjuring&apos; films for the same reasons to each other, that they were well-made, well-crafted, suspenseful, entertaining and had genuine shocks. &apos;Annabelle&apos; is inevitably compared to them, but to me it doesn&apos;t compare favourably and could have been much better. Its prequel &apos;Annabelle: Creation&apos;, although far from perfect or great with some of the same mistakes being made, again to me fared better, though again not close to the quality of &apos;The Conjuring&apos; films. &apos;The Nun&apos; meanwhile was a mediocre disappointment. Put &apos;Annabelle Comes Home&apos; in the middle and personally found it a difficult film to rate and review, though it will be easier for others.\n\n&apos;Annabelle Comes Home&apos; looks good. There is a great Gothic atmosphere, lush and darkly atmospheric production design and stylish photography. The supernatural effects are surprisingly excellent too. The music is haunting and the direction brings a genuine eeriness and mysteriousness in places. There are parts that are suitably uneasy and eerie once &apos;Annabelle Comes Home&apos; gets going.\n\nThe pace, again once the film gets into gear, it has been said that the mute vision in the television is the scariest part and do have to agree with this. Patrick Wilson and Vera Farmiga do good jobs, though take a backseat to the younger cast. Was worried that this would not work, but the younger cast carry the film quite well and don&apos;t bore and annoy as feared.\n\nHowever, the story is near-non existent with few surprises and can get very silly. Especially towards the end. Although there are moments of scares and suspense, there are not enough of either and could have done with more build up that would have made them less predictable.\n\nDid feel that the pacing was still very flawed. &apos;Annabelle Comes Home&apos; takes too long to get going and then the climactic parts feel very rushed. The ending is one of the film&apos;s biggest issues, as well as being rushed it was very anti-climactic and bordered on plain ridiculous, as well as illogical. The dialogue is no improvement too, very awkward-sounding and banal, doing little with developing rather clichéd characters.\n\nSummarising, difficult to rate and review. Watchable but never rises above borderline between average and decent. 5/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 85491,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "15",
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2019-07-10",
  "keywords": "possessed doll,creepy doll,jump scare,teenage girl,babysitter",
  "duration": "PT1H46M",
  "actor": [
    {
      "name": "Vera Farmiga",
      "url": "https://www.imdb.com/name/nm0267812/"
    },
    {
      "name": "Patrick Wilson",
      "url": "https://www.imdb.com/name/nm0933940/"
    },
    {
      "name": "Mckenna Grace",
      "url": "https://www.imdb.com/name/nm5085683/"
    }
  ],
  "director": [
    {
      "name": "Gary Dauberman",
      "url": "https://www.imdb.com/name/nm2477891/"
    }
  ],
  "creator": [
    {
      "name": "Gary Dauberman",
      "url": "https://www.imdb.com/name/nm2477891/"
    },
    {
      "name": "James Wan",
      "url": "https://www.imdb.com/name/nm1490123/"
    }
  ]
}