{
  "type": "Movie",
  "name": "The Current War",
  "url": "https://www.imdb.com/tt2140507/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYWIxOWU4OGUtMTY1Ny00YmY3LWFhOTgtNzk3NmExYjUwMTFmXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
  "description": "The dramatic story of the cutthroat race between electricity titans Thomas A. Edison and George Westinghouse to determine whose electrical system would power the modern world.",
  "review": {
    "author": "eddie_baggins",
    "dateCreated": "2020-06-25",
    "inLanguage": "English",
    "heading": "A much better film that many critics labelled it to be",
    "reviewBody": "An upcoming director whose previous film was the indie darling Me and Earl and the Dying Girl, producing work by Russian film heavyweight Timur Bekmambetov and Hollywood legend Martin Scorsese, a cast of some of the most respected talent working today and a true story at its disposal that is loaded with ripe potential, The Current War should have been a contender.\n\nFinished way back in 2017 and scheduled to play out in the awards season period, this one time Harvey Weinstein backed project became an unfortunate victim to the downfall of the big-time producer, given a lifeline years later in what became a low-key cinematic release, anchored down by mediocre reviews that lamented director Alfonso Gomez-Rejon emotion free affair.\n\nTo my surprise, The Current War is far from the failure as a product many would have had viewers believe, it surely jams too much content into a brief 100 minute run-time, with Nicholas Hoult&apos;s Nicola Tesla given a particular short straw in regards to screen-time and development, but Rejon&apos;s energetic direction and constantly moving narrative is never dull and a fine reminder to us all that the technology we take for granted today was at one-time in history a magical invention.\n\nA story that would&apos;ve been perfectly suited to a mini-series treatment, The Current War examines the life and times of esteemed inventors Tesla, Benedict Cumberbatch&apos;s Thomas Edison and Michael Shannon&apos;s wealthy businessman George Westinghouse, who all found themselves in the late 1800&apos;s competing against one another as humankind discovered the power of electricity, both good and bad.\n\nThrowing us headfirst into the race to light up America and the world, Rejon wastes little time as we find Edison showcasing his significant discovery to an unsuspecting population, with Cumberbatch&apos;s finely attuned portrayal of the well-known historical figure one of the highlights of the film and from there we are in the whirlwind of activity as these various men push forward with their ideas and pursuits, often no matter the cost that may be associated with that.\n\nThere&apos;s some fascinating aspects of this time and movement explored in the film, Edison&apos;s reluctance to develop something that may take human lives and Tesla&apos;s battles to be taken seriously such elements but nothing is given too much room to breathe by Rejon as he constantly pushes us forward, a reason no doubt why many critics were left unimpressed with a film that stylistically and aesthetically is above average but fails to ignite the heart.\n\nWhen it comes to the big screen treatment of this subject, The Current War remains one of the more memorable offerings, one that could&apos;ve been something special but still not the dull mess many would&apos;ve had us believe it to be.\n\nFinal Say -\n\nA solid drama about a fascinating series of subject matters and historical events, The Current War is far from the failure it appeared to be, even if it is unable to become something downright special.\n\n3 1/2 globes out of 5",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 30400,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "12A",
  "genre": [
    "Biography",
    "Drama",
    "History"
  ],
  "datePublished": "2019-07-26",
  "keywords": "world&apos;s fair,1893 columbian exposition,based on true story,lens flare,chicago illinois",
  "duration": "PT1H48M",
  "actor": [
    {
      "name": "Benedict Cumberbatch",
      "url": "https://www.imdb.com/name/nm1212722/"
    },
    {
      "name": "Oliver Powell",
      "url": "https://www.imdb.com/name/nm2692160/"
    },
    {
      "name": "Sophia Ally",
      "url": "https://www.imdb.com/name/nm8766247/"
    }
  ],
  "director": [
    {
      "name": "Alfonso Gomez-Rejon",
      "url": "https://www.imdb.com/name/nm0004234/"
    }
  ],
  "creator": [
    {
      "name": "Michael Mitnick",
      "url": "https://www.imdb.com/name/nm2276729/"
    }
  ]
}