{
  "type": "Movie",
  "name": "Peter Rabbit 2: The Runaway",
  "url": "https://www.imdb.com/tt8376234/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYmM5ZTU3NDYtZmZiMy00ZjlkLTliYzctNDlkYTEwNWYzNWUyXkEyXkFqcGdeQXVyMTI1Mzg0ODA5._V1_.jpg",
  "description": "Thomas and Bea are now married and living with Peter and his rabbit family. Bored of life in the garden, Peter goes to the big city, where he meets shady characters and ends up creating chaos for the whole family.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2022-06-01",
    "inLanguage": "English",
    "heading": "Charmless runaway",
    "reviewBody": "Am one of those people who really enjoyed the first &apos;Peter Rabbit&apos;. A masterpiece it was not, but it was so much better than expected and was entertaining. While sequels don&apos;t always have a good reputation, there are some great ones out there and even masterpieces that are as good as their originals (&apos;Godfather Part II&apos;, &apos;Aliens&apos;, &apos;Terminator 2&apos;, &apos;Empire Strikes Back&apos;). Did though question the need for &apos;Peter Rabbit&apos; getting a sequel when the first could easily have been a one off.\n\n&apos;Peter Rabbit 2&apos; disappointed. It is not a terrible film and has its moments and good things, but its mixed critical reception is more than understandable, and agreed with sadly, and my feelings are pretty mixed. The first is definitely better, while this didn&apos;t feel needed and lacked what made the first so enjoyable (despite having the same cast back). As far as 2021 films go, &apos;Peter Rabbit 2&apos; is not one of the worst, but among the best it is a long way from.\n\nThe good things are going to be listed first. It looks fine, with the photography and locations being lovely. Even better is the work on the animals, they look wonderful and gel seamlessly with the locations and what goes on around them. While the placement of the soundtrack was not great, the song selection was pretty good, characterful and diverse and the score fitted at least.\n\nDomhnall Gleeson and Rose Byrne do their best bringing charm into their underwritten roles. Most of the voice cast are very good, with the standout being Lennie James as one of the film&apos;s most interesting characters (being one of the few to get a backstory and clear motivations). There are some amusing lines, Peter&apos;s sisters have a lot of personality as do all the animal characters. One of the better moments was also the self-aware moment of Peter acknowledging that his voice is annoying.\n\nOn the other hand, the flaws are many. Peter himself is very difficult to root for, a big problem considering that in this story you are supposed to do so, due to the film going too far on showing his flaws and not enough of his good intentions. James Corden this time is irritating, he was fine before but comes over as cocky and obnoxious this time. The story this time felt messy and felt like two stories in one. The book deal subplot is very thin and over-stretched. Fine actor David Oyelowo deserved better than the stock obvious role he was given and he comes over as very one dimensional. Amazing how it took so long for the other characters to see through him.\n\nMeanwhile, the main plot with Peter is very over-stuffed, too busy and too over-reliant on confused slapstick, the truth about one character&apos;s intentions being not a shock for a second and repetitive humour, especially with the rooster and petshop. Personally did find myself confused with what the film was trying to be and who it was being aimed at, so target audience was a big problem. With some of it being juvenile for adults and too complicated for younger audiences. For a family film there is not an awful lot to enjoy for younger viewers and older ones will only find it mildly amusing.\n\nWhile finding the soundtrack choices nice, the placement was often questionable. With it not being harmonious with the action sometimes and being too loud. Charm is too little and the attempts at emotional drama come over as too sentimental. The ending is too rushed and convenient and the pacing is all over the shop, draggy in the subplot and too hectic in the main one.\n\nSumming up, underwhelming but not bad despite how all that sounded. 5/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 14184,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2021-05-17",
  "keywords": "sequel,rabbit,triplets,train,pig",
  "duration": "PT1H33M",
  "actor": [
    {
      "name": "Rose Byrne",
      "url": "https://www.imdb.com/name/nm0126284/"
    },
    {
      "name": "Domhnall Gleeson",
      "url": "https://www.imdb.com/name/nm1727304/"
    },
    {
      "name": "David Oyelowo",
      "url": "https://www.imdb.com/name/nm0654648/"
    }
  ],
  "director": [
    {
      "name": "Will Gluck",
      "url": "https://www.imdb.com/name/nm0323239/"
    }
  ],
  "creator": [
    {
      "name": "Will Gluck",
      "url": "https://www.imdb.com/name/nm0323239/"
    },
    {
      "name": "Patrick Burleigh",
      "url": "https://www.imdb.com/name/nm1522597/"
    },
    {
      "name": "Beatrix Potter",
      "url": "https://www.imdb.com/name/nm0693229/"
    }
  ]
}