{
  "type": "Movie",
  "name": "Spider-Man: No Way Home",
  "url": "https://www.imdb.com/tt10872600/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZWMyYzFjYTYtNTRjYi00OGExLWE2YzgtOGRmYjAxZTU3NzBiXkEyXkFqcGdeQXVyMzQ0MzA0NTM@._V1_.jpg",
  "description": "With Spider-Man&apos;s identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to discover what it truly means to be Spider-Man.",
  "review": {
    "author": "masonsaul",
    "dateCreated": "2021-12-15",
    "inLanguage": "English",
    "heading": "Phenomenal conclusion",
    "reviewBody": "Spider-Man: No Way Home is a phenomenal conclusion to the trilogy and Holland&apos;s best outing as Spidey yet. Starts off fun, safe and familiar and then becomes extremely emotional, satisfying and full of great callbacks. A love letter to all things Spider-Man.\n\nTom Holland gives an incredible lead performance once again, reliably charming and likeable but with a lot more emotional heft this time around. Zendaya and Jacob Batalon both have perfect chemistry with Holland and are also incredible in their own ways.\n\nBenedict Cumberbatch reaffirms why he&apos;s such a good Doctor Strange with his excellent dry wit and gravitas. All the returning villains give strong performances but Willem Dafoe is definitely the standout performance with an unsettling and terrifying presence.\n\nJon Watts&apos; direction is superb, the action sequences are thrillingly acrobatic once again but refreshingly impactful this time around. There&apos;s a few homages to the styles of the previous iterations and some gorgeous imagery.\n\nIt&apos;s also perfectly paced with none of its roughly 2hr 30 minute runtime feeling dull or overly long due to a strong momentum established early on. The CG is extremely impressive with only a few weak spots.\n\nThe music by Michael Giacchino is fantastic, a nice balance of themes from the previous iterations and use of Holland&apos;s iconic motifs which are slightly altered in ways that work as well as a few new additions that are beautifully epic.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 855031,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 8.2
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "datePublished": "2021-12-15",
  "keywords": "spider man character,superhero,marvel cinematic universe,multiverse,green goblin character",
  "duration": "PT2H28M",
  "actor": [
    {
      "name": "Tom Holland",
      "url": "https://www.imdb.com/name/nm4043618/"
    },
    {
      "name": "Zendaya",
      "url": "https://www.imdb.com/name/nm3918035/"
    },
    {
      "name": "Benedict Cumberbatch",
      "url": "https://www.imdb.com/name/nm1212722/"
    }
  ],
  "director": [
    {
      "name": "Jon Watts",
      "url": "https://www.imdb.com/name/nm1218281/"
    }
  ],
  "creator": [
    {
      "name": "Chris McKenna",
      "url": "https://www.imdb.com/name/nm0571344/"
    },
    {
      "name": "Erik Sommers",
      "url": "https://www.imdb.com/name/nm1273099/"
    },
    {
      "name": "Stan Lee",
      "url": "https://www.imdb.com/name/nm0498278/"
    }
  ]
}