{
  "type": "Movie",
  "name": "The Sparks Brothers",
  "url": "https://www.imdb.com/tt8610436/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNTA0YTE5M2MtZTc0Ny00ODViLWI2ZjItOTU3YzJmNzdhYjI3XkEyXkFqcGdeQXVyNTI4MzE4MDU@._V1_.jpg",
  "description": "A musical odyssey through five weird and wonderful decades with Ron and Russell Mael celebrating the inspiring legacy of Sparks.",
  "review": {
    "author": "Pjtaylor-96-138044",
    "dateCreated": "2022-02-16",
    "inLanguage": "English",
    "heading": "Almost too comprehensive for its own good.",
    "reviewBody": "&apos;The Sparks Brothers (2021)&apos; is a behemoth of a documentary that charts the entire, six-decades-spanning career of &apos;Sparks&apos;, an intermittently successful and always experimental band who&apos;ve reinvented themselves more times than you could possibly imagine. Prior to hearing of this film, I&apos;d never heard of the Mael brothers or their band; the only reason I (and I highly doubt I&apos;m the only one) elected to watch the piece is because of its director, Edgar Wright. This directly relates to both the strength and weakness of the piece: its adamant desire to explore every single &apos;Sparks&apos; album ever released. With a runtime just shy of two-and-a-half hours and a structure that basically repeats itself twenty-five times, it certainly isn&apos;t the most audience friendly of affairs. This would imply that its target audience is almost exclusively people already familiar with and fond of the band&apos;s work, but this actually isn&apos;t the case - at least, not as obviously as it may seem. See, the documentary doesn&apos;t really go into any depth when it comes to its eponymous brothers, their musical process or how they perceive the events the movie depicts. Instead, it essentially focuses on the reception of their music, conveyed primarily via an impressively eclectic array of talking heads who wax lyrical about the under-appreciated brilliance of &apos;Sparks&apos;. Therefore, fans of the band will likely already be familiar with most of the stuff that the movie covers. At the same time, newbies like myself are likely to feel slightly overwhelmed at the amount of surface-level information that the flick throws at its viewers. After a certain point, it all starts to blend into itself and wash over you to an extent. Despite this issue, the movie is still quite a bit of fun. Sure, it starts to run out of steam at points, but it often shakes things up just enough to feel fresh - much like the Mael brothers themselves. Though its presentation is mostly rather standard (albeit impressive), it does have a cheeky sensibility to it and imbues many of its more expected elements with some subtle yet successful humour. The enthusiasm of everyone on screen is also evident and infectious. Sadly, I can&apos;t say that I recall more than a couple of &apos;Sparks&apos; songs now and they play for pretty much the entire affair. This is likely a testament to the eclectic nature of their discography, which is consistently inconsistent in terms of style and tone. Still, the music is enjoyable, despite not being all that memorable. Ultimately, this documentary is slightly too long and almost too comprehensive for its own good, yet it has quite a bit of charm to it and remains entertaining pretty much for its entire duration. It&apos;s a solid effort. 7/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 5942,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.8
  },
  "contentRating": "15",
  "genre": [
    "Documentary",
    "Biography",
    "Comedy"
  ],
  "datePublished": "2021-07-30",
  "keywords": "american in london,american in great britain,american in england,pop band,reference to jacques tati",
  "duration": "PT2H20M",
  "actor": [
    {
      "name": "Ron Mael",
      "url": "https://www.imdb.com/name/nm0535391/"
    },
    {
      "name": "Russell Mael",
      "url": "https://www.imdb.com/name/nm0535392/"
    },
    {
      "name": "Beck",
      "url": "https://www.imdb.com/name/nm0065059/"
    }
  ],
  "director": [
    {
      "name": "Edgar Wright",
      "url": "https://www.imdb.com/name/nm0942367/"
    }
  ],
  "creator": []
}