{
  "type": "Movie",
  "name": "Wrong Turn",
  "url": "https://www.imdb.com/tt0295700/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzc4MDhiMWUtNTY5Ny00NWY3LTk0ZmItM2NlYmRmOWQzNGVmXkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
  "description": "Chris and a group of five friends are left stranded deep in the middle of the woods after their cars collide. As they venture deeper into the woods, they face an uncertain and bloodcurdling fate.",
  "review": {
    "author": "BigHardcoreRed",
    "dateCreated": "2005-03-15",
    "inLanguage": "English",
    "heading": "Eliza Dushku, Emmanuelle Chriqui & Lindy Booth I&apos;d Have No Problem Being Stranded With.",
    "reviewBody": "Wrong Turn is about a group of 6 people (in two different cars) make a wrong turn (hence, the movie title) in the back woods of West Virginia. One car runs over some barbed wire which leaves them stranded in the middle of the road, when another car crashes into it due to not paying attention. They are in the middle of a forest where cell phones get no reception and not a gas station or any other convenience for miles and miles. Most of the group decide to walk back the way they came in hopes of finding help while a couple stay behind with the vehicles. This is where the mountain men begin their murder spree. They obviously began well before the movie started but for these 6 people, this is where it starts. It is also probably the most graphic and creepy part of the movie.\n\nThe special effects on the mountain men were great. They remind me of someone but I can not put my finger on it. They were creepy enough in the way they walked and grunted that they were not too much of a joke. I would probably run from these people if I was alone in the woods. Much better than the Boogeyman from Boogeyman, anyways. Some characteristics remind me of the main monster in Monster Man, though.\n\nI thought the cast for this movie was great. I have always been a big fan of Eliza Dushku and the other two girls, Emmanuelle Chriqui and Lindy Booth, were no slouches themselves. In fact, if there were 3 girls to be stranded somewhere with, I would have no problem if it were these 3. You could certainly do a lot worse.\n\nThe only guy in the movie that annoyed me was thankfully knocked off first. It was like they were reading my mind. Jeremy Sisto and Desmond Harrington were pretty likable and did a good job overall. The acting in this movie was pretty good, especially considering it was a horror movie.\n\nThe movie borrowed a little bit from a lot of different movies, most notably Deliverance, which one of the characters even mentions by name, but in todays day and age, when we have seen it all, it was a pretty good effort. 8/10",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 129512,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "18",
  "genre": [
    "Horror",
    "Thriller"
  ],
  "datePublished": "2003-06-27",
  "keywords": "west virginia,wrong turn,bound and gagged,flat tire,hillbilly",
  "duration": "PT1H24M",
  "actor": [
    {
      "name": "Eliza Dushku",
      "url": "https://www.imdb.com/name/nm0244630/"
    },
    {
      "name": "Jeremy Sisto",
      "url": "https://www.imdb.com/name/nm0005438/"
    },
    {
      "name": "Emmanuelle Chriqui",
      "url": "https://www.imdb.com/name/nm0004825/"
    }
  ],
  "director": [
    {
      "name": "Rob Schmidt",
      "url": "https://www.imdb.com/name/nm0003343/"
    }
  ],
  "creator": [
    {
      "name": "Alan B. McElroy",
      "url": "https://www.imdb.com/name/nm0568416/"
    }
  ]
}