{
  "type": "Movie",
  "name": "A Quiet Place",
  "url": "https://www.imdb.com/tt6644200/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI0MDMzNTQ0M15BMl5BanBnXkFtZTgwMTM5NzM3NDM@._V1_.jpg",
  "description": "A family struggles for survival in a world where most humans have been killed by blind but noise-sensitive creatures. They are forced to communicate in sign language to keep the creatures at bay.",
  "review": {
    "author": "Sunayana_Kumar",
    "dateCreated": "2021-06-21",
    "inLanguage": "English",
    "heading": "A simple yet thrilling adventure film",
    "reviewBody": "The unique plot combined with the great acting skills of John Krasinski and Emily Blunt that creates a mysterious atmosphere and keeps you on the edge of your seat.\n\nActor, co-writer and director John Krasinski seems to understand this thoroughly, and the result is an unnerving film. The premise is intriguing - in the near future, humans are viciously hunted down by mysterious creatures equipped with a heightened sense of sound. Their only known weakness is that they are blind.\n\nKrasinski uses this to create a dreadful sense of atmosphere throughout the film. The rules that exist in this universe are established early on with minimal exposition. After all, the characters can&apos;t communicate with each other openly. Additionally, since very little is known about these creatures, this film smartly implements one of the fundamental rules of the genre - the fear of the unknown. This setup pushes the family to invent creative ways to survive. The cast is minimal - besides Krasinski, Emily Blunt plays his wife, and their real-life chemistry translates brilliantly. Noah Jupe and Millicent Simmonds play two of their children. Being a deaf actress, Millicent is the perfect choice to star in this mostly silent film, and her authentic performance stands out along with Blunt who showcases her impressive acting range. Horror, in particular, only works if you&apos;re invested in the characters, and this cast absorbs you into their terrifying world.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 571966,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.5
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Horror",
    "Sci-Fi"
  ],
  "datePublished": "2018-04-05",
  "keywords": "survival,sign language,deafness,silence,post apocalypse",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Emily Blunt",
      "url": "https://www.imdb.com/name/nm1289434/"
    },
    {
      "name": "John Krasinski",
      "url": "https://www.imdb.com/name/nm1024677/"
    },
    {
      "name": "Millicent Simmonds",
      "url": "https://www.imdb.com/name/nm8075925/"
    }
  ],
  "director": [
    {
      "name": "John Krasinski",
      "url": "https://www.imdb.com/name/nm1024677/"
    }
  ],
  "creator": [
    {
      "name": "Bryan Woods",
      "url": "https://www.imdb.com/name/nm1456816/"
    },
    {
      "name": "Scott Beck",
      "url": "https://www.imdb.com/name/nm1399714/"
    },
    {
      "name": "John Krasinski",
      "url": "https://www.imdb.com/name/nm1024677/"
    }
  ]
}