{
  "type": "Movie",
  "name": "After Everything",
  "url": "https://www.imdb.com/tt15334488/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOWVmNDdhMTktZDA3Zi00YmFiLWI3YzItMDQ5ZmNjZGRhNWU0XkEyXkFqcGdeQXVyMTY3ODkyNDkz._V1_.jpg",
  "description": "After breaking up with his true love, best-selling author Hardin Scott travels to Portugal in an attempt to make amends for his past behavior.",
  "review": {
    "author": "topsi91",
    "dateCreated": "2023-09-15",
    "inLanguage": "English",
    "heading": "Really stupid last film, Tessa is missing for most of it",
    "reviewBody": "So, basically for 1h,25 min out of 1h30 min, they are showing only what Hardin is doing, the struggles of one narcissist when he can&apos;t get enough supply haha They were trying to make it seem like he is struggling cos he loves Tessa so much but it was no convincing to me. Tessa told him she moved on, but as soon as she saw him, she is head over heels obsessed with him on the same second. Tessa on the other hand shows only at the end of the film, literally the last few min, just so they can add some suggestive not even very good s*x scene in there. And guess what - they will get married, but they don&apos;t show any of it, they just skip through time and show them years later when they have kids? Makes no sense.. so the whole film was so slow paced (as in the whole 5 films) and suddenly they skip through the most important part of their life story - the marriage, the emotions, the pregnancies.. they show nothing. So if you want to watch Hardin being a drunkard and having s*x with other women for hour and a half, be my guest, but if you expect to see their development as a couple, this won&apos;t happen. Such a lame film, seriously. And I don&apos;t get how they include Tessa only at the end of this film, so the whole film was about literally nothing. I think this one must be the worst of them all and the ending is just so rushed and not satisfying. It&apos;s just really, really bad and I do no recommend. Not to mention it gives a bad example of toxic relationships and makes women believe that the bad guy will turn good all of a sudden, just cos she is the one, she is the chosen hahah no unrealistic. Everyone who has been in a relationship with a narcissist know they never change and marrying the guy or giving birth to his kids won&apos;t change him. I hate this film so much actually.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 1
    }
  },
  "rating": {
    "ratingCount": 5109,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.6
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2023-10-06",
  "keywords": "sex in airplane bathroom,sex tape,past",
  "duration": "PT1H33M",
  "actor": [
    {
      "name": "Hero Fiennes Tiffin",
      "url": "https://www.imdb.com/name/nm2842005/"
    },
    {
      "name": "Josephine Langford",
      "url": "https://www.imdb.com/name/nm6466214/"
    },
    {
      "name": "Mimi Keene",
      "url": "https://www.imdb.com/name/nm5488579/"
    }
  ],
  "director": [
    {
      "name": "Castille Landon",
      "url": "https://www.imdb.com/name/nm2500541/"
    }
  ],
  "creator": [
    {
      "name": "Castille Landon",
      "url": "https://www.imdb.com/name/nm2500541/"
    },
    {
      "name": "Anna Todd",
      "url": "https://www.imdb.com/name/nm6849771/"
    }
  ]
}