{
  "type": "Movie",
  "name": "Armed and Dangerous",
  "url": "https://www.imdb.com/tt0090660/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZTlhNmI0OTYtZTNkMC00Y2UwLThjN2UtNWNlNWFkNGMwZGNiL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "A fired cop and useless lawyer sign up as security guards and find they&apos;ve joined a corrupt union.",
  "review": {
    "author": "videorama-759-859391",
    "dateCreated": "2014-05-27",
    "inLanguage": "English",
    "heading": "Armed and dangerously funny",
    "reviewBody": "I&apos;ve got to love Mark Lester. There&apos;s no movie of here&apos;s I hate. Here, away from the norm of usual of action dramas, etc, out pops a comedy with some dramatic moments. Here, he succeeds again. AAD is funny, let me tell ya. Candy who&apos;s set up by bad guy cops, in a t.v heist, teams up with American Pie&apos;s Levy (one of the worst lawyers you&apos;ll ever meet) who&apos;s forced to resign. Their new careers have em&apos; working as security guards for an Armaguard company, but soon smell something besides mounds of garbage (check out that scene) where corrupt union figures, and some other bad guys are robbing genuine employers off their doe. Candy and Levy make a great team and get up to some real shenanigans, while also getting to the core of this operation. Steve Railsback, is unforgettable as a wild out there oil tanker driver, the most accepting, when his rig goes up in flames. Too, this is the first flick I saw Ms Ryan in, who plays the daughter of the cranky boss running the business, forced into working with the bad guys. This film also has a lot to offer like shark catching, and is a teaching tool to cops who climb trees to rescue cats from them, although how Candy got up there is a big visual fault upon the director, while not showing him clinging onto any others on the start up. Too, what the hell&apos;s wrong with always angry Tiny Lister Junior, as the big pointy bald guy/security honcho Bruno. See him in 8 Million Ways To Die and work that out too. Although running for only a week in Adelaide cinemas, here&apos;s one comedy flick I really liked and still do up until this day. Judy &apos;Boobs&apos; Landers as one of Candy&apos;s girls is another comedy asset. One of the better comedies of this ilk.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 12573,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "datePublished": "1986-09-12",
  "keywords": "security guard,car crash,corrupt cop,man disguised as a woman,exploding truck",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "John Candy",
      "url": "https://www.imdb.com/name/nm0001006/"
    },
    {
      "name": "Meg Ryan",
      "url": "https://www.imdb.com/name/nm0000212/"
    },
    {
      "name": "Eugene Levy",
      "url": "https://www.imdb.com/name/nm0506405/"
    }
  ],
  "director": [
    {
      "name": "Mark L. Lester",
      "url": "https://www.imdb.com/name/nm0504495/"
    }
  ],
  "creator": [
    {
      "name": "Brian Grazer",
      "url": "https://www.imdb.com/name/nm0004976/"
    },
    {
      "name": "Harold Ramis",
      "url": "https://www.imdb.com/name/nm0000601/"
    },
    {
      "name": "James Keach",
      "url": "https://www.imdb.com/name/nm0005077/"
    }
  ]
}