{
  "type": "Movie",
  "name": "Destroyer",
  "url": "https://www.imdb.com/tt7137380/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI3MDQ0NTk5NV5BMl5BanBnXkFtZTgwMTUwNzc4NjM@._V1_.jpg",
  "description": "A police detective reconnects with people from an undercover assignment in her distant past in order to make peace.",
  "review": {
    "author": "JohnDeSando",
    "dateCreated": "2019-01-03",
    "inLanguage": "English",
    "heading": "A stock thriller with a fierce Kidamn.",
    "reviewBody": "My grade of B- is all for the A-list Nicole Kidman showing us she can act like Charlize Theron in Monster. Destroyer is her film, and she does her best to show us she can be badass L.A. PD detective Erin Bell with years on her face and chips on her shoulder. It&apos;s just that the vehicle for this iconic actress is a middling thriller with a jumbled plot about her being an undercover cop, a heist gone wrong, and her annoyingly disaffected daughter, Shelby (Jade Pettyjohn), for whom Erin suffers much.\n\nKidman is made up to look like a beaten woman, but we do get a few too many flashbacks to show us how beautiful she was as a young brunette cop with a future. Director Karyn Kusama keeps the camera close on Kidman, as if she were begging us not to forget that underneath some neat makeup beats the heart and face of a super movie star.\n\nBeyond Kidman&apos;s overpowering presence, some solid performances emerge, for instance Sebastian Stan as Chris, her loving partner; and Beau Knapp, as the boyfriend Jay no one would want for your daughter. Myriad other minor characters reflect the complex world of LA, real and romantic. It&apos;s the best city I know for attractive crime and fetching diversity.\n\nPerhaps the awareness of glamorous Kidman as a squinting Dirty Harry is what steers the film and her performance to mediocrity. This observation may condemn Kidman to playing courtesans and rich mothers, but the reality is that she has over the years crafted an enviable persona relying partly on her unusually good looks. Perhaps this rough detective will allow us to forget that image as she plays in more gritty roles that display, without distraction, a world-class actress.\n\nIf you are a Kidman fan (I became one after Moulin Rouge), see Destroyer, which just may pleasantly erase your picture of perfection.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 31391,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Crime",
    "Drama"
  ],
  "datePublished": "2019-01-25",
  "keywords": "undercover cop,revenge,female police detective,haunted by the past,sociopath",
  "duration": "PT2H1M",
  "actor": [
    {
      "name": "Nicole Kidman",
      "url": "https://www.imdb.com/name/nm0000173/"
    },
    {
      "name": "Toby Kebbell",
      "url": "https://www.imdb.com/name/nm1527905/"
    },
    {
      "name": "Tatiana Maslany",
      "url": "https://www.imdb.com/name/nm1137209/"
    }
  ],
  "director": [
    {
      "name": "Karyn Kusama",
      "url": "https://www.imdb.com/name/nm0476201/"
    }
  ],
  "creator": [
    {
      "name": "Phil Hay",
      "url": "https://www.imdb.com/name/nm0006534/"
    },
    {
      "name": "Matt Manfredi",
      "url": "https://www.imdb.com/name/nm0542062/"
    }
  ]
}