{
  "type": "Movie",
  "name": "Halloween",
  "url": "https://www.imdb.com/tt0077651/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzk1OGU2NmMtNTdhZC00NjdlLWE5YTMtZTQ0MGExZTQzOGQyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "Fifteen years after murdering his sister on Halloween night 1963, Michael Myers escapes from a mental hospital and returns to the small town of Haddonfield, Illinois to kill again.",
  "review": {
    "author": "Steve-280",
    "dateCreated": "1998-12-30",
    "inLanguage": "English",
    "heading": "Sure scared me back in 78",
    "reviewBody": "I was 20 back in 1978, and saw this on opening weekend. I knew nothing of it, and after growing up on the old Hammer films, followed by a period of almost nothing, this was quite a nice surprise. It really worked! Had me checking the back seat in cars, gave me a sinking feeling when I lost my keys, etc. The low death toll and relative lack of blood, as compared to subsequent slasher films, has me really admiring how effectively it created the atmosphere & suspense that kept me on edge, and made me jump at the right places. I certainly don&apos;t jump any more at it, but I do have fun remembering what it was like watching it when the now-cliches were fresh & new. I laugh at the &apos;horror&apos; flicks of the 30s & 40s, but when they were new, I bet they were something. And I bet in another 20 years, today&apos;s toddlers will find Scream/IKWYDLS, et al, to be tame and passe too, at least compared to what they&apos;ll (& I&apos;ll) be watching then!\n\nI&apos;m surprised at the number of people half my age who wish they could&apos;ve been around to see this film when it was brand new!\n\nLooking back, Halloween probably scared me more when it was new, than other horror movies have,when they were new. Horror films are indebted to Halloween for breaking some new ground, and I can&apos;t wait for the next horror film that will do something on a similar scale.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 303206,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "X",
  "genre": [
    "Horror",
    "Thriller"
  ],
  "datePublished": "1979-01-25",
  "keywords": "halloween,babysitting,year 1978,stabbed to death,homicidal maniac",
  "duration": "PT1H31M",
  "actor": [
    {
      "name": "Donald Pleasence",
      "url": "https://www.imdb.com/name/nm0000587/"
    },
    {
      "name": "Jamie Lee Curtis",
      "url": "https://www.imdb.com/name/nm0000130/"
    },
    {
      "name": "Tony Moran",
      "url": "https://www.imdb.com/name/nm0602985/"
    }
  ],
  "director": [
    {
      "name": "John Carpenter",
      "url": "https://www.imdb.com/name/nm0000118/"
    }
  ],
  "creator": [
    {
      "name": "John Carpenter",
      "url": "https://www.imdb.com/name/nm0000118/"
    },
    {
      "name": "Debra Hill",
      "url": "https://www.imdb.com/name/nm0384185/"
    }
  ]
}