{
  "type": "Movie",
  "name": "If Beale Street Could Talk",
  "url": "https://www.imdb.com/tt7125860/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTEzNTYzMTg0OTdeQTJeQWpwZ15BbWU4MDg1OTQzODYz._V1_.jpg",
  "description": "A young woman embraces her pregnancy while she and her family set out to prove her childhood friend and lover innocent of a crime he didn&apos;t commit.",
  "review": {
    "author": "CinemaClown",
    "dateCreated": "2019-02-02",
    "inLanguage": "English",
    "heading": "Heartwarming & Heartbreaking In Equal Doses",
    "reviewBody": "A sumptuously shot, delicately layered & beautifully composed symphony of love, hope, tragedy, sacrifice & communal bonding, If Beale Street Could Talk is a pure, poetic & passionate piece of work from Barry Jenkins that presents the filmmaker making terrific use of his skillset to deliver yet another emotionally resonant fable.\n\nThe story follows a young African-American woman whose life takes a tragic turn after her fiancé is wrongfully arrested for a crime he didn&apos;t commit. With the couple expecting their first child, she races against time to prove his innocence and seeks support from her family who help her throughout her pregnancy and with the case.\n\nFresh from his Academy Award-winning Moonlight, writer-director Barry Jenkins translates James Baldwin&apos;s novel on the film canvas with honesty & authenticity, thus making sure the story&apos;s essence remains in tact. Each scene is crafted with care & compassion, and the resulting imagery from that is rich in both colours & emotions.\n\nFrom a technical standpoint, If Beale Street Could Talk is sophisticated filmmaking throughout. The images aren&apos;t just gorgeously rendered but are more than capable of narrating the entire story without any verbal exposition. The unhurried pacing is deliberate yet may not appease all while Nicholas Britell&apos;s stirring score is as fitting as it is emotionally evocative.\n\nComing to the performances, the film packs a reliable cast in Kiki Layne, Stephan James, Regina King, Colman Domingo, Brian Tyree Henry & Ed Skrein, and none of them falter in their respective roles. Layne & James play the young couple and share a heartfelt chemistry on screen. Skrein is easily detestable as the racist cop. And King leaves her own mark with a solid input.\n\nOn an overall scale, If Beale Street Could Talk is an amalgamation of polished direction, sincere writing, arresting photography, mesmerising score & committed performances that manages to be heartwarming & heartbreaking in equal doses, and finds Barry Jenkins channeling his creative energy to give expression to his African-American legacy through the eyes of a young couple, their families & their lives.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 51935,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2019-02-08",
  "keywords": "prison,1970s,love,based on novel,new york city",
  "duration": "PT1H59M",
  "actor": [
    {
      "name": "KiKi Layne",
      "url": "https://www.imdb.com/name/nm8460487/"
    },
    {
      "name": "Stephan James",
      "url": "https://www.imdb.com/name/nm4150847/"
    },
    {
      "name": "Regina King",
      "url": "https://www.imdb.com/name/nm0005093/"
    }
  ],
  "director": [
    {
      "name": "Barry Jenkins",
      "url": "https://www.imdb.com/name/nm1503575/"
    }
  ],
  "creator": [
    {
      "name": "Barry Jenkins",
      "url": "https://www.imdb.com/name/nm1503575/"
    },
    {
      "name": "James Baldwin",
      "url": "https://www.imdb.com/name/nm0049924/"
    }
  ]
}