{
  "type": "Movie",
  "name": "Overlord",
  "url": "https://www.imdb.com/tt4530422/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzU0NTI1MTU2M15BMl5BanBnXkFtZTgwNTg4MDIzNjM@._V1_.jpg",
  "description": "A small group of American soldiers find horror behind enemy lines on the eve of D-Day.",
  "review": {
    "author": "eddie_baggins",
    "dateCreated": "2019-03-13",
    "inLanguage": "English",
    "heading": "A box-office dud destined for cult status",
    "reviewBody": "At one stage thought to be some form of Cloverfield sequel/prequel, thanks to the association with wonder producer J.J Abrams and his production company Bad Robot, Overlord is very much a film set in its own universe that takes us on a gore filled World War 2 set adventure to occupied France, as a small collection of American soldiers discover that German run labs are not the ideal place to spend time in.\n\nDirected by upcoming Australian filmmaker Julius Avery whose previous film Son of a Gun showed much promise, Overlord does a lot with its relatively small budget of $38 million as we are thrust into the D-Day invasion and follow a collection of paratroopers on a mission to destroy a German radio bunker set up at the base of an old church building.\n\nIt&apos;s not being over the top when you say the first 10 - 20 minutes of Avery&apos;s film are some of the most thrilling and dazzling of the last 12 months, with the audience given barely a moment to breathe as the films stunning opening set-piece takes place and we launch out of an under fire carrier plane with Jovan Adepo&apos;s Boyce and his fellow soldiers.\n\nIf Overlord had somehow managed to keep this pace, intensity and style up, Avery&apos;s film would be a dead-set undeniable gem but sadly the film unleashes its best too early as the film around it, whilst often entertaining and gloriously over the top, just never quite delivers the thrills, spills and chills like you&apos;d wished it had done.\n\nTruly becoming the cinematic equivalent of the famous Wolfenstein video game series (which must&apos;ve been a direct inspiration for this tale), Overlord&apos;s mix of war time action, sci-fi, straight up visceral horror (found within the Nazi&apos;s underground labs) and thriller doesn&apos;t always hold up, even if it&apos;s great to see a film of this ilk play it completely straight with Overlord forgoing laughs as there&apos;s no winking to the camera as the nefarious goings on begin to take hold.\n\nIt&apos;s a gore-filled and claret flowing exercise, with Avery clearly at home with the action side of things and a little less so at character building, with side players like Wyatt Russell&apos;s knuckle-duster loving Ford, John Magaro&apos;s stereotypical Italian solider and Mathilde Ollivier&apos;s token French female tomboy Chloe having fun but remaining fairly forgettable with Game of Thrones star Pilou Asbæk stealing the acting show with his turn as evil Nazi Wafner.\n\nYou never regret going along for this ride with enough imagination, impressive make-up and special effects and darkly imagined horrors such a soldiers traumatic return from death keeping things moving and ever watchable, you just can&apos;t help but feel like Overlord had the potential to become a genuine classic of its genre mash-up.\n\nFinal Say -\n\nThere&apos;s a lot to like about Overlord (an unfortunate box-office dud) that&apos;s likely to find a much a larger audience on home release but despite its many strengths and standout individual scenes, this Wolfenstein come to life is a mostly enjoyable but mostly forgettable affair.\n\n3 bullet wounds out of 5",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 105392,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "18",
  "genre": [
    "Action",
    "Horror",
    "Sci-Fi"
  ],
  "datePublished": "2018-11-07",
  "keywords": "world war two,nazi,supernatural power,nazi occultism,secret laboratory",
  "duration": "PT1H50M",
  "actor": [
    {
      "name": "Jovan Adepo",
      "url": "https://www.imdb.com/name/nm5381254/"
    },
    {
      "name": "Wyatt Russell",
      "url": "https://www.imdb.com/name/nm0751518/"
    },
    {
      "name": "Mathilde Ollivier",
      "url": "https://www.imdb.com/name/nm7230577/"
    }
  ],
  "director": [
    {
      "name": "Julius Avery",
      "url": "https://www.imdb.com/name/nm1170339/"
    }
  ],
  "creator": [
    {
      "name": "Billy Ray",
      "url": "https://www.imdb.com/name/nm0712753/"
    },
    {
      "name": "Mark L. Smith",
      "url": "https://www.imdb.com/name/nm1872664/"
    }
  ]
}