{
  "type": "Movie",
  "name": "Second Act",
  "url": "https://www.imdb.com/tt2126357/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjQ2MjI5Njk0MF5BMl5BanBnXkFtZTgwNDQ2NzczNTM@._V1_.jpg",
  "description": "A big-box store worker reinvents her life and her life-story and shows Madison Avenue what street smarts can do.",
  "review": {
    "author": "HEFILM",
    "dateCreated": "2019-01-08",
    "inLanguage": "English",
    "heading": "2 plots that don&apos;t go together",
    "reviewBody": "This film is sold as one thing but tries to be two which about ruins both. The story the film was sold on is about women in a dead end job who is given a chance at a big league job by a faked resume. But it&apos;s also got a very melodramatic/ soap opera story about the woman and her long lost daughter.\n\nThe movie also is rather cheap and video-looking, neither Lopez or Remini look particularly good, though Lopez is still playing a character ten years younger than she is--which she pulls off, I only mention this as it has the feel of a 90&apos;s cable tv movie.\n\nInteractions with Remini and Lopez are good, probably the best thing about the movie actually, then again the focus of the film shifts to the melodrama lost child thing, of which Remini is virtually abscent from.\n\nThe director was well cast to direct this kind of film but his earlier films are much better and have a sense of being a complete movie that this one lacks.\n\nSupporting characters are most cartoons and, in the faked resume portion of the film are funny enough.\n\nOf course Lopez is a big glamorous star, so for her to pull off this &apos;working class&apos; act is not easy, but she manages to do it--it&apos;s mostly free of star moments--she doesn&apos;t sing, isn&apos;t shot to show off her famous bottom, she does have one dance scene with friends but it seems realistic enough.\n\nTreat Williams does well in the roll of a basically unconvincing &apos;good guy&apos; mega corporation owner.\n\nThe whole idea of cramming a old hat and unconvincing mother/lost daughter movie into this one is a bad one. This is a film sold as one thing because what they aren&apos;t selling doesn&apos;t work.\n\nSad to say it on many levels is a LIFETIME level movie.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 29818,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2019-01-25",
  "keywords": "adopted daughter,boyfriend girlfriend relationship,two word title,f rated,friendship between women",
  "duration": "PT1H43M",
  "actor": [
    {
      "name": "Jennifer Lopez",
      "url": "https://www.imdb.com/name/nm0000182/"
    },
    {
      "name": "Vanessa Hudgens",
      "url": "https://www.imdb.com/name/nm1227814/"
    },
    {
      "name": "Leah Remini",
      "url": "https://www.imdb.com/name/nm0718957/"
    }
  ],
  "director": [
    {
      "name": "Peter Segal",
      "url": "https://www.imdb.com/name/nm0781842/"
    }
  ],
  "creator": [
    {
      "name": "Justin Zackham",
      "url": "https://www.imdb.com/name/nm0951698/"
    },
    {
      "name": "Elaine Goldsmith-Thomas",
      "url": "https://www.imdb.com/name/nm0326063/"
    }
  ]
}