{
  "type": "Movie",
  "name": "Sherlock Gnomes",
  "url": "https://www.imdb.com/tt2296777/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc2NjUzODMxMF5BMl5BanBnXkFtZTgwMzMwMDIzNDM@._V1_.jpg",
  "description": "Garden gnomes, Gnomeo and Juliet recruit renowned detective Sherlock Gnomes to investigate the mysterious disappearance of other garden ornaments.",
  "review": {
    "author": "Pjtaylor-96-138044",
    "dateCreated": "2018-05-08",
    "inLanguage": "English",
    "heading": "You&apos;re left wondering who it&apos;s for, and why you can&apos;t care enough to even be bored.",
    "reviewBody": "You are left wondering exactly who &apos;Sherlock Gnomes (2018)&apos; is for, other than the pun-masters who came up with its title while presumably snickering for a second and then realising they have to spend literally years to make an entire feature surrounding their wordsmith handiwork. See, it&apos;s not like any of the four year-old&apos;s this should be aimed at will get most of the &apos;adult&apos; or referential humour or even know who &apos;Sherlock Holmes&apos; is, much less care for his porcelain counterpart, and I&apos;d even stretch to say that the &apos;potty&apos; humour that&apos;s seen here is just too subtle to give kids a giggle, either. It simultaneously seems to aim too young and too old, failing to find its audience because of this. Where the first &apos;Gnomeo & Juliet (2011)&apos; sought to bring a classic Shakespeare story to a younger audience, however successfully, this one clearly just started with a pun and spun out from there, with no real intention of adapting a proper source story or even sticking to the character in any real way. It&apos;s not too big a leap to assume the character was only chosen due to the earliest of his stories being in the public domain. The result is a mishmash of the first flick with these loosely adapted, but not really parodied, characters from a classic adult detective fiction that has no connection to either &apos;Romeo & Juliet&apos; or any of the Gnome elements from the franchise. These pieces clash together and vie for attention in a bizarre way, both competing to control a film which should really be a sequel to its predecessor but can&apos;t properly be because it&apos;s not allowed to have time away from its new, essentially unrelated characters. It therefore doesn&apos;t introduce children to the &apos;Holmes&apos; character through his &apos;Gnomes&apos; variant, in the way that &apos;Gnomeo&apos; leads nicely into &apos;Romeo&apos; even though the former is a severely watered down version of the latter, but still heavily borrows an amalgamation of elements from several of Sir Arthur Conan Doyle&apos;s stories and uses them as fodder for clumsy jokes and haphazard plot elements. It&apos;s almost as if you&apos;d need to be a proper &apos;Holmes&apos; fan to even understand most of these references, and if you&apos;re a fan you probably won&apos;t like this or its representation of the character - though, you probably won&apos;t see it, to be fair. The piece also opens the world up in strange ways that make it feel closer to &apos;Toy Story (1995)&apos; in the worst way possible, a bad imitation losing its identity in every way it can.\n\nIt&apos;s actually a little hard to put my finger on why I disliked this one as much as I did, for in theory it ought to be a harmless, if joyless, experience that can be watched passively, yet easily. It&apos;s not offensive, the voice-work is decent and so is the animation. There was clearly work put into the piece and the messages are important, if a little ham-fisted. On paper, it is certainly far from the worst thing I&apos;ve seen. Yet, I have a distinct distaste for it. I&apos;m not angry, tired or still cringing about it (though I was cringing pretty much every time Elton John came on in lieu of a musical score), and I wasn&apos;t totally bored while watching. I think that might just be it, though: the lack of any real response. It isn&apos;t good for anything, not even putting you to sleep. 3/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 13818,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.2
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2018-05-11",
  "keywords": "romeo character,juliet character,animate statue,sequel,mankini",
  "duration": "PT1H26M",
  "actor": [
    {
      "name": "Johnny Depp",
      "url": "https://www.imdb.com/name/nm0000136/"
    },
    {
      "name": "James McAvoy",
      "url": "https://www.imdb.com/name/nm0564215/"
    },
    {
      "name": "Emily Blunt",
      "url": "https://www.imdb.com/name/nm1289434/"
    }
  ],
  "director": [
    {
      "name": "John Stevenson",
      "url": "https://www.imdb.com/name/nm0828970/"
    }
  ],
  "creator": [
    {
      "name": "Ben Zazove",
      "url": "https://www.imdb.com/name/nm4475394/"
    },
    {
      "name": "Andy Riley",
      "url": "https://www.imdb.com/name/nm0726978/"
    },
    {
      "name": "Kevin Cecil",
      "url": "https://www.imdb.com/name/nm0147700/"
    }
  ]
}