{
  "type": "Movie",
  "name": "The Darkest Minds",
  "url": "https://www.imdb.com/tt4073790/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTUxOGE3OTUtM2I2My00YzE3LTg2NDktZTI3NjE4NDdjMGFiXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
  "description": null,
  "review": {
    "author": "Platypuschow",
    "dateCreated": "2018-11-18",
    "inLanguage": "English",
    "heading": "The Darkest Minds: Another doomed franchise",
    "reviewBody": "The Darkest Minds is the latest teen sci-fi franchise alike Hunger Games, Divergent, Twilight, The Host etc etc etc and alike the majority of them will never be a fully told story.\n\nIt tells the tale of a world where 90% of kids die leaving the remaining ones with a selection of super powers (For some unexplained reason). The government rounds them up and incarcerates them out of fear killing off the more powerful ones.\n\nIt follows the tale of one girl who is smuggled out and goes on the run. But who can she trust?\n\nPersonally I loved the concept, such potential! Under the circumstances a television series would have made a tremendous amount more sense as I think this is all we&apos;re ever going to see from the Darkest Minds universe.\n\nOur leading lady is fantastic, truly stellar performance and it wasn&apos;t until late in the film I realised it was Rue from the Hunger Games (2012) all grown up. Alongside her we have the excellent Bradley Whitford, Wade Williams, Mandy Moore and Game of Thrones star Gwendoline Christie (Though all of them are rather brief).\n\nOne thing that struck me was the leading man Harris Dickinson, he just wasn&apos;t up to the job in any respect and felt like a weak link throughout. I can&apos;t imagine how he got the job and question castings logic with that one.\n\nThe main issue with the movie is that it&apos;s the same as the rest. What I mean by that is these teen sci-fi types take a concept and then surround it by the usual tropes that are so blatant and so excessive it damages them beyond repair. This made the film cliched beyond words and criminally predictible.\n\nAll things considered it could be worse but all the teen sci-fi tropes, the fact this is all we&apos;ll get and thus leaving us with an incomplete story and a weak leading man stopped any potential it had dead in its tracks.\n\nGreat for what it is and I see the appeal, but this is to the movie industry what pop is to the music industry.\n\nThe Good:\n\nAmandla Stenberg\n\nDecent supporting cast\n\nSome very good ideas\n\nHearts in the right place\n\nThe Bad:\n\nToo many tropes\n\nVery cliched\n\nHarris Dickinson\n\nThings I Learnt From This Movie:\n\nHollywood needs to go back to the drawing board on this genre\n\nA world without kids sounds like my kind of place",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 35577,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Drama"
  ],
  "datePublished": "2018-08-10",
  "keywords": "supernatural power,mind control,telekinesis,memory erasure,attempted rape",
  "duration": "PT1H44M",
  "actor": [
    {
      "name": "Amandla Stenberg",
      "url": "https://www.imdb.com/name/nm3964350/"
    },
    {
      "name": "Mandy Moore",
      "url": "https://www.imdb.com/name/nm0601553/"
    },
    {
      "name": "Bradley Whitford",
      "url": "https://www.imdb.com/name/nm0925966/"
    }
  ],
  "director": [
    {
      "name": "Jennifer Yuh Nelson",
      "url": "https://www.imdb.com/name/nm0950775/"
    }
  ],
  "creator": [
    {
      "name": "Chad Hodge",
      "url": "https://www.imdb.com/name/nm1209925/"
    },
    {
      "name": "Alexandra Bracken",
      "url": "https://www.imdb.com/name/nm4428412/"
    }
  ]
}