{
  "type": "Movie",
  "name": "The Great Buster",
  "url": "https://www.imdb.com/tt8758548/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYmQ5OTYyYjctMmY4Ny00OGE0LWIxNjktNWMwZWEzNTEyZTlkXkEyXkFqcGdeQXVyNjc0MzY3NTA@._V1_.jpg",
  "description": "Documentary on the life and works of comic genius Buster Keaton, directed by Peter Bogdanovich.",
  "review": {
    "author": "nedeljkodjukic88",
    "dateCreated": "2019-02-27",
    "inLanguage": "English",
    "heading": "The greatly missed Buster",
    "reviewBody": "People&apos;s collective sense of humor change with time. But, this reminds me of people frantically trying to keep up with technology that is supposed to make their lives easier. Just as we become more and more addicted to and dependent on technology and all its modern gadgets - we gradually lose our own resourcefulness and creativity.\n\nThis is what happened in movie industry with comedies (and not just comedies). First we had silent B&W movies where you needed to be a genius to make audience laugh with no use of sound and color, with things you could barely call special effects today and smart use of dialogues only when necessary. A while later, it was easier for actors and directors as they could use all those things to make a good movie. Need for ingenuity lowered.\n\nThen suddenly, the only thing that worked was actors swearing in almost every line they spoke. Nowadays, almost exclusively, directors rely on swearing, sarcasm and cheap irony (in other genres blood, nudity, violence, etc.).\n\nNeed for ingenuity practically disappeared. Or do we need it more than ever?\n\nOne of such original genius of the silent era was Buster Keaton. And he pretty much did all his best work himself - he wrote the scenes, directed them, acted in them and pulled many highly dangerous stunts to achieve perfection each time. This documentary by Peter Bogdanovich (Petar Bogdanovic in Serbian - he&apos;s my countryman :)) puts the Great Buster under the spotlight right in time as the cinema is crying for it. And it will serve as a quality intro for announced restoration of the comic&apos;s top movies. Bogdanovich&apos;s choice of talking heads is questionable, but some of them are obviously selected to draw the younger audience.\n\nIt is truly a celebration of Keaton&apos;s legacy but also a reminder what the real, healthy humor is all about - not vulgarity and humiliation, but simplicity, originality and inventiveness. This brilliant comic was known as the Great Stone Face, but - as pointed out by Cybill Shepherd (and as told by John Ford once) - you act with your eyes, not with your face.\n\nI just hope that at least a part of today&apos;s spoiled audience that only ask for new, loud, fast (and senseless) movies will recognize the great value of Buster&apos;s works - all presented timely and nicely by Bogdanovich - and discover it for themselves. I sure will, although I decided this already after watching The General.The Genius Buster - the one we need today...",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 2273,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.5
  },
  "contentRating": "PG",
  "genre": [
    "Documentary",
    "Biography",
    "Comedy"
  ],
  "datePublished": "2020-03-20",
  "keywords": "film director,filmmaker,mgm studios,rise and fall,actor",
  "duration": "PT1H42M",
  "actor": [
    {
      "name": "Peter Bogdanovich",
      "url": "https://www.imdb.com/name/nm0000953/"
    },
    {
      "name": "Dick Cavett",
      "url": "https://www.imdb.com/name/nm0147118/"
    },
    {
      "name": "Frank Capra",
      "url": "https://www.imdb.com/name/nm0001008/"
    }
  ],
  "director": [
    {
      "name": "Peter Bogdanovich",
      "url": "https://www.imdb.com/name/nm0000953/"
    }
  ],
  "creator": [
    {
      "name": "Peter Bogdanovich",
      "url": "https://www.imdb.com/name/nm0000953/"
    }
  ]
}