{
  "type": "Movie",
  "name": "The Hate U Give",
  "url": "https://www.imdb.com/tt5580266/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZDVkMWJiMzUtNjQyOS00MGVmLWJhYmMtN2IxYzU4MjY3MDRmXkEyXkFqcGdeQXVyNzA5NjIzODk@._V1_.jpg",
  "description": "Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Now, facing pressure from all sides of the community, Starr must find her voice and stand up for what&apos;s right.",
  "review": {
    "author": "ebkamikaze",
    "dateCreated": "2018-10-04",
    "inLanguage": "English",
    "heading": "A Perspective Film",
    "reviewBody": "I believe this film creates an opportunity to open the eyes of someone not privy to our perspective. Sometimes they have to see these issues play out in front of them. A story or speech may not reach deep enough to connect you to the heart of people who have suffered loss and live in a near impossible situation. If you just see it as a I HATE WHITES movie, you&apos;ve missed the point. Dig deeper. \n\nDo I have some criticisms, of course. Some scenarios are obvious slaves to plot progression. One argument could be that only 1-2 characters had a complete arc and that some questions were left unanswered. Well, I agree. That&apos;s art imitating life. \n\nI believe the dialogue regarding the title of the film was clever and introspective that I haven&apos;t been able to get it out of my head. It also asks me to form MY OWN opinion of the phrase&apos;s meaning. So: Mission Accomplished. \n\nI&apos;d say the acting was pretty good. Not the biggest fan of the language but unfortunately I know I&apos;m in the minority there. Every character performed. It was exciting to see Anthony Mackie in this role. I think he sold it. Seven&apos;s actor stole his scenes. I believe that Common was allowed him to play himself, because a farther reach may not be believable. Amandla is something special. She is such a star and I can&apos;t wait to see what&apos;s in store for her. \n\nIm proud to have seen it and it has the opportunity to open the eyes of some so blinded by their own privilege 8.5/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 39498,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.5
  },
  "contentRating": "12A",
  "genre": [
    "Crime",
    "Drama"
  ],
  "datePublished": "2018-10-22",
  "keywords": "african american,father daughter relationship,racism,loss of friend,teenage girl",
  "duration": "PT2H13M",
  "actor": [
    {
      "name": "Amandla Stenberg",
      "url": "https://www.imdb.com/name/nm3964350/"
    },
    {
      "name": "Regina Hall",
      "url": "https://www.imdb.com/name/nm0356021/"
    },
    {
      "name": "Russell Hornsby",
      "url": "https://www.imdb.com/name/nm0395203/"
    }
  ],
  "director": [
    {
      "name": "George Tillman Jr.",
      "url": "https://www.imdb.com/name/nm0863387/"
    }
  ],
  "creator": [
    {
      "name": "Audrey Wells",
      "url": "https://www.imdb.com/name/nm0920108/"
    },
    {
      "name": "Angie Thomas",
      "url": "https://www.imdb.com/name/nm8021571/"
    }
  ]
}