{
  "type": "Movie",
  "name": "Instant Family",
  "url": "https://www.imdb.com/tt7401588/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjFmYTUwMTctNGYwMy00NWE5LTkxNmItODI3MGE4YTg4N2QxXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
  "description": "A couple find themselves in over their heads when they foster three children.",
  "review": {
    "author": "sweidman-28016",
    "dateCreated": "2018-11-16",
    "inLanguage": "English",
    "heading": "Enjoyable Happy Feel-Good Movie",
    "reviewBody": "Instant Family Review:\n\nInstant Family is comedy based on the true story of a married couple, Pete (Mark Wahlberg) and Ellie (Rose Byrne), who decide to foster three kids and they must face the challenges that come with it. This was a very enjoyable happy, feel-good movie. The story was very interesting, yet predictable, that made you feel for the people. Both Mark and Rose did a good job. Isabella Moner as Liszt, the oldest child, was probably the best part of the film. She brought so much to the table and gave it all she had. She was also in the recent summer movie sequel Sicario: Day of the Saldado and she did well in that too. The other two kids, Gustavo Quiroz (Juan) and Julianna Gamiz (Lita), we&apos;re very good child actors. Octavia Spencer was hilarious and amazing as always. This movie had some great humor. It could also be serious and knew how to switch tones well. It was a little bit long, just about two hours, and I felt that some scenes could&apos;ve been cut out. Also we didn&apos;t know much of a background for Pete and Ellie so I didn&apos;t feel as strong as a connection for them as I wanted to. Another thing is the trailer kind of showed the whole movie with some stuff taken out, which I&apos;ve seen a lot of trailers doing that lately (Welcome to Marwen). This is a very enjoyable film and I think people will like it. It probably won&apos;t make as much money with Fantastic Beasts: The Crimes of Grindelwald coming out and many more, but I would recommend it.\n\nMy Grade: B+",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 117318,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.3
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2019-02-14",
  "keywords": "parenting,adoption,support group,adoptive family,adoptive mother adoptive son relationship",
  "duration": "PT1H58M",
  "actor": [
    {
      "name": "Mark Wahlberg",
      "url": "https://www.imdb.com/name/nm0000242/"
    },
    {
      "name": "Rose Byrne",
      "url": "https://www.imdb.com/name/nm0126284/"
    },
    {
      "name": "Isabela Merced",
      "url": "https://www.imdb.com/name/nm5097044/"
    }
  ],
  "director": [
    {
      "name": "Sean Anders",
      "url": "https://www.imdb.com/name/nm1890845/"
    }
  ],
  "creator": [
    {
      "name": "Sean Anders",
      "url": "https://www.imdb.com/name/nm1890845/"
    },
    {
      "name": "John Morris",
      "url": "https://www.imdb.com/name/nm1898234/"
    }
  ]
}