{
  "type": "Movie",
  "name": "Juliet, Naked",
  "url": "https://www.imdb.com/tt5607096/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTk3OTE3ODg1Ml5BMl5BanBnXkFtZTgwMTI4NTE4NTM@._V1_.jpg",
  "description": "Annie (the long-suffering girlfriend of Duncan) has an unlikely transatlantic romance with once revered, now faded, singer-songwriter, Tucker Crowe, who also happens to be the subject of Duncan&apos;s musical obsession.",
  "review": {
    "author": "PotassiumMan",
    "dateCreated": "2018-08-20",
    "inLanguage": "English",
    "heading": "Underrated romantic comedy, an utter joy",
    "reviewBody": "Rose Byrne and Chris O&apos;Dowd are a long-time couple living in a seaside town in this winning film about music fandom and romantic rejuvenation. She&apos;s a museum curator in her local area. He&apos;s a classics professor who, in his spare time, devotes his life to discussing and extolling the music of a legendary rock star who disappeared from performing and from making albums two decades ago. O&apos;Dowd&apos;s character has even created an online forum for the rock star&apos;s most rabid fans. The couple&apos;s relationship begins to take a turn when the rock star (Ethan Hawke, ever reliable in his charisma) attempts a career resurgence.\n\nA film about a faded rock star coming back out of the shadows is not a new theme, but here it feels so crisp. Hawke&apos;s performance is perfect, as are Byrne and O&apos;Dowd, a seeming odd couple whose devotion is showing signs of strain. O&apos;Dowd&apos;s character is quite funny when he keeps finding out new information about his idol.\n\nAlthough there are romantic comedies on the subject of music and midlife perspective, this one proves extra eloquent and engaging. It&apos;s not just a film about finding love. It&apos;s also about discovering the difference between a fan&apos;s rose-colored glasses and reality; a dinner scene captures this theme brilliantly. Even if the rest of the film hadn&apos;t been any good (which is not the case), I still would have recommended this film on the strength of that scene alone.\n\nThis film has gotten only lukewarm reviews so far, which is odd. I am hopeful that audiences and other critics will give it the recognition it deserves. Gladly recommended.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 24322,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama",
    "Music"
  ],
  "datePublished": "2018-11-02",
  "keywords": "musician,museum,pregnancy,infidelity,singing",
  "duration": "PT1H37M",
  "actor": [
    {
      "name": "Chris O&apos;Dowd",
      "url": "https://www.imdb.com/name/nm1483369/"
    },
    {
      "name": "Rose Byrne",
      "url": "https://www.imdb.com/name/nm0126284/"
    },
    {
      "name": "Ethan Hawke",
      "url": "https://www.imdb.com/name/nm0000160/"
    }
  ],
  "director": [
    {
      "name": "Jesse Peretz",
      "url": "https://www.imdb.com/name/nm0673400/"
    }
  ],
  "creator": [
    {
      "name": "Evgenia Peretz",
      "url": "https://www.imdb.com/name/nm3077617/"
    },
    {
      "name": "Jim Taylor",
      "url": "https://www.imdb.com/name/nm0852591/"
    },
    {
      "name": "Tamara Jenkins",
      "url": "https://www.imdb.com/name/nm0420982/"
    }
  ]
}