{
  "type": "Movie",
  "name": "Mary, Queen of Scots",
  "url": "https://www.imdb.com/tt0067402/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMDMzZDVkYmUtN2MyMC00OWExLThhZTktNGRjZGU0ZmJhYTUxXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
  "description": "During the sixteenth century, the Catholic Mary, Queen of Scots engages in over two decades of religious and political conflict with her cousin, the Protestant Queen Elizabeth I of England, amidst political intrigue in her native ...",
  "review": {
    "author": "roghache",
    "dateCreated": "2006-04-03",
    "inLanguage": "English",
    "heading": "Captivating study of the Tudor Era&apos;s royal lady rivals",
    "reviewBody": "It&apos;s been quite some time since I saw this movie, so have forgotten many of the details, but quite enjoyed this portrait of the clash between Mary Queen of Scots and her rival Tudor cousin, Elizabeth I. I confess to a lack of knowledge as to its historical accuracy, which may perhaps be just as well, as I read that the supposed meeting between the two queens never took place in real life. The producers presumably felt audiences would expect such an in person meeting. Frankly, however, while such films might be permitted a wee bit of dramatic license, they should definitely stick with fundamental historical truths. \n\nThe movie chronicles the struggles of Mary Stewart, who returns from France, where she had been wife to the sickly (now deceased) king Francois II, to Scotland, where her Protestant half brother, Jamie, is acting as Regent. In order to secure the Scottish throne for herself and her son (later James VI of Scotland and James I of England), she must battle the Scottish Lords, her brother Jamie, who causes rebellions against his sister, and even her second husband, Lord Darnley, who makes a bid for the throne himself. The most devastating enemy proves to be her royal English cousin, Elizabeth I, who sees Mary as a threat, especially when Mary produces (with Darnley) a son while she (Elizabeth) remains unmarried and childless.\n\nThe main asset of the movie lies in its two female leads, who portray the warm, emotional Catholic Mary and the cool, calculating Protestant Elizabeth. Vanessa Redgrave made, at least for me, a convincing enough Mary. Especially, however, I recall Glenda Jackson as an absolutely brilliant Queen Elizabeth. She IS Elizabeth, and I believe to a certain extent, it&apos;s really her movie. To this day, whenever I picture Elizabeth I, it&apos;s Glenda Jackson, who of course went on to play the Virgin Queen in the TV series, Elizabeth R. \n\nOthers in the star studded cast include Patrick McGoohan as James Stewart (Mary&apos;s brother), Timothy Dalton as Lord Darnley (Mary&apos;s weak, conniving second husband), and Nigel Davenport as Bothwell (Mary&apos;s true love and third husband). Two of Elizabeth&apos;s ministers are portrayed by Trevor Howard as Sir William Cecil, and Daniel Massey as the queen&apos;s devoted Dudley.\n\nBeautiful Oscar nominated Tudor period costumes and scenes. I would like to see again the tale of this tragic figure, a woman who should have been content with her Scottish crown and not covetous of the English one as well. Pity modern cinema seems disinclined to delve into these British historical dramas. Personally, I would like to see more movies such as this one and the 1986 Lady Jane with Helena Bonham Carter. There&apos;s certainly no lack of historical figures that would make interesting subjects.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 4774,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "A",
  "genre": [
    "Biography",
    "Drama",
    "History"
  ],
  "datePublished": "1972-03-28",
  "keywords": "female ruler,character name as title,birth,exploding house,anglican",
  "duration": "PT2H8M",
  "actor": [
    {
      "name": "Vanessa Redgrave",
      "url": "https://www.imdb.com/name/nm0000603/"
    },
    {
      "name": "Glenda Jackson",
      "url": "https://www.imdb.com/name/nm0413559/"
    },
    {
      "name": "Patrick McGoohan",
      "url": "https://www.imdb.com/name/nm0001526/"
    }
  ],
  "director": [
    {
      "name": "Charles Jarrott",
      "url": "https://www.imdb.com/name/nm0418986/"
    }
  ],
  "creator": [
    {
      "name": "John Hale",
      "url": "https://www.imdb.com/name/nm0354942/"
    }
  ]
}