{
  "type": "Movie",
  "name": "Maze Runner: The Death Cure",
  "url": "https://www.imdb.com/tt4500922/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTYyNzk3MDc2NF5BMl5BanBnXkFtZTgwMDk3OTM1NDM@._V1_.jpg",
  "description": null,
  "review": {
    "author": "ThomasDrufke",
    "dateCreated": "2018-01-31",
    "inLanguage": "English",
    "heading": "A Fitting Finale",
    "reviewBody": "I&apos;m glad that the filmmakers still found a way to release The Death Cure and not go straight to digital/on demand. It&apos;s not that I think this trilogy is among the best post apocalyptic series nor did I really have an ounce of excitement going in, but after Dylan O&apos;Brien had his accident and over 2 years of fans waiting, the ending is here.\n\nIf I&apos;m being completely honest, The Death Cure actually served as a perfectly fitting end to an above average young adult series. I don&apos;t consider myself a fan per say, but if I was, I&apos;m guessing I would absolutely love this film. It ties up loose ends and finds a way to close out the series in a surprisingly emotional send-off. \n\nIt&apos;s much different than say The Hunger Games, which ended the series on a completely sour and disappointingly safe note, The Death Cure takes some chances and didn&apos;t have the beat for beat moments I expected from a YA adaptation. O&apos;Brien, who is shaping himself out to be a force in this business, provided another solid lead performance and he&apos;s surrounded by equally efficient turns from Kaya Scodelario, Aidan Gillen, Thomas Brodie-Sangster, Giancarlo Esposito, and Rosa Salazar. None of them take the material too seriously, something the Divergent series had a problem with, but they found a right balance of heart and humor.\n\nIt&apos;s far from perfect, and for those who don&apos;t appreciate a good YA adaptation every once in awhile likely won&apos;t find anything here to like, but The Death Cure was immensely better than I expected. Sometimes that&apos;s all you need a film to be.\n\n6.9/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 158214,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2018-01-26",
  "keywords": "human experimentation,virus,post apocalypse,resistance movement,friendship",
  "duration": "PT2H23M",
  "actor": [
    {
      "name": "Dylan O&apos;Brien",
      "url": "https://www.imdb.com/name/nm3729721/"
    },
    {
      "name": "Ki Hong Lee",
      "url": "https://www.imdb.com/name/nm3859624/"
    },
    {
      "name": "Kaya Scodelario",
      "url": "https://www.imdb.com/name/nm2546012/"
    }
  ],
  "director": [
    {
      "name": "Wes Ball",
      "url": "https://www.imdb.com/name/nm1226871/"
    }
  ],
  "creator": [
    {
      "name": "T.S. Nowlin",
      "url": "https://www.imdb.com/name/nm2385905/"
    },
    {
      "name": "James Dashner",
      "url": "https://www.imdb.com/name/nm4212895/"
    }
  ]
}