{
  "type": "Movie",
  "name": "The Nun",
  "url": "https://www.imdb.com/tt5814060/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjM3NzQ5NDcxOF5BMl5BanBnXkFtZTgwNzM4MTQ5NTM@._V1_.jpg",
  "description": "A priest with a haunted past and a novice on the threshold of her final vows are sent by the Vatican to investigate the death of a young nun in Romania and confront a malevolent force in the form of a demonic nun.",
  "review": {
    "author": "robinalers",
    "dateCreated": "2018-09-06",
    "inLanguage": "English",
    "heading": "Not what you want it to be",
    "reviewBody": "Let&apos;s begin with saying that the movie is definitely still worth the time to see. As there are a few moments where The Nun is portrayed in such a way that you do feel how great and powerful it is, and the music during these scenes (trust me, you will recognise them when you see them) is incredible. You&apos;ll feel hopeless, just as the characters at that time, but unfortunately these moments are scarce.\n\nAs human being, we find darkness scary, we hate it because we cannot see properly and thus find ourselves in the unknown. This is what drives a good horror movie, it is why the first Paranormal Activity was such a success for example. The horror of things happening, but not knowing what it is or where it is. The Nun fails to deliver this horror of the unknown. As we, in almost all scenes, see what it is that should terrify us, in great and gory detail. And while I love a tip of the hat to a more old school type of horror (more gore and monstrous feelings), I do not like how The Nun delivers it.\n\nThe amount of times we see a close up of the face of the nun is insane, and takes away the fear that this character had left us in during the Conjuring movies. It was the lack of screentime and the darkness surrounding this character that made her so extremely scary and interesting in those movies. It reminded me of the Devil&apos;s face in the original Exorcist movie. We don&apos;t see it often, but when we see it it terrifies us, because we cannot quite tell all the characteristics of its face, and it is always surrounded by darkness. The Nun is blatantly obvious, and her screaming in the camera makes it feel more like you&apos;re watching The Mummy, than The Nun.\n\nThen there&apos;s the writing, the addition of comic relief is a good idea, but the timing is always off and rarely funny. The storyline is a bit basic, a gateway to hell, again, a demon needs a body, again, our past haunts us, again; it delivers nothing we haven&apos;t seen already. And I don&apos;t mind that, but then at least deliver it with tenacity. The jump scares feel as though they know that the audience knows its coming, so they just try to come at you from a different position than you expect: e.g., camera does a full 360, we expect something to happen, it doesn&apos;t and then something drops from above. \n\nNo, the movie disappoints. The story is basic, the timing of humor is laughable and the excessive amount of screentime - for that which petrified us with hardly any in the Conjuring movies - makes the Nun into something we hoped it wouldn&apos;t be. And unfortunately the great scenery, actually horrifying scenes and amazing soundtrack just can&apos;t lift this movie beyond &apos;just another horror movie&apos;.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 167233,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": "15",
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2018-09-07",
  "keywords": "priest,demonic nun,ghost,spin off,nun",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Demián Bichir",
      "url": "https://www.imdb.com/name/nm0065007/"
    },
    {
      "name": "Taissa Farmiga",
      "url": "https://www.imdb.com/name/nm3920288/"
    },
    {
      "name": "Jonas Bloquet",
      "url": "https://www.imdb.com/name/nm2997552/"
    }
  ],
  "director": [
    {
      "name": "Corin Hardy",
      "url": "https://www.imdb.com/name/nm2379028/"
    }
  ],
  "creator": [
    {
      "name": "Gary Dauberman",
      "url": "https://www.imdb.com/name/nm2477891/"
    },
    {
      "name": "James Wan",
      "url": "https://www.imdb.com/name/nm1490123/"
    }
  ]
}