{
  "type": "Movie",
  "name": "The Domestics",
  "url": "https://www.imdb.com/tt5591666/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZmMxMjU1MWYtYjJkOC00ZDA2LTliMTctNzgxMWY1ZDMyMjU0XkEyXkFqcGdeQXVyNjU3MTkxMDA@._V1_.jpg",
  "description": "In the weeks following an apocalyptic event, a husband and wife venture across the countryside inhabited by deadly factions in search of safety, and must work together as they are pushed to the breaking point in order to survive.",
  "review": {
    "author": "petera00",
    "dateCreated": "2018-06-30",
    "inLanguage": "English",
    "heading": "Don&apos;t read these nerds quoting Supergirl and Superman - it&apos;s a good flick",
    "reviewBody": "For too long IMDB has fallen into the hands of nerds obessesed with the new CW DC comics bug... Or the genre hype that unfortunately horror has become. This movie is legit and extremely entertaining. I wouldn&apos;t compare this to the Purge at all, but more off Walter Hill&apos;s Warriors meets Mad Max. I have a problem with critics from IMDB and Rotten Tomatoes because these people wouldn&apos;t know the difference from Bergman, Truffaut to Fulci, Bava and Argento. They misquote every genre film now and expect it to be something that it isn&apos;t. Honestly don&apos;t go into this picture thinking it&apos;s like this years hit Hereditary - because it&apos;s not. It&apos;s pure entertainment and not some bloated indie crap that they&apos;re trying to elevate as elevated horror. Honestly this has more off a grindhouse sploitation feel to it. So stop listening to these nerds belittling it and saying it doesn&apos;t make any sense... Go into it with the fresh approach that it&apos;s just fun and entertaining... Because that&apos;s what film&apos;s and especially genre films should be... FUN. And this my friends is one of the better films that doesn&apos;t care about social crap that&apos;&apos;s come out this year.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 10540,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "18",
  "genre": [
    "Action",
    "Horror",
    "Sci-Fi"
  ],
  "datePublished": "2018-08-10",
  "keywords": "supermarket,hairy chest,post apocalypse,gang,survival",
  "duration": "PT1H35M",
  "actor": [
    {
      "name": "Kate Bosworth",
      "url": "https://www.imdb.com/name/nm0098378/"
    },
    {
      "name": "Tyler Hoechlin",
      "url": "https://www.imdb.com/name/nm0388382/"
    },
    {
      "name": "Sonoya Mizuno",
      "url": "https://www.imdb.com/name/nm4420495/"
    }
  ],
  "director": [
    {
      "name": "Mike P. Nelson",
      "url": "https://www.imdb.com/name/nm2298645/"
    }
  ],
  "creator": [
    {
      "name": "Mike P. Nelson",
      "url": "https://www.imdb.com/name/nm2298645/"
    }
  ]
}