{
  "type": "Movie",
  "name": "Widows",
  "url": "https://www.imdb.com/tt4218572/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTY4NDc1NjY4OV5BMl5BanBnXkFtZTgwMjU4MDcxNjM@._V1_.jpg",
  "description": "Four women with nothing in common except a debt left behind by their dead husbands&apos; criminal activities take fate into their own hands and conspire to forge a future on their own terms.",
  "review": {
    "author": "bob the moo",
    "dateCreated": "2019-03-09",
    "inLanguage": "English",
    "heading": "A genre film with weight - good but feels better than it actually is",
    "reviewBody": "The caliber of director and cast got this film a lot of attention, and the critical response was mostly positive. On the face of it, you can see why, because it takes a generally popular genre of twists and turns and &apos;one big jobs&apos; and delivers it in a much less &apos;capery&apos; way than is normal. The characters are people, they feel and fear, hurt and lose, and they carry a lot with them from previous events in life. So it is a genre film with weight, and it was engaging in the way it did that. However the parts that engage all produce the feeling that the film should be better as a whole than it actually is.\n\nThe performances and the quality of the casting is a big part of this. They all bring a lot to their roles, and they make the material feel better by virtue of what they do. This creates the problem that the material is actually not that strong; it is still a genre film and it plays like one when you get below the surface - which reminds us why this genre is popular while also exposing weakness in this film. The reason most of these type of things are played a bit over the top, or as a caper, is that the spectacle or fun of it means the viewer allows it silliness in the plot; here though the events of the film didn&apos;t get that forgiveness because it told me it was being more serious and real. Related to this a little is the feeling that the film tries to cram too much in regarding characters and threads - so most supporting elements feel rushed or crammed in.\n\nIt is still a good watch though, with McQueen&apos;s approach adding value in the same way as the heavyweight cast all do; however I&apos;m not sure the quality links to the film as a whole, and I came away from it feeling that in any given moment the film was being better than it actually was. An interesting problem though.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 103183,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "15",
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "datePublished": "2018-11-06",
  "keywords": "heist,widow,funeral,betrayal,theft",
  "duration": "PT2H9M",
  "actor": [
    {
      "name": "Viola Davis",
      "url": "https://www.imdb.com/name/nm0205626/"
    },
    {
      "name": "Michelle Rodriguez",
      "url": "https://www.imdb.com/name/nm0735442/"
    },
    {
      "name": "Elizabeth Debicki",
      "url": "https://www.imdb.com/name/nm4456120/"
    }
  ],
  "director": [
    {
      "name": "Steve McQueen",
      "url": "https://www.imdb.com/name/nm2588606/"
    }
  ],
  "creator": [
    {
      "name": "Gillian Flynn",
      "url": "https://www.imdb.com/name/nm5058839/"
    },
    {
      "name": "Steve McQueen",
      "url": "https://www.imdb.com/name/nm2588606/"
    },
    {
      "name": "Lynda La Plante",
      "url": "https://www.imdb.com/name/nm0478852/"
    }
  ]
}