{"type": "Movie", "name": "All or Nothing", "url": "https://www.imdb.com/tt0286261/", "poster": "https://m.media-amazon.com/images/M/MV5BMjQ3NzM1NjA0NF5BMl5BanBnXkFtZTcwNjQ4MDQ3NA@@._V1_.jpg", "description": "In a poor working class London home, Penny's love for her partner, taxi driver Phil, has run dry. When an unexpected tragedy occurs, they and their local community are brought back together.", "review": {"author": "tings72", "dateCreated": "2006-04-15", "inLanguage": "English", "heading": "Life - like I remember it", "reviewBody": "Mike Leigh, in my opinion, is the greatest director ever! He needs no animations, CGI, big named stars or million dollar budgets to produce films of pure, simple genius. All or Nothing is no exception and is proving that as he ages his films have gotten better and better.\\n\\nAll or Nothing reminds me of life on a council estate as I remember it when I was a kid. There used to be flats on our estate that, although not the same in appearance, where practically the same in their inhabitants: the drunk family, the quiet family (Phil's and Penny's family), the druggie families, the slightly odd kid, the angry violent boyfriend, the single mum with foul-mouth daughter. They were all there. Anyone who knows life on an estate like this would wonder how Mike Leigh can put together such an accurate snapshot into the lives of these families.\\n\\nMike's films are totally captivating. To some, it might appear like nothing really happens in them, but what I see in them is a reality that is like nothing else on film. Sometimes they're funny, sometimes so almost unwatchably painful but never, ever dull or predictable.\\n\\nOnce you're a Mike Leigh fan you're taken to a different level. I just can't take American movies seriously anymore.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 10}}, "rating": {"ratingCount": 11397, "bestRating": 10, "worstRating": 1, "ratingValue": 7.5}, "contentRating": "18", "genre": ["Drama"], "datePublished": "2002-10-18", "keywords": "working class,family relationships,abusive boyfriend,housing estate,taxi driver", "duration": "PT2H8M", "actor": [{"name": "Timothy Spall", "url": "https://www.imdb.com/name/nm0001758/"}, {"name": "Lesley Manville", "url": "https://www.imdb.com/name/nm0544334/"}, {"name": "Ruth Sheen", "url": "https://www.imdb.com/name/nm0790689/"}], "director": [{"name": "Mike Leigh", "url": "https://www.imdb.com/name/nm0005139/"}], "creator": [{"name": "Mike Leigh", "url": "https://www.imdb.com/name/nm0005139/"}]}