{"type": "Movie", "name": "Auto Focus", "url": "https://www.imdb.com/tt0298744/", "poster": "https://m.media-amazon.com/images/M/MV5BYzVmMDZiMWUtN2FkYS00ZDBkLWFjODctZTJkYTdlOTY3YzU2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg", "description": "The life of TV star Bob Crane and his strange friendship with electronics expert John Henry Carpenter.", "review": {"author": "Buddy-51", "dateCreated": "2003-04-05", "inLanguage": "English", "heading": "Focused drama", "reviewBody": "A cautionary tale of the dangers of sexual addiction, `Auto Focus&apos; shows what can happen when a person attempts to lead a double life \\u0096 in this case, a straight-laced family man by day and a pornography-obsessed playboy by night. In `Auto Focus,&apos; the family man/pornographer turns out to be none other than the well-known actor Bob Crane, the star of TV&apos;s `Hogan&apos;s Heroes,&apos; who was found murdered in a Scottsdale, Arizona hotel room in 1978 under mysterious and sensational circumstances that included the uncovering of tapes Crane had made of his own sexual experiences. The general public was shocked to discover that a man they had invited into their living rooms every week for six years had been living such an unsavory parallel existence \\u0096 though those who knew him well were apparently far less shocked by the revelation. Drawing on Robert Graysmith&apos;s book `The Murder of Bob Crane&apos; for its inspiration and viewpoint, the film, written by Michael Gerbosi and directed by Paul Schrader, chronicles the rise and fall of this handsome actor, from his days as a successful LA disc jockey and his meteoric rise to fame as star of a hit comedy series, to his growing obsession with promiscuity and pornography, which led to the disintegration of both his personal and professional life - and, ultimately, to his death, most likely at the hands of his buddy-in-sleaze, videographer John Carpenter (though he was never convicted of the murder). \\n\\n`Auto Focus&apos; certainly does not shy away from revealing many of the salacious details of this true-life story. Schrader deals head-on with the disturbing nature of a mind so all consumed with the subject of sex that all other aspects of life become obliterated and distorted. What&apos;s fascinating about Crane \\u0096 at least in the way he is depicted in this film \\u0096 is that he seems to have had some sort of self-destructive death wish, for not only does he risk his career by sleeping with countless women, but he insists on leaving behind the evidence by videotaping many of his encounters, and then flaunting his `accomplishments&apos; to others in the Hollywood community. In a way, such a cavalier attitude only underlines the sickness at the core of Crane&apos;s soul \\u0096 which in a perverse, paradoxical way, actually makes Crane a more sympathetic figure than he otherwise might be. An enormous amount of credit for this also goes to Greg Kinnear who does a superb job of not only replicating Crane&apos;s style of acting but of showing us the tortured man Crane became in his later years. He was truly a man driven to madness by the demons within him, and we can all identify in some sense with that condition (our demons may not be sexual in nature, but they probably eat away at us just as ravenously as they did Crane). Kinnear gets outstanding support from Willem Dafoe as Carpenter, the Svengali-like figure who lures Crane into his world of photographed sex, and Ron Leibman, as Crane&apos;s well-meaning, caring agent who can do little but stand by helplessly as his client throws his career and his life away to feed this devouring passion.\\n\\nThe filmmakers have done an amazing job capturing the sights and sounds of the era in which the film is set. Especially impressive are the scenes recreating `Hogan&apos;s Heroes,&apos; with Kurt Fuller, in particular, a standout as Werner Klemperer (Colonel Klink). It&apos;s also fascinating to see the evolution of videotape technology as portrayed in the film. How many of us knew that such equipment existed for home consumption as early as the mid-60&apos;s? \\n\\nThere&apos;s a real sadness to the final stretches of the film, made all the more poignant by having the dirge-like musical score run uninterrupted under the action. The effect is that we really get a sense of the total desolation of Crane&apos;s life at that point \\u0096 as he has lost his family, his career, and his self-respect to the master he chose early on to serve. The loss of his life seems almost de rigueur given all that has gone before. `Auto Focus&apos; is not always an easy film to watch, but for its unflinching look at an often-unappetizing subject, it deserves to be seen.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 14831, "bestRating": 10, "worstRating": 1, "ratingValue": 6.6}, "contentRating": "18", "genre": ["Biography", "Crime", "Drama"], "datePublished": "2003-03-07", "keywords": "amateur pornography,promiscuity,group sex,breasts pulled out,breast fondling", "duration": "PT1H45M", "actor": [{"name": "Greg Kinnear", "url": "https://www.imdb.com/name/nm0001427/"}, {"name": "Willem Dafoe", "url": "https://www.imdb.com/name/nm0000353/"}, {"name": "Maria Bello", "url": "https://www.imdb.com/name/nm0004742/"}], "director": [{"name": "Paul Schrader", "url": "https://www.imdb.com/name/nm0001707/"}], "creator": [{"name": "Robert Graysmith", "url": "https://www.imdb.com/name/nm1172196/"}, {"name": "Michael Gerbosi", "url": "https://www.imdb.com/name/nm1069184/"}]}