{"type": "Movie", "name": "Eight Crazy Nights", "url": "https://www.imdb.com/tt0271263/", "poster": "https://m.media-amazon.com/images/M/MV5BMTk1NTU4NjE5OV5BMl5BanBnXkFtZTYwMTQ3OTY2._V1_.jpg", "description": "Davey Stone, an alcoholic with a criminal record, is sentenced to community service under the supervision of an elderly referee. Davey is then faced with trying to reform and abandon his bad habits.", "review": {"author": "giancarlorocks", "dateCreated": "2002-11-25", "inLanguage": "English", "heading": "A degrading animated film offering absolutely nothing...", "reviewBody": "Despite its' well intentioned theme of kindness to all, this film should have practiced what it preached and should have been kind to all by never have been being made. Banking on the popularity of the Adam Sandler brand of immature toilet humour, this animated musical/comedy/debacle is a complete blueprint of Sandler's warped and juvenile mindset. While this juvenile and unripe humour worked for perennial Sandler classics such as 'The Waterboy' and 'Happy Gilmore', as of late Sandler has deteriorated into a one-hit wonder running the same gags in premeditated recycled junk. This animated waste of crayon falls superbly in that category and heralds Sandler's career as a 'has been'. Or has it? This critic enjoys theorizing and will do so with the following statements. Just recently Sandler has attempted to diversify in the Paul Thomas Anderson film 'Punch-Drunk Love' and with all due respect - it works. And now, at the time of this writing, he will star opposite Jack Nicholson in the upcoming comedy 'Anger Management'. Therefore, we ask the question - is Adam Sandler's career really faltering? This critic thinks not, the only assumption we can make is that Sandler's name usually guarantees some green provided he is in the immature context.\n\nFurthermore, it helps if you own your production company and have 'carte blanche' over a film. Such is the case with Sandler's 'Eight Crazy Nights'. His production company Happy Madison produced the film and as a result, this truly is Adam Sandler's film. Unfortunately, it is not a crazy movie and it might have the kiddies irk a smile but for the devote Sandler fan, it will utter devastation as this film is one for the trash. The animated film incorporates characters Sandler featured in his Comic audio CD's and gives some story to the elder Whitey Duvall (voiced by Adam Sandler), a soft-spoken senior who lives with his fraternal twin sister, Eleanor. What seems to be a film centered on the animated character that looks awfully similar to the real life Adam Sandler, in reality, it is about the elder Whitey who takes in the distraught Davey Stone (also voiced by Sandler). The film happens to occur throughout the Hanukkah Holiday while we see the formulaic transformation of an inebriated and rude man undergo a major transformation under the wings of the elder man. In terms of plot and sheer fun, this movie passed through three writers (Brooks Arthur, Allen Covert and Brad Isaacs) upon a story Sandler had concerted and is an utter waste of time. The animation is simplistic and the story runs at a snail's pace. Furthermore, this film is a testament to the power of Sandler in Hollywood. Even the worst of films can be made as long as there is a star attached to it. How many times have we seen this happen? The film simply seems like a hobby Sandler had and he incorporated all of his childish and clichéd funny segments into an unfunny and boorish film.\n\nMoreover, while I appreciate his attempt in diversification, it is a major disappointment to see Sandler's mass appeal reduced to such a disenchanted status in terms of the comedic abilities that made him what he is. It would be an overstatement to suggest avoiding this film at all costs. While I did not expect a great film, I at least expected a film that would place me in the Holiday spirit. Not even that expectation was accomplished. On a final note, for all those Sandler fans that anticipate the third version of his famous Hanukkah song, they will have to sit through this sluggish film in order to hear the song. Trust me, it isn't worth it.\n\nGiancarlo's Rating: *", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 25503, "bestRating": 10, "worstRating": 1, "ratingValue": 5.3}, "contentRating": "12A", "genre": ["Animation", "Comedy", "Musical"], "datePublished": "2002-12-06", "keywords": "loss of parents,destruction of property,fraternal twins,song,brother sister relationship", "duration": "PT1H16M", "actor": [{"name": "Adam Sandler", "url": "https://www.imdb.com/name/nm0001191/"}, {"name": "Rob Schneider", "url": "https://www.imdb.com/name/nm0001705/"}, {"name": "Jackie Sandler", "url": "https://www.imdb.com/name/nm0864490/"}], "director": [{"name": "Seth Kearsley", "url": "https://www.imdb.com/name/nm0444054/"}], "creator": [{"name": "Brooks Arthur", "url": "https://www.imdb.com/name/nm0037738/"}, {"name": "Allen Covert", "url": "https://www.imdb.com/name/nm0184445/"}, {"name": "Brad Isaacs", "url": "https://www.imdb.com/name/nm0410533/"}]}