{"type": "Movie", "name": "The 51st State", "url": "https://www.imdb.com/tt0227984/", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5NzU4NjEwNV5BMl5BanBnXkFtZTYwNTk4NzM3._V1_.jpg", "description": "An American master chemist plans to score big on a once in a lifetime drug deal. All does not go as planned and he is soon entangled in a web of deceit.", "review": {"author": "bob the moo", "dateCreated": "2004-05-02", "inLanguage": "English", "heading": "Fun if you are in the mood and know what to expect - Jackson is key in making it stand out from the many other modern British gangster films", "reviewBody": "Elmo McElroy is an American chemistry who has developed a new drug that is 51 times stronger, more effective and better than everything else on the market. He kills the major drug dealers in LA and heads to England to get a better deal. He arrives in England and is collected by Felix DeSouza and escorted to meet criminal Leopold Durant. However Elmo&apos;s hit on The Lizard failed and he remains keen to get hold of the drug - however the formula only exists in Elmo&apos;s head. The Lizard charges hit-woman Dakota (coincidently Felix&apos;s ex) to keep Elmo alive until The Lizard can get to him and get the formula. Meanwhile Elmo and Felix combine to try and sell the drugs.\\n\\nYet another in the treadmill of British bandwagon filmmaking, this film is, surprise surprise, a comedy British gangster movie with, wait for it, larger than life characters, funny violence and hyper-kinetic directing and editing. How very Lock Stock - things look pretty bleak from this description, except that the cast at least offers the hope that sufficient money has been poured into it to make it more than just another cheap cash-in on the success of Guy Ritchie&apos;s films. From the start it is obvious that this film is going to be more about energy than anything else and, to prove this, it then quickly edits it&apos;s way into a plot that relies more on forward motion and coincidence than anything else. The story is nonsense throughout and at times I found it a little irritating that so little attention was paid to the plot - but in fairness, to make a big deal out of that is to miss the point.\\n\\nThis is because the film is all about style, humour and pace and not about character or plotting. In this regard it is an enjoyable ride, albeit a silly and energetic one. The hyper directing from Yu really suits this and he does well even if he is not really very original in regards his shots etc. The editing fits with the formula set by Ritchie and is pretty much what you expect. What makes the film stand out from the rest of the copies is that it actually is quite good fun to watch (as opposed to some copies that are just cheap and nasty) - never hilarious but it is energetic enough to pull you along with it no matter how silly it gets. Of course it has weak points - a few characters are too daft and, whenever the overall plot is the main focus then it struggles.\\n\\nDespite this the cast do well to keep things moving and they play a massive part in making this work. Jackson may not be doing anything new or wonderful here but he is key to the film working and he is worth every penny they must have paid him. He has great presence and he brings a lot of fun and energy to the film in a way that his lesser co-stars cannot. Carlyle is a good actor but he pales in comparison to Jackson in this - he isn&apos;t helped by the awful accent he is lumbered with and the fact that he is a little irritating. Mortimer is annoying as her character is just daft in the context of the plot, but not as annoying as Meatloaf who is easily the worst thing in the film. The support cast includes reasonable turns from Pertwee, Ifans, Tomlinson and Barber but this is Jackson&apos;s film 100% and it is difficult to imagine it being as enjoyable without him.\\n\\nOverall, we all know what to expect - this is yet another gangster film in the mould of Lock Stock. In that regard it isn&apos;t original and it is, frankly, a mess in regards character and plotting. However it moves fast, is slick, clearly had a bit of cash thrown at it and, apart from a handful of stupidly silly moments, is actually quite fun to watch - even if it is almost instantly forgettable. The cast includes quite a few well-known faces but it is the awesome presence of Jackson (who looks like he is enjoying himself in an undemanding role) that makes this worth seeing.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 50769, "bestRating": 10, "worstRating": 1, "ratingValue": 6.3}, "contentRating": "18", "genre": ["Action", "Comedy", "Crime"], "datePublished": "2001-12-07", "keywords": "fictional drug,chemist,liverpool,drugs,prologue", "duration": "PT1H33M", "actor": [{"name": "Samuel L. Jackson", "url": "https://www.imdb.com/name/nm0000168/"}, {"name": "Robert Carlyle", "url": "https://www.imdb.com/name/nm0001015/"}, {"name": "Emily Mortimer", "url": "https://www.imdb.com/name/nm0607865/"}], "director": [{"name": "Ronny Yu", "url": "https://www.imdb.com/name/nm0950553/"}], "creator": [{"name": "Stel Pavlou", "url": "https://www.imdb.com/name/nm0667770/"}]}