{"type": "Movie", "name": "Halloween: Resurrection", "url": "https://www.imdb.com/tt0220506/", "poster": "https://m.media-amazon.com/images/M/MV5BODczZDMxNTMtZDIxOC00YWEzLWJkMmEtZjczNGUwZDA2NTNhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "description": "Three years after he last terrorized his sister, Michael Myers confronts her again, before traveling to Haddonfield to deal with the cast and crew of a reality show which is being broadcast from his old home.", "review": {"author": "SnoopyStyle", "dateCreated": "2016-04-16", "inLanguage": "English", "heading": "Jamie Lee Curtis returns for the pay in fifteen minute opening", "reviewBody": "Laurie Strode (Jamie Lee Curtis) is catatonic locked in an asylum after the last encounter with Michael Myers. She is faking it and he is still after her. He stabs her in the back and sends her off the roof. Sara Moyer (Bianca Kajlich), Rudy Grimes (Sean Patrick Thomas) and Jen Danzig (Katee Sackhoff) are friends studying in Haddonfield University. Jen signs them up for a reality show at the Myers house. They are joined by Bill Woodlake (Thomas Ian Nicholas), Donna Chang, and Jim Morgan in the show run by Freddie Harris (Busta Rhymes) and Nora Winston (Tyra Banks). Myles Barton is in a chatroom relationship with Sara. Unknown to them, the six reality TV guests are locked in the house with Michael Myers.\\n\\nDespite any possible retcon, the first fifteen minutes are still the best part of this movie. Jamie Lee Curtis is Halloween every bit as much as Michael Myers. The rest is something else. Whatever it is, it&apos;s not Halloween. The reality TV idea is annoying and it gets worst with the intermittent reality TV camera work. I like a few of the actors, but Tyra Banks and Busta Rhymes really lower the likability factor. It&apos;s so bad that I am more interested in everybody getting killed. I don&apos;t care if any of them survive.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 4}}, "rating": {"ratingCount": 48911, "bestRating": 10, "worstRating": 1, "ratingValue": 3.9}, "contentRating": "15", "genre": ["Horror", "Thriller"], "datePublished": "2002-10-25", "keywords": "michael myers,halloween,michael myers character,murder spree,horror icon", "duration": "PT1H29M", "actor": [{"name": "Jamie Lee Curtis", "url": "https://www.imdb.com/name/nm0000130/"}, {"name": "Busta Rhymes", "url": "https://www.imdb.com/name/nm0005354/"}, {"name": "Brad Loree", "url": "https://www.imdb.com/name/nm0520562/"}], "director": [{"name": "Rick Rosenthal", "url": "https://www.imdb.com/name/nm0742819/"}], "creator": [{"name": "Debra Hill", "url": "https://www.imdb.com/name/nm0384185/"}, {"name": "John Carpenter", "url": "https://www.imdb.com/name/nm0000118/"}, {"name": "Larry Brand", "url": "https://www.imdb.com/name/nm0104487/"}]}