{"type": "Movie", "name": "Hysterical Blindness", "url": "https://www.imdb.com/tt0290664/", "poster": "https://m.media-amazon.com/images/M/MV5BZDBhZWFhM2ItNWM3MC00ODc5LThhMzQtNTU2ZTg4NDE1NmIyXkEyXkFqcGdeQXVyMzU4ODM5Nw@@._V1_.jpg", "description": "Two friends lament their unhappy single lives while searching for Mr. Right in 1980s New Jersey.", "genre": ["Drama"], "contentRating": "TV-MA", "datePublished": "2002-08-21", "duration": "PT1H39M", "keywords": "looking at oneself in a mirror,crying woman,imaginary boyfriend,billiard cue,billiard table", "rating": {"ratingCount": 3387, "bestRating": 10, "worstRating": 1, "ratingValue": 6.5}, "review": {"author": "turtlewax182", "dateCreated": "2002-08-26", "inLanguage": "English", "heading": "Nicely Done", "reviewBody": "I enjoyed this movie because it was REAL. Hollywood too often sugarcoat characters and their experiences, almost to the point that it makes you want to puke because you know real life never turns out that peachy. This ending wasn't exactly a happy one, all the problems weren't solved and you're left to imagine what went on afterwards. Nobody fell madly in love and got married like some fairy tale... that was refreshing. Splendid job by the actors, I love Juliette Lewis, and she was her usual charming self.\n\nMy only complaint, is why was Deb so.... frustrating? I found myself asking, 'Why is she being so difficult? Why doesn't she open her eyes and see what's going on? Does she really think Rick would want anything to do with a girl he picked up from a bar and had a one night stand with?' And so forth. SHE'S the one putting HERSELF in these ridiculous and tragic situations. Halfway through the movie I just got so tired of her endless cynicism. Miss Thurman was terrific, don't get me wrong, but the character irritated me somewhat, maybe that was just me.\n\nOther than that, I think this is one of the best HBO films so far. They really have a knack for bringing real life to the screen, I'm hardly ever disappointed. Quite a few women can probably relate to one of the characters or at least seen themselves, at one time, in their predicaments. I mean, we all want to find true love... but make sure you're looking in the right place! 7/10.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 7}}, "actor": [{"name": "Uma Thurman", "url": "https://www.imdb.com/name/nm0000235/"}, {"name": "Juliette Lewis", "url": "https://www.imdb.com/name/nm0000496/"}, {"name": "Gena Rowlands", "url": "https://www.imdb.com/name/nm0001687/"}], "director": [{"name": "Mira Nair", "url": "https://www.imdb.com/name/nm0619762/"}], "creator": [{"name": "Laura Cahill", "url": "https://www.imdb.com/name/nm0128680/"}]}