{"type": "Movie", "name": "Minority Report", "url": "https://www.imdb.com/tt0181689/", "poster": "https://m.media-amazon.com/images/M/MV5BZTI3YzZjZjEtMDdjOC00OWVjLTk0YmYtYzI2MGMwZjFiMzBlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "description": "John works with the PreCrime police which stop crimes before they take place, with the help of three 'PreCogs' who can foresee crimes. Events ensue when John finds himself framed for a future murder.", "review": {"author": "SnoopyStyle", "dateCreated": "2014-05-25", "inLanguage": "English", "heading": "Amazing concept well made by master filmmaker", "reviewBody": "It's 2054. Crime has been virtually eliminated from Washington D.C. area due to the Department of Precrime. They use three Pre-cogs to predict future crimes and arrest the criminals before any crime actually happens. John Anderton (Tom Cruise) investigates the precrimes. However one day, the Pre-Cogs predict that Anderton will murder and the system is now coming after him. He kidnaps the most powerful pre-cog Agatha (Samantha Morton) and discovers a flaw in the system. Federal agent Danny Witwer (Colin Farrell) is on the manhunt as Anderton tries to prove he's innocent of a crime he's yet to commit.\n\nThe concept of free will vs determinism from Philip K. Dick is amazing. The production from Steven Spielberg is terrific. The movie is so well made that it maintains its tension with all the crazy ideas being thrown at the audience. Tom Cruise is the perfect protagonist for this movie. He has a touch of that boy scout with a dark edge. He matches the intensity of the material. There is a good mystery, compelling performances, and expertly made all growing out of a great story. It does wrap up a little too neatly. I'm not sure a Spielberg movie could have gone that dark.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 8}}, "rating": {"ratingCount": 580449, "bestRating": 10, "worstRating": 1, "ratingValue": 7.6}, "contentRating": "12", "genre": ["Action", "Crime", "Mystery"], "datePublished": "2002-07-04", "keywords": "year 2054,future noir,neo noir,reference to virtual reality,washington d.c.", "duration": "PT2H25M", "actor": [{"name": "Tom Cruise", "url": "https://www.imdb.com/name/nm0000129/"}, {"name": "Colin Farrell", "url": "https://www.imdb.com/name/nm0268199/"}, {"name": "Samantha Morton", "url": "https://www.imdb.com/name/nm0608090/"}], "director": [{"name": "Steven Spielberg", "url": "https://www.imdb.com/name/nm0000229/"}], "creator": [{"name": "Scott Frank", "url": "https://www.imdb.com/name/nm0291082/"}, {"name": "Jon Cohen", "url": "https://www.imdb.com/name/nm0169509/"}, {"name": "Philip K. Dick", "url": "https://www.imdb.com/name/nm0001140/"}]}