{"type": "Movie", "name": "Narc", "url": "https://www.imdb.com/tt0272207/", "poster": "https://m.media-amazon.com/images/M/MV5BYjVhMWI2ZjgtNzNiNy00Mjc2LTljZDQtNGYwMzYwMTlhZGFhXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg", "description": "When the trail goes cold on a murder investigation of a policeman an undercover narcotics officer is lured back to the force to help solve the case.", "review": {"author": "bob the moo", "dateCreated": "2004-02-16", "inLanguage": "English", "heading": "A really atmospheric and enjoyable thriller", "reviewBody": "Over a year after he was suspended during an investigation into a shooting when he was undercover, Nick Tellis is given an opportunity to redeem himself by joining an investigation into the murder of another undercover cop who's partner is a suspect. Nick and Henry Oak team up, investigating each other as much as the actual murder. They follow a lead from a junkie but begin to uncover clues that point to police weapons getting onto the black market and the suggestion that someone within the Detroit force is in bed with the junkies.\n\nA small film with big budget problems gets picked up at Sundance and has Tom Cruise's name added to it as executive producer. Thank goodness that this film got bought up and received a bigger audience. It is a shame that more people didn't go and see it but it still isn't bad for a film that was almost shutdown mid-shoot due to budget problems (ie, they didn't have any!). The plot is a good cop thriller in the mould of the old 70's thrillers where the lines between good/bad, right/wrong are pretty blurred. The focus of the film is the mcguffin of the tunnel - what happened, who did what? but the film is much more than that, it has themes of family and scenes of violence and tension that move everything forward. It is easily one of the best films released in 2003. It manages to take a genre that is seen so often and make it feel fresh and enjoyable.\n\nAs both writer and director Carnahan is brilliant. His script is well written and has plenty of tough dialogue but it is the feel and look of the film that is brilliant. On top of the toning used to taint each scene (the job is mostly washed out blues, family scenes are reds but gradually lose their taint over the film) the film uses other tricks. The framing of shots are different for each character and it really adds to the film. If you like this film it is worth hunting out the DVD just for the extras, Carnahan talks in detail about the reasons behind the composition of some shots and it is impressive to hear and understand his thought process.\n\nThe cast are excellent, although really the film hinges on the two leads. Liotta is as good as he has ever been. It would be easy to just accept his performance as a `powerhouse' but it also has sensitivity, emotion and layers to it. Patric is also good, his themes with family and past are brought up well in a performance that accepts that he is very much secondary to Liotta. Support from Busta Rhymes is minor but he plays it very well, not at all like many hip hop stars who do movies to enhance their bling-bling gangsta personae. There are other solid support roles too, but it really is Liotta and Patric's film.\n\nAs a cop thriller this harks back to darker days and it is very effective, with a solid plot and a good sense of the unknown until some solid twists near the end. The film has an impressive style to it and, while Liotta deserves the praise, the success and feel of this film are down to the skills of Carnahan as both writer and director. With his talented and underpaid crew he has turned a good script into a great film.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 42903, "bestRating": 10, "worstRating": 1, "ratingValue": 7.1}, "contentRating": "18", "genre": ["Crime", "Drama", "Mystery"], "datePublished": "2003-02-07", "keywords": "suspended cop,investigation,police investigation,murder investigation,held at gunpoint", "duration": "PT1H45M", "actor": [{"name": "Ray Liotta", "url": "https://www.imdb.com/name/nm0000501/"}, {"name": "Jason Patric", "url": "https://www.imdb.com/name/nm0000574/"}, {"name": "Chi McBride", "url": "https://www.imdb.com/name/nm0564277/"}], "director": [{"name": "Joe Carnahan", "url": "https://www.imdb.com/name/nm0138620/"}], "creator": [{"name": "Joe Carnahan", "url": "https://www.imdb.com/name/nm0138620/"}]}