{"type": "Movie", "name": "Personal Velocity: Three Portraits", "url": "https://www.imdb.com/tt0295238/", "poster": "https://m.media-amazon.com/images/M/MV5BMzMwMDVkNDYtMWQ0MC00MTQ2LWE0NWUtNmE5ZGVjNGY3ZGJjXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg", "description": "Three women's escapes from their afflicted lives. Each struggles to flee from the men who confine their personal freedom.", "review": {"author": "uberchick", "dateCreated": "2002-05-10", "inLanguage": "English", "heading": "An Intimate Thread", "reviewBody": "I saw this film tonight at the First Annual Tribeca Film Festival and understood its success at Sundance. In short, this film is about the awakening of three different women in very different lives and circle around a news report of a shooting in Manhattan and an ensuing car accident. With the telling of each woman's tale, Miller uses a brilliant 'degree of relation' to the accident in order to develop an engaging and powerful film.\n\nDelia casually watches the news report of the accident while waiting for the cook to bring up her next order in a small-town diner in upstate New York. Though the audience does not see a particularly unusual response that she has to it, we can imagine that her difficult circumstances allow her to relate to it on a level of shared human suffering.\n\nGreta, who's story is told in a series of flashbacks, watches it on the morning news minutes before she has her epiphany about her failing marriage and the new turn that her life is taking as a prominent editor for a large Manhattan publishing house. Because it is the only scene in her story that takes place in the present time, the audience is left to wonder what sort of pivotal role the news report has played in her epiphany.\n\nFinally, Paula's story brings the accident close to home as she is a witness to it. Her epiphany was a direct result of the accident since it was a near-death experience for her. She's not only shocked from the impact of it, but her struggle to explain it with cosmic signs allows her to transcend the accident and the events following it.\n\nThe performances were real, the direction was brilliant, and the common thread that ran through the intimate details of the women's awakenings flowed easily, despite the segmented telling of their tales. Miller's work in this film has inspired me to seek out her feature debut, _Angela_ as well.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 3902, "bestRating": 10, "worstRating": 1, "ratingValue": 6.5}, "contentRating": "15", "genre": ["Drama", "Romance"], "datePublished": "2003-03-28", "keywords": "abusive husband,hand job,three stories,female nudity,female topless nudity", "duration": "PT1H26M", "actor": [{"name": "Kyra Sedgwick", "url": "https://www.imdb.com/name/nm0001718/"}, {"name": "Parker Posey", "url": "https://www.imdb.com/name/nm0000205/"}, {"name": "Fairuza Balk", "url": "https://www.imdb.com/name/nm0000103/"}], "director": [{"name": "Rebecca Miller", "url": "https://www.imdb.com/name/nm0589182/"}], "creator": [{"name": "Rebecca Miller", "url": "https://www.imdb.com/name/nm0589182/"}]}