{"type": "Movie", "name": "Return to the Land of Wonders", "url": "https://www.imdb.com/tt0461832/", "poster": "https://m.media-amazon.com/images/M/MV5BNTU3NGIyMjQtY2M1NC00OTU2LWJiMjctYzNlMzYzYjUxNmU4XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg", "description": "Moving between the political sphere and everyday life on the streets, this film offers a unique glimpse into the resilience of Iraqis as they struggle to sustain their lives and to fight off a sense of despair and defeat.", "review": {"author": "tnrcooper", "dateCreated": "2007-08-07", "inLanguage": "English", "heading": "Interesting trip to Iraq", "reviewBody": "Wow, I&apos;m also a bit surprised there are so few comments about this movie. Not that it&apos;s Shrek or anything but still, I would have expected maybe 10. That might say more the US in the last 6.5 years than any politician could say in a half-hour stump speech. Anyway, I&apos;m not trying to bash anyone, but I do think it&apos;s a sad reflection on civic involvement in the United States and why it&apos;s enmeshed in such a terrible occupation in Iraq. \\n\\nThis film would be instructive for many in simply showing Iraq on its quiet (or at least relatively quiet days). People in this country seem to forget-and some don&apos;t even believe- that Iraqis sweat, cry, eat, love, breathe, and lust like their brethren and sisters in the United States. The movie is directed by a lady named Maysoon Pachachi, an Iraqi ex-pat whose father is Adnan Pachachi, a former foreign minister and a member of the Iraqi Governing Council during the American occupation of the country. He is featured prominently in the film. Mrs. Pachachi was educated overseas and has been a filmmaker and educator in the United States and the United Kingdom for some years. \\n\\nThe purpose of the film is to reveal a small sliver of a quotidien Iraq. The film was made in late 2003 and early 2004, I believe. Reportedly, Adnan Pachachi was offered the Presidency in 2004 but refused on the grounds that he did not wish to be seen as an American patsy, as he says in the film. The country was not particularly stable at that point, but it was better than it is now. It is fascinating seeing Iraq as.....you know.......a country.......which I would love to visit but probably will not be able to plausibly until my dotage. Pachachi of course speaks Arabic which allows her to get around easily. She interviews children in hospitals suffering from the dearth of Iraqi doctors. They succumb to illnesses which would not prevail in many First World countries as a matter of course but darling children are poe-faced and defiant in the face of the camera. They are adorable of course and one wonders whether they are still alive. There is one interview with a girl who turns out only to be 17 but her bearing suggest an older age. However, looking into Iraqis&apos; eyes, seeing their determination- particularly that of teachers who have taught from an unchanging curriculum for 16 years now. And yet the optimism and goodwill and hopes which the teachers continue to reveal is truly inspiring. For the same reason, given the hopelessness in Iraq now, their optimism is heartbreaking. That said, it is wonderful to see Iraqi people in their day-to-day environment, seeing tourist sites, such as the world&apos;s third tallest brick overhang. The security guard there laments its destruction, caused by the frequent sonic booms coming from US fighter jets. The effect of the war is noticeable at many points, including shots of Apache helicopters transporting goods to different places. \\n\\nIn some ways, the movie is a very unusual homecoming video as we meet some of Pachachi&apos;s childhood friends and we get to know them. The most valuable part of this movie though, as said is the fact that we see Iraqis doing normal things. We see Iraqis as people. They are resilient, witty, and generous and seeing the country as a modern country populated by...you know....regular people brings home the tragedy of what is happening there and the decency of the people.\\n\\nTechnically or stylistically, there is nothing much to say about the film. I think that is beside the point. It should be important for people to see a movie about such a put upon people.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 10}}, "rating": {"ratingCount": 44, "bestRating": 10, "worstRating": 1, "ratingValue": 6.9}, "contentRating": null, "genre": ["Documentary", "War"], "datePublished": "2004-04-27", "keywords": "iraq war,iraq,baghdad iraq,refugee,middle east", "duration": "PT1H28M", "actor": [], "director": [{"name": "Maysoon Pachachi", "url": "https://www.imdb.com/name/nm0655224/"}], "creator": []}