{"type": "Movie", "name": "Road to Perdition", "url": "https://www.imdb.com/tt0257044/", "poster": "https://m.media-amazon.com/images/M/MV5BNjcxMmQ0MmItYTkzYy00MmUyLTlhOTQtMmJmNjE3MDMwYjdlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg", "description": "A mob enforcer's son in 1930s Illinois witnesses a murder, forcing him and his father to take to the road, and his father down a path of redemption and revenge.", "review": {"author": "Theo Robertson", "dateCreated": "2005-11-29", "inLanguage": "English", "heading": "Great Performances Paper Over Any Minor Flaws", "reviewBody": "ROAD TO PERDITION can be summed up by Thomas Newman's score. It's haunting and beautiful but you're aware that this music is similar to Newman's other work and while listening to the soundtrack you're reminded of SCENT OF A WOMAN, MEETING JOE BLACK and THE SHAWSHANK REDEMPTION. As the Sullivans drive round America trying to escape from a psychotic hit man you think of THE GETAWAY, Irish gangsters is MILLER'S CROSSING whilst the subtext of guilt and redemption can be summed up by Coppola and Leone's gangster epics. Despite having a seen it all before feel this shouldn't be taken as a heavy criticism of Sam Mendes film which I repeat is haunting and beautiful and the only flaws that work against it is a very slow opening twenty minutes and I was slightly confused as the events that caused Michael Sullivan to be betrayed. But if you stop to consider how much of a sentimental mess Spielberg might have made with the story that revolves around a father and his twelve year old son running for their lives you can't help thinking what a superb director Mendes is. ROAD TO PERDITION is a film where the entire cast give flawless performances. I've never been all that keen on Tom Hanks but he's every bit as good here as he has been in any starring role, probably better. Paul Newman plays a character with an Irish accent but at no point did I believe I was watching an American screen legend putting on a false accent - Newman's performance works due to the subtle body language, his character is torn up by guilt but Newman never milks it or goes over the top. While never upstaging Newman who gives the best performance in the movie the two Brit supporting actors Craig and Law are also very memorable as American gangsters and while Law will still have a long career as a leading actor one wonders how Daniel Craig might have progressed as a character actor if he hadn't decided to become James Bond, a role which heralds the end of an actors career", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 8}}, "rating": {"ratingCount": 282838, "bestRating": 10, "worstRating": 1, "ratingValue": 7.7}, "contentRating": "15", "genre": ["Crime", "Drama", "Thriller"], "datePublished": "2002-09-27", "keywords": "based on comic book, dog, bicycle, assassin, murder", "duration": "PT1H57M", "actor": [{"name": "Tom Hanks", "url": "https://www.imdb.com/name/nm0000158/"}, {"name": "Tyler Hoechlin", "url": "https://www.imdb.com/name/nm0388382/"}, {"name": "Paul Newman", "url": "https://www.imdb.com/name/nm0000056/"}], "director": [{"name": "Sam Mendes", "url": "https://www.imdb.com/name/nm0005222/"}], "creator": [{"name": "Max Allan Collins", "url": "https://www.imdb.com/name/nm0172523/"}, {"name": "Richard Piers Rayner", "url": "https://www.imdb.com/name/nm0713479/"}, {"name": "David Self", "url": "https://www.imdb.com/name/nm0783100/"}]}