{"type": "Movie", "name": "The Country Bears", "url": "https://www.imdb.com/tt0276033/", "poster": "https://m.media-amazon.com/images/M/MV5BMTk0ODU4NDUwOF5BMl5BanBnXkFtZTYwNTI0MTk2._V1_.jpg", "description": "Beary Barrington goes on an adventure to save Country Bear Hall by getting the Country Bears back together for a reunion concert.", "contentRating": "U", "genre": ["Comedy", "Family", "Music"], "datePublished": "2003-06-20", "keywords": "country music,car wash,police,anthropomorphic bear,slimehouse", "duration": "PT1H28M", "actor": [{"name": "Haley Joel Osment", "url": "https://www.imdb.com/name/nm0005286/"}, {"name": "Diedrich Bader", "url": "https://www.imdb.com/name/nm0046033/"}, {"name": "Candy Ford", "url": "https://www.imdb.com/name/nm1007015/"}], "director": [{"name": "Peter Hastings", "url": "https://www.imdb.com/name/nm0368614/"}], "creator": [{"name": "Mark Perez", "url": "https://www.imdb.com/name/nm0991423/"}], "review": {"author": "TheLittleSongbird", "dateCreated": "2011-02-22", "inLanguage": "English", "heading": "Had its moments...", "reviewBody": "I personally do not think The Country Bears is that great, but I also don't think it is that bad either. I can think of worse movies that have a higher rating, but I can also think of better movies too. The Country Bears may have a lot of faults, that I agree, it does have its good points.\n\nLet's start with the good points shall we? First and foremost, Christopher Walken seems to be really enjoying himself as the villain of the piece, he is deliciously theatrical and really breathes life into any shortcomings the film has. The soundtrack is also great, country-and-western music I can take or leave but it was used and performed very well here. Most of the cameos are pretty entertaining, it was nice to see Elton John, Willie Nelson and Queen Latifah, while the production values are good, Haley Joel Osment is appealing and the country bears of the title are convincingly played.\n\nHowever, the film does have its shortcomings, starting with the length. The film is too short, and could have been longer with a little more detail to plot. I didn't mind the plot was simple, some of my favourite films have simple stories, but it is a predictable and rushed one with an ending you can smell a mile off. The script is also rather weak likewise with the jokes some of which were embarrassing(1812 Overture played with the arm-pits, what next?), the film is rushed I think and the direction is sloppy.\n\nSo overall, The Country Bears had its moments, and it is much better than the trailer which was embarrassing, but it wasn't enough to sustain into a good enough film. 5/10 Bethany Cox", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 5}}, "rating": {"ratingCount": 6075, "bestRating": 10, "worstRating": 1, "ratingValue": 4.2}}