{"type": "Movie", "name": "We Were Soldiers", "url": "https://www.imdb.com/tt0277434/", "poster": "https://m.media-amazon.com/images/M/MV5BZTk3NTc4MTktNjFmZC00ZjdjLWE0ZjgtNTM4NzdmMDBjOTcxXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_.jpg", "description": "The story of the first major battle of the American phase of the Vietnam War, and the soldiers on both sides that fought it, while their wives wait nervously and anxiously at home for the good news or the bad news.", "contentRating": "15", "genre": ["Action", "Drama", "History"], "datePublished": "2002-03-08", "keywords": "battle,soldier,vietnam war,helicopter,reporter", "duration": "PT2H18M", "actor": [{"name": "Mel Gibson", "url": "https://www.imdb.com/name/nm0000154/"}, {"name": "Madeleine Stowe", "url": "https://www.imdb.com/name/nm0000656/"}, {"name": "Greg Kinnear", "url": "https://www.imdb.com/name/nm0001427/"}], "director": [{"name": "Randall Wallace", "url": "https://www.imdb.com/name/nm0908824/"}], "creator": [{"name": "Harold G. Moore", "url": "https://www.imdb.com/name/nm1051840/"}, {"name": "Joseph Lee Galloway", "url": "https://www.imdb.com/name/nm1051826/"}, {"name": "Randall Wallace", "url": "https://www.imdb.com/name/nm0908824/"}], "review": {"author": "ggraziano", "dateCreated": "2003-06-16", "inLanguage": "English", "heading": "Mixed feelings", "reviewBody": "We Were Soldiers is not for the squeamish. It ranks up there with Saving Private Ryan for realistically showing the brutality of war. I was moved almost beyond description by the ordeal these 390-odd US Army Air Cav soldiers endured at the hands of thousands of Viet Cong troops. It is as close to Hell as one could get on earth--a charnel house of horrors, where death is sudden and swift. Mel Gibson and Sam Elliot lead a group of green recruits into the Valley Of Death on an impossible mission in the early days of our involvement in Vietnam.\\n\\nBased on actual events in 1965, this was the first major involvement of US troops and North Vietnamese regulars. The writing, directing, and acting are first rate, and the battle scenes are too real for comfort. What really makes the mind reel is that after the slaughter depicted in this film, Mel&apos;s character Lt. Col. Hal Moore goes back to the valley of death for more than 200 days. The American dead are listed on 3 East of the Vietnam Memorial Wall. I stood at attention and cried when the names of the fallen were listed at the end of the film. You will, too.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 150324, "bestRating": 10, "worstRating": 1, "ratingValue": 7.2}}