{
  "type": "Movie",
  "name": "Rise of the Planet of the Apes",
  "url": "https://www.imdb.com/tt1318514/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzE3ZmNlZTctMDdmNy00MjMzLWFmZmYtN2M5N2YyYTQ1ZDJjXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
  "description": "A substance designed to help the brain repair itself gives advanced intelligence to a chimpanzee who leads an ape uprising.",
  "review": {
    "author": "Dragonsouls",
    "dateCreated": "2011-08-05",
    "inLanguage": "English",
    "heading": "The most emotional Planet of the Apes film.",
    "reviewBody": "To sum it up, a very powerful film falling just short of being a masterpiece. However, the only flaw in the film is that the film could have been just a bit longer! I am really hoping for a director&apos;s cut because there should have been a few more character development scenes between father and son, boyfriend and girlfriend, and even Ape and Human. I felt the movie was paced a bit too quickly but nevertheless, still contains very fleshed out characters driven by excellent performances throughout, from Lithgow, to Franco, to Cox and especially by Andy Serkis.\n\nCesar is by far the best animated character in the history of cinema. His facial expressions tell it all! You feel his rage, his fear, and his child like innocence through his wonderfully animated eyes. Not only is the C.G.I. good, but the character is written very well in general. You will go through all of those emotions yourself as you witness his journey. All I can say is that I now know why I try to walk my dog without a leash as much as possible. This movie just confirmed it for me! Through the film, you will understand what Cesar is feeling and why. The invisible character of the film is humanity itself, and at times, feels like a study of human nature.\n\nPlot wise, it is very well told. I thought there was nothing cheesy about the script, although not as intelligent as the original, but not dumb either. There is some science fiction in the film, and other than the experimental drug, there was some other surprising Science fiction plot elements in it too which might lead into the sequel; if there is one of course, and I think there will be.\n\nFor the skeptics who think the film would be cheesy seeing all the apes battle armed policemen then think again. I too, was a bit skeptical at first, wondering how the apes would defeat an entire police force, but when you watch the film your doubts would dissipate. Just remember the physical ability of apes and how powerful the apes are, and how much more powerful they would be if they had brains! The action was very good, but as good as it was, I&apos;d trade it in for more plot development. There were a bit too many plot jumps in the last 30 minutes, but all in all, it was directed very, very well. Coupled with a good score, mellow at times, but highly dramatic which heightens the tension. Speaking of tension, there is a lot of it in this film. If you&apos;re an animal lover like I am, then be warned; You will be in tears 30 seconds into the opening scene.\n\nI also wanted to mention the original film even though it&apos;s tough to compare the two. This is an origins story that actually makes the original better. The original was more about the plot than the characters and they each stand apart and alone with their own merits and flaws. It was nice to see a few homages to the old classic, and don&apos;t be surprised if you see a character from the original as well. I highly doubt this film will disappoint the fans of the original and TV series! It will have you climbing trees!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 551917,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.6
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Drama",
    "Sci-Fi"
  ],
  "datePublished": "2011-08-11",
  "keywords": "ape,planet of the apes,chimpanzee,animal cruelty,alzheimer&apos;s disease",
  "duration": "PT1H45M",
  "actor": [
    {
      "name": "James Franco",
      "url": "https://www.imdb.com/name/nm0290556/"
    },
    {
      "name": "Andy Serkis",
      "url": "https://www.imdb.com/name/nm0785227/"
    },
    {
      "name": "Freida Pinto",
      "url": "https://www.imdb.com/name/nm2951768/"
    }
  ],
  "director": [
    {
      "name": "Rupert Wyatt",
      "url": "https://www.imdb.com/name/nm1012501/"
    }
  ],
  "creator": [
    {
      "name": "Rick Jaffa",
      "url": "https://www.imdb.com/name/nm0415425/"
    },
    {
      "name": "Amanda Silver",
      "url": "https://www.imdb.com/name/nm0798646/"
    },
    {
      "name": "Pierre Boulle",
      "url": "https://www.imdb.com/name/nm0099541/"
    }
  ]
}