{
  "type": "Movie",
  "name": "The Whale",
  "url": "https://www.imdb.com/tt13833688/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZDQ4Njg4YTctNGZkYi00NWU1LWI4OTYtNmNjOWMyMjI1NWYzXkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_.jpg",
  "description": "A reclusive, morbidly obese English teacher attempts to reconnect with his estranged teenage daughter.",
  "review": {
    "author": "javiergarcon",
    "dateCreated": "2023-08-15",
    "inLanguage": "English",
    "heading": "I was 400lbs so I know exactly how it feels",
    "reviewBody": "I recomend this movie and authorize it as factual from my life standpoint. The doctors told me I only had 5 to 10 years left in me. It was suggested that Bariatric surgury is the only way things will change. Since December 27th, 2022, 6 months later, I am 220lbs. I have had diabetes. I no longer have diabetes since I changed my diet. I never knew how disgusting I was or how much food I ate in one day because the chemicals in the High Fructose Corn Syrup that soda contained were causing my addiction to drinking more soda. My house was filled with garbage on the ground, and I couldn&apos;t even wipe myself or turn around; I couldn&apos;t even fit in the car that well to drive.\n\nI only drove my car to the doctor and had the groceries delivered. Watching these academy award winners on the big screen affected me emotionally because it reflected my life. It destroys me, showing my life from a different perspective. This is as real as it gets people; this exists, and this story has no fiction in it. My issues were PTSD, X&apos;s wife, and her taking my children away. My children are older now, and we are getting reconnected. I do not blame anyone else for my problems, only me. I cried when the Xwife wanted to hear his heart and lungs; that scene hit home and affected me in many ways. What about my daughter? Well, it&apos;s not been easy, she doesn&apos;t talk much to me, and I am only in her life when she needs something; like Fraiser, I saved up all the money for her.\n\nThank you for reading my review, The doctors now say that I might reach 90 now because of all the changes I made and hopefully I will witness a few grandchildren along the way. I am alive today because I made the choice to live. It was hard to make that choice because psychologically I didnt believe anything was wrong with me even though I was deathly ill. Makes me think.... Am I creating my own life simulation? AmI still deathly ill even though I am healthy again? How much do we take our lives for granted?",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 197448,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "15",
  "genre": [
    "Drama"
  ],
  "datePublished": "2023-02-03",
  "keywords": "gay,overweight man,religion,caregiver,congestive heart failure",
  "duration": "PT1H57M",
  "actor": [
    {
      "name": "Brendan Fraser",
      "url": "https://www.imdb.com/name/nm0000409/"
    },
    {
      "name": "Sadie Sink",
      "url": "https://www.imdb.com/name/nm5584750/"
    },
    {
      "name": "Ty Simpkins",
      "url": "https://www.imdb.com/name/nm1339223/"
    }
  ],
  "director": [
    {
      "name": "Darren Aronofsky",
      "url": "https://www.imdb.com/name/nm0004716/"
    }
  ],
  "creator": [
    {
      "name": "Samuel D. Hunter",
      "url": "https://www.imdb.com/name/nm5926708/"
    }
  ]
}