

{
  "type": "Movie",
  "name": "A Love Song for Bobby Long",
  "url": "https://www.imdb.com/tt0369672/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOGEyZDhlYTUtYTdmMS00NDVhLThiZWItMDIyYjRlZDYzODgxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "A headstrong young woman returns to New Orleans after the death of her estranged mother.",
  "review": {
    "author": "gradyharp",
    "dateCreated": "2005-04-20",
    "inLanguage": "English",
    "heading": "Broken Hopes and Broken Lives: A Study of New Orleans",
    "reviewBody": "For those who have read Ronald Everett Capps&apos; novel &apos;Off Magazine Street&apos; and savor the slow, lugubrious, decadent pattern of life in the poor section of New Orleans, then Screenwriter/Director Shainee Gabel&apos;s transformation of those ideas into A LOVE SONG FOR BOBBY LONG will certainly satisfy. Though Gabel has manipulated characters names and identification to fit her sensitive interpretation of Capps&apos; story into a visual manifestation, the changes are sound and serve to make this remarkably fine low budget film a humid, alcoholically lethargic slice of New Orleans as viable as, say, Tennessee Williams. There is a captured ambiance of the South complete with decay, shanties, intermittent rain, and aimless broken lives that sets a fine stage for a rather minimal story.\\n\\nPurslane Hominy Will (Scarlett Johansson) is a young high school dropout living in trailer park trash in Florida with a low class boyfriend Lee (Clayne Crawford) when she learns of her mother Lorraine&apos;s death in New Orleans. Though she hasn&apos;t seen or heard from her obese, druggie, songwriter mother in years, she wants to attend her funeral and strikes out for New Orleans.\\n\\nArriving on the doorstep of her mother&apos;s rundown, rotting house, she discovers Bobby Long (John Travolta), an unkempt drunk who once was an English professor in a college in Alabama but fell into oblivion and alcohol when he lost his wife and family. He is living in filth with Lawson Pines (Gabriel Macht) who, as Bobby&apos;s teaching assistant whom Bobby has deemed gifted, has followed Bobby to write Bobby&apos;s biography - a work in progress that has stalemated in favor of alcoholism and disillusionment. Pursey hears that Booby and Lawson were Lorraine&apos;s closest friends (she had invited them to flop in her shabby house, entertained by their low key scholasticism and literature quoting), and that Lorraine had willed her home to the three of them.\\n\\nPursey moves in reluctantly - she has nowhere else to go - and immediately is at odds with her &apos;roommates&apos;. Likewise Bobby and Lawson resist Pursey&apos;s presence and insist she &apos;get a life&apos; by returning to high school, making use of her obvious intellect. The verbal sparing that eventually leads the three to find a sense of family lays the foundation for the predictable conclusion.\\n\\nThat is the simplicity of the tale - if it is storyline that is important to you. Gabel&apos;s distillation of Capps&apos; novel is in the atmosphere she creates with these gifted actors. Bobby may be a drunk but he is the spokesman for a neighborhood of sad broken lives. The world is confined to the street that contains the local bar, churches, and graveyards - each of varying importance but all drenched in humidity and frequent rains and alcohol and aimless living. The local bar is tended by Georgiana (Deborah Kara Unger) with whom Lawson is having a strained affair. The folk who gather at Bobby&apos;s literature-spouting soirees include gardener Cecil (Dane Rhodes), Junior (David Jensen), to mention only a few well-defined characters. That anyone could alter the ennui in the way Pursey changes things is a minor miracle.\\n\\nThe minimal music score by Grayson Capps is atmospheric as are the off-screen comments and quotations of great literature of TS Eliot, Robert Frost, WH Auden et al. The cinematography by Eliot Davis is properly claustrophobic and decadent in atmosphere. And while some feel the movie is too long for the minimal story, the length and pacing are in keeping with the traditions and the literature of the South and for this viewer it works exceedingly well.\\n\\nTravolta, Johansson, Macht, and Unger give multifaceted, highly sensitive performances. As for Shainee Gabel (whose only other film was the controversial &apos;Anthem&apos;) here is a writer and director to watch. The DVD contains some excellent deleted scenes and one of the more informative &apos;making of&apos; segments with Gabel, Travolta, Johansson, Macht, and Rhodes speaking with quiet eloquence. Highly recommended.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 27084,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "R",
  "genre": [
    "Drama"
  ],
  "datePublished": "2005-01-21",
  "keywords": "sexual tension,2000s,housemate,dilapidated house,visiting a grave",
  "duration": "PT1H59M",
  "actor": [
    {
      "name": "Scarlett Johansson",
      "url": "https://www.imdb.com/name/nm0424060/"
    },
    {
      "name": "John Travolta",
      "url": "https://www.imdb.com/name/nm0000237/"
    },
    {
      "name": "Gabriel Macht",
      "url": "https://www.imdb.com/name/nm0532683/"
    }
  ],
  "director": [
    {
      "name": "Shainee Gabel",
      "url": "https://www.imdb.com/name/nm0300015/"
    }
  ],
  "creator": [
    {
      "name": "Ronald Everett Capps",
      "url": "https://www.imdb.com/name/nm1754512/"
    },
    {
      "name": "Shainee Gabel",
      "url": "https://www.imdb.com/name/nm0300015/"
    }
  ]
}