

{
  "type": "Movie",
  "name": "How to Get the Man's Foot Outta Your Ass",
  "url": "https://www.imdb.com/tt0367790/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZGZkN2M0MjctMjNjNy00YmNlLWE5NzMtZmJjYjQ2ZmQ2ZjI3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "Mario Van Peebles' half-documentary/half-homage to his father Melvin Van Peebles' movie Sweet Sweetback's Baadasssss Song (1971).",
  "review": {
    "author": "film-critic",
    "dateCreated": "2004-09-26",
    "inLanguage": "English",
    "heading": "A Son's love for his Father",
    "reviewBody": "Ever wonder what it would be like to make your own film without a studio to support you and no money in the bank to fund it. Well, thankfully Mario Van Peebles' father forged ahead in the 70s with a dream and passion like no other. While Hollywood was content with making pictures that negatively depicted African Americans, Melvin Van Peebles decided to break this cultural norm and change the face of cinema. \\n\\nWith no budget, money from friends and drug dealers, and a non-union crew, Melvin created the impossible. He grabbed a hold of an idea and let nothing get in the way from accomplishing it. Melvin had a dream of making an African American the center of the film, one that took no sass from anyone and criticized the modern white Government. While big studios backed away from this project, Melvin jumped forward made Sweet Sweetback's Baadasssss Song. There were trial and tribulations to get it done, but thanks to a very surprising source the film became a success. It was the first independent film to become the number one film in America.\\n\\nSimilar to the passion seen in Melvin's eyes when he is making his low-budget film, Mario portrays that exact same involvement when making this low-budget film. What I loved about this film is that there is so much raw, unbridled emotion behind Mario's eyes that you can tell that he 1) loves his Dad and 2) wanted to show America the truth behind this innovator's life. This is Mario's past, and he superbly reenacts it on screen. He carries this film, showing us the many facets of his father. He shows the angry American, the independent talent, the powerful leader, and even the emotional parent. Through all of this Mario continues to keep this film focused and interesting. We cannot keep our eyes off his portrayal of his father. I would not be surprised if he is nominated for an Oscar this year.\\n\\nFinally, this is a very powerful film that speaks about a side of Hollywood that is less known. It shows how the boundaries of racism can be broken with imagination and persistence. It shows that 'all men are created equal' and that if you have a dream you should pursue it. If you are in the process of making your own film and need a movie that will inspire and motivate, this would be the film to watch. From the moment I put this film in my DVD player, I was glued. What a powerful story coupled with interesting actors (Adam West and Sally Struthers) and told with a very realistic voice.\\n\\nI highly recommend this film. \\n\\nGrade: **** out of *****",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 5146,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.3
  },
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama"
  ],
  "datePublished": "2005-06-10",
  "keywords": "homage,archive footage,film in film,movie producer,movie director",
  "duration": "PT1H49M",
  "actor": [
    {
      "name": "Mario Van Peebles",
      "url": "https://www.imdb.com/name/nm0005522/"
    },
    {
      "name": "Nia Long",
      "url": "https://www.imdb.com/name/nm0000505/"
    },
    {
      "name": "Joy Bryant",
      "url": "https://www.imdb.com/name/nm0117146/"
    }
  ],
  "director": [
    {
      "name": "Mario Van Peebles",
      "url": "https://www.imdb.com/name/nm0005522/"
    }
  ],
  "creator": [
    {
      "name": "Melvin Van Peebles",
      "url": "https://www.imdb.com/name/nm0887708/"
    },
    {
      "name": "Mario Van Peebles",
      "url": "https://www.imdb.com/name/nm0005522/"
    },
    {
      "name": "Dennis Haggerty",
      "url": "https://www.imdb.com/name/nm1380203/"
    }
  ]
}