

{
  "type": "Movie",
  "name": "Georges Bataille's Story of the Eye",
  "url": "https://www.imdb.com/tt0379797/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjQxOTIyNzc1NF5BMl5BanBnXkFtZTgwMjI0MjAwNjE@._V1_.jpg",
  "description": "In a seemingly abandoned house, a group of people engage in wordless acts of passion. From evening to morning, the sexual couplings among the members of the house become increasingly harrowing as daylight arrives.",
  "review": {
    "author": "supernewman11",
    "dateCreated": "2012-06-06",
    "inLanguage": "English",
    "heading": "How to Not Approach SofE",
    "reviewBody": "The problem with many of the reviews for this film on this site is they aren't approaching the film at its level. This is a very important thing to do. You don't go into an action film with melodrama expectations, for instance. When you watch an experimental film, that was also presented as an art installation utilizing multiple screens (not all visible from one place) playing simultaneously with their sound audible everywhere, you don't go in expecting a traditional narrative with clear character psychology and an obvious point, like we are trained to read from traditional film. Likewise, we shouldn't be going in expecting it to be a direct adaptation of Bataille's novella. Again, an experimental adaptation is nothing like a traditional adaptation. This film adapts it in transgressive intent, some generalized thematic concerns, etc. etc. Also, this isn't porn. I know that may be hard for some people to understand, but it's best to really understand what porn is and what it does to understand this. Porno, functionally, reduces to a minimum anything that gets in the way of lust, of sexual passion, of sexual gratification, etc. etc. This film does not do this, it maximizes these obtrusive elements. A fifteenish minute scene of a woman walking up stairs, the Zapruder footage, the general method of transitions between sexual encounters, these aren't building up the sexual appetite but attempting to subvert them. There is too much in way of interruption and motif for this to be a 'pornographic film'. I would also suggest reading the novella before watching this film. And that doesn't mean skim through it, or pseudo read it, taking care to only grasp the narrative structure and do little to grasp his motifs, themes, concerns, and overarching thesis. Once you understand what the book was doing and saying, or at least have an idea of what you think the book was doing and saying, you may have a better time approaching this film. The most important thing to keep in mind - it's an experimental art film, you don't approach films like this the same way you would approach blockbusters. Lastly, would people please stop putting up scene breakdowns? Not only is it reductive to the overall action, but they are also always incorrect and missing parts.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 218,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.3
  },
  "contentRating": null,
  "genre": [
    "Drama"
  ],
  "datePublished": "2003-12-12",
  "keywords": "unsimulated female masturbation,woman fingering her anus,female full frontal nudity,urinating woman,double dildo penetration",
  "duration": "PT1H21M",
  "actor": [
    {
      "name": "Melissa Elizabeth Forgione",
      "url": "https://www.imdb.com/name/nm1445404/"
    },
    {
      "name": "Querelle Haynes",
      "url": "https://www.imdb.com/name/nm1445542/"
    },
    {
      "name": "Kevin Mitchell Martin",
      "url": "https://www.imdb.com/name/nm0593509/"
    }
  ],
  "director": [
    {
      "name": "Andrew Repasky McElhinney",
      "url": "https://www.imdb.com/name/nm0568396/"
    }
  ],
  "creator": [
    {
      "name": "Georges Bataille",
      "url": "https://www.imdb.com/name/nm0060652/"
    },
    {
      "name": "Dan Buskirk",
      "url": "https://www.imdb.com/name/nm1445142/"
    },
    {
      "name": "Edward J. Eberwine III",
      "url": "https://www.imdb.com/name/nm1446561/"
    }
  ]
}