{
  "type": "Movie",
  "name": "Shaun of the Dead",
  "url": "https://www.imdb.com/tt0365748/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTg5Mjk2NDMtZTk0Ny00YTQ0LWIzYWEtMWI5MGQ0Mjg1OTNkXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
  "description": null,
  "review": {
    "author": "Damian_Piesse",
    "dateCreated": "2004-04-17",
    "inLanguage": "English",
    "heading": "Instant cult status.",
    "reviewBody": "Shaun of the Dead is quite a surprising and brilliant piece of work which I suspect will achieve the accolade of instant cult status as word of mouth snowballs this film to richly deserved recognition.\n\nSimon Pegg, both the joint writer and the main star of the film, has been a comedic force for some time, most notably in the fantastic BBC2 series &apos;Hippies&apos; (which inexplicably bombed in the ratings) and the cult Channel 4 series &apos;Spaced&apos;. Both programs hinted at Pegg&apos;s saliently dead pan comedic manner (and writing skills) which comes to full fruition in &apos;Shaun of the Dead&apos;.\n\nIn a nut shell, this film is a romantic comedy with zombies (or zom-rom-com) who appear for no good clear reason (although some tantalizing clues are offered). The film is an amazing blend of the funny, the violent and the poignant.\n\nPegg has cast himself as one hell of a serious loser in this film. And not in the &apos;American&apos; form of: &apos;I am a loser but I work in TV and have Jennifer Aniston as my wife&apos; kind of loser as portrayed in tripe such as &apos;Bruce Almighty&apos; or dozens of other US &apos;loser&apos; films. Pegg&apos;s Shaun is a genuine loser and extremely recognisable too, he&apos;s an everyday man who works for an electrical retailer and his life is just plain dull and disappointing - and this is where all the comedy comes from in this film. There are two scenes in the film which seem to summarise this (and also shine a light of Simon Pegg as a very clever and funny writer) and both scenes simply involve Shaun walking to the nearby corner shop. The first time Shaun plods semi-comatose to the store we simply get the feeling that he is a loser. However, by the time the film shows him making the same journey again we realise that there is a lot more going on! The scene is played with such exquisite subtleness that it has to be one of the funniest scenes I have ever seen in any film! Not that this film is subtle however, there is a stunning array of visual comedy, one liners and (best of all) some digs at other films from the horror genre. The funniest being a very subtle snipe at Boyles `28 days later&apos; - see if you can spot it!\n\nThe only problem with reviewing this film is that there are so many funny moments in it that it is hard to pick any to write about without spoiling the film. All I can say is that I cannot remember a film ever being this consistently funny with probably five or six serious laugh-out-loud moments. It was a joy to watch and my only disappointment is that I can never watch this film for the first time ever again - every viewing will forever be a repeat viewing.\n\nShaun of the Dead is not very everyone though - the language from the beginning is strong and the violence was quite surprising for a 15 certificate film (in the UK). This film is definitely going to be most appreciated by horror fans who know a huge back catalogue of horror films. It will also be enjoyed by teenagers (who filled the cinema when I viewed this film which was terrific, as they laughed loudest). Finally, I do have some criticism of this film and that is there is some wasted talent in the movie. Black Book&apos;s (channel four) star Dylan Moran seemed a bit wasted and so was Martin Freeman (from BBC2&apos;s The Office) - who would have made a terrific zombie! Also, did I spot Matt Lucas (from BBC3&apos;s &apos;Little Britain&apos;) in this film? I am not sure as I was laughing too hard maybe!\n\n These problems however are so minor and can easily be forgiven. My suggestion is to go and slowly shuffle down to your local cinema to see this film and give Simon Pegg the money and recognition he deserves so that he can go on and make more films that are this good including what the UK papers have suggested as his next project - `From Dusk &apos;Till Shaun&apos;.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 589629,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.9
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Horror"
  ],
  "datePublished": "2004-04-09",
  "keywords": "zombie apocalypse,pub,british horror,zombie,flesh eating zombies",
  "duration": "PT1H39M",
  "actor": [
    {
      "name": "Simon Pegg",
      "url": "https://www.imdb.com/name/nm0670408/"
    },
    {
      "name": "Nick Frost",
      "url": "https://www.imdb.com/name/nm0296545/"
    },
    {
      "name": "Kate Ashfield",
      "url": "https://www.imdb.com/name/nm0038918/"
    }
  ],
  "director": [
    {
      "name": "Edgar Wright",
      "url": "https://www.imdb.com/name/nm0942367/"
    }
  ],
  "creator": [
    {
      "name": "Simon Pegg",
      "url": "https://www.imdb.com/name/nm0670408/"
    },
    {
      "name": "Edgar Wright",
      "url": "https://www.imdb.com/name/nm0942367/"
    }
  ]
}