

{
  "type": "Movie",
  "name": "Don Jon",
  "url": "https://www.imdb.com/tt2229499/",
  "poster": "https://m.media-amazon.com/images/M/MV5BN2ZhY2IzMWQtMGU4MC00ODg2LThkNWMtNWMzYmM2OTc5ZDMyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find happiness and intimacy with his potential true love.",
  "review": {
    "author": "Michael_Elliott",
    "dateCreated": "2013-10-09",
    "inLanguage": "English",
    "heading": "One of the Most Confident Films You'll Ever See",
    "reviewBody": "Don Jon (2013) \n\n*** 1/2 (out of 4)\n\nJoseph Gordon-Levitt wrote, director and stars as Jon, a twenty-something man who loves women but what he loves even more is watching porn. He meets Barbara (Scarlett Johansson) who demands that he gives it up for her. DON JON isn't the greatest film ever made but I will say that I don't recall ever watching a movie that was so confident. Confidence is something most people lack and even most brass movies lack it but DON JON certainly isn't afraid to say what it wants to and stick by it. Having a romantic comedy that says watching porn is better than being with women and then tells you why that's the case is something incredibly rare. What's even rarer is that this type of subject is usually just played for cheap laughs but here there's a complete story wrapped around it that asks a lot of questions, gives a lot of answers and as I said, is 100% confident about itself. The confidence just really jumps off the screen unlike any movie I've ever seen and that's where the original aspect of this film comes. There have been countless movies that downplay women but this one here just does so in such a fresh and original way that you can't help but enjoy it. It also is very smart about guys, their mentality on sex and various other issues. Gordon-Levitt does a wonderful job all around but especially in the acting department. As the writer he certainly knows this character very well but it still takes a very strong performance to get that to the screen and the actor does a fabulous job. Johansson also turns in her greatest work outside of a Woody Allen picture and Tony Danza is very memorable in his supporting bit as is Glenne Headly and Julianne Moore. The screenplay is certainly dirty and covers a lot of topics but the film never crosses the offensive line. The main reason it doesn't cross the line is that it remains smart no matter what it's saying and how dirty it's being said. DON JON is certainly a refreshing film that should get one excited thinking that Gordon-Levitt could turn into someone to keep your eye on not just as an actor but as a writer and director.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 246289,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "18",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2013-11-15",
  "keywords": "sex,watching porn,husband wife relationship,pornography,older woman younger man relationship",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Joseph Gordon-Levitt",
      "url": "https://www.imdb.com/name/nm0330687/"
    },
    {
      "name": "Scarlett Johansson",
      "url": "https://www.imdb.com/name/nm0424060/"
    },
    {
      "name": "Julianne Moore",
      "url": "https://www.imdb.com/name/nm0000194/"
    }
  ],
  "director": [
    {
      "name": "Joseph Gordon-Levitt",
      "url": "https://www.imdb.com/name/nm0330687/"
    }
  ],
  "creator": [
    {
      "name": "Joseph Gordon-Levitt",
      "url": "https://www.imdb.com/name/nm0330687/"
    }
  ]
}