

{
  "type": "Movie",
  "name": "Romeo + Juliet",
  "url": "https://www.imdb.com/tt0117509/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMGU4YmI1ZGQtZjExYi00M2E0LTgyYTAtNzQ5ZmVlMTk4NzUzXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
  "description": "Shakespeare's famous play is updated to the hip modern suburb of Verona still retaining its original dialogue.",
  "datePublished": "1997-03-28",
  "duration": "PT2H",
  "contentRating": "12",
  "genre": [
    "Drama",
    "Romance"
  ],
  "keywords": "female nudity,sex scene,love,gangster,suicide",
  "rating": {
    "ratingCount": 242947,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "review": {
    "author": "starry-eyed_wanderer",
    "dateCreated": "2005-04-01",
    "inLanguage": "English",
    "heading": "Beautiful Modernization of Shakespeare's Classic Play",
    "reviewBody": "The amazing thing about this movie is that it has managed to re-do Shakespeare's famous tragedy in a modern setting while still retaining its original dialogue. What's even more amazing is it works. I admit that I was a little apprehensive about seeing this movie, fearing that Luhrman had either destroyed the play's beauty and power by setting it in modern times, or had butchered Shakespeare's eloquent words by making them sound more modern. I was wrong. Almost everything about this movie is just incredible.\\n\\nLuhrman brilliantly casted Claire Danes as fourteen-year-old Juliet. The actress certainly looks the part, with her youthful features and innocent eyes. More importantly, she acts the part. Ms. Danes almost flawlessly captures Juliet's distressing journey from childhood to womanhood, beautifully showing her dramatic transition which had taken toll on her during her five day relationship with Romeo. When the story begins, Juliet is a naive girl, having not yet experienced true love, and by the end we can clearly see just how much her love for Romeo has deepened in passion, and how dramatically her character has developed.\\n\\nLeanardo DeCaprio's Romeo was almost equally impressive. Some of his recitations of Shakespeare made me cringe, but for the most part he was perfect. One of Romeo's most important characteristics in the play is the intensity of his emotions, and DeCaprio captures this feature incredibly. Romeo is brash and impulsive, with a tendency to act on the heat of the moment rather than to first consider the situation like the more levelheaded Juliet. This unfortunate characteristic, which played a huge role in leading up to the lovers' tragic fate, is wonderfully mastered by DeCaprio and retained throughout the film. But we also, like with Juliet, get a glimpse of his character's development. At the beginning of the play Romeo is a hopeless romantic who fantasizes of love, and seems to dwell more in his daydreamed world than actually on earth. At this point he has no idea what true love really is, he only thinks he does. It is not until he meets Juliet that he can begin to comprehend the true depth and passion of love. DeCaprio triumphs in this area as well.\\n\\nThe other actors are superb, and wonderfully portray their characters as Shakespeare intended. But what really impressed me was, as I stated earlier, the keeping of Shakespeare's original dialogue in Luhrman's modern setting. I know some people criticize this film for destroying the romance and beauty of Shakespeare's words by setting the story in modern day Verona, but I feel that it only made the film more romantic. What Luhrman did was both bold and brilliant, and he succeeded wonderfully.\\n\\nI won't speak any more of the brilliance of this film, I just highly recommend you see it as soon as possible. If you're a fan of Shakespeare like me, I think you will enjoy this hip, yet still lovely, modernization of his most famous play ever.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "actor": [
    {
      "name": "Leonardo DiCaprio",
      "url": "https://www.imdb.com/name/nm0000138/"
    },
    {
      "name": "Claire Danes",
      "url": "https://www.imdb.com/name/nm0000132/"
    },
    {
      "name": "John Leguizamo",
      "url": "https://www.imdb.com/name/nm0000491/"
    }
  ],
  "director": [
    {
      "name": "Baz Luhrmann",
      "url": "https://www.imdb.com/name/nm0525303/"
    }
  ],
  "creator": [
    {
      "name": "William Shakespeare",
      "url": "https://www.imdb.com/name/nm0000636/"
    },
    {
      "name": "Craig Pearce",
      "url": "https://www.imdb.com/name/nm0668902/"
    },
    {
      "name": "Baz Luhrmann",
      "url": "https://www.imdb.com/name/nm0525303/"
    }
  ]
}