

{
  "type": "Movie",
  "name": "Trance",
  "url": "https://www.imdb.com/tt1924429/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjMzNjU1MTg5NF5BMl5BanBnXkFtZTcwMTExMTcwOQ@@._V1_.jpg",
  "description": "An art auctioneer becomes mixed up with a group of criminals partners with a hypnotherapist in order to recover a lost painting.",
  "review": {
    "author": "CharlieGreenCG",
    "dateCreated": "2013-04-12",
    "inLanguage": "English",
    "heading": "The most versatile director in the industry...",
    "reviewBody": "From directing Bollywood, Sci-fi and Zombie flicks, to action thrillers to the London 2012 Olympics, Danny Boyle is the most versatile director in the industry. Currently at the top of his game, Boyle directed Trance parallel to the Olympics on the same shooting schedule in the same weeks (literally!). In interviews he said relative to the Olympics that Trance is the 'dark cousin of the Olympics'. Boyle brings us a character-based, twisty thriller, just like the ones from the 1990's that launched his career.\\n\\nTrance is introduced with a Scorsese sprint-heist, where Simon (James McAvoy) is an inside man on stealing a \\u00a327,000,000 Goya painting from his job at an auction. When Simon double crosses his partner Franck (Vincent Cassell) he suffers a strike to the head, leaving him with amnesia. In order to find out where he hide the painting he must take hypnosis sessions to revive his memory. But as lines blur and hypnotic suggestion takes over, the situation gets darkly complex.\\n\\nKeeping you indulged for its entire one-hundred and seventeen minutes running time the film is imperatively based on narrative. Forget CGI and the rest. To make a good film use the three things that Hitchcock says is essential in film-making, 'the script, the script and the script'. Boyle does this wondrously.\\n\\nWhile Boyle assembled his old gang behind the camera, in front of it, they're all new faces for the film-maker, and they all rise to the occasion. Vincent Cassel at first seems to have the least interesting part of the film. The same sort of character he has played in the Ocean movies. Meanwhile other cast members such as James McAvoy and Rosie Dawson give the best performances of their careers. McAvoy in fact has never been so good. Appearing in two films on this months release (also Welcome To The Punch). He breaks his character type and shows his malevolence.\\n\\nThe film is a trippy heist thriller. Think Fight Club, Inception, Memento and The Sixth Sense and the style of story and endings. Trance is no exception. Even as we left the cinema other audience members where throwing around the Nolan word. But this film does seem like it has earnt the comparison. Compiled with complex script flips and twists the film is all solved in the final act, much like Nolan's films.\\n\\nHaving earnt its deserved rating of 15 the violence and excessive swearing are throughout. And all of the three of the main cast are seen at one point of the film both naked and abused. Interesting, eh? This is one film that should not be missed. Released tomorrow (March 26th 2013) this film is highly recommended.\\n\\nRead this review and many more at our website - Gone With The Movies\\n\\nhttp://gonewiththemovies.com/reviews/trance-review.php#.UWhc_LU3uSo",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 117412,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.9
  },
  "contentRating": "15",
  "genre": [
    "Crime",
    "Drama",
    "Mystery"
  ],
  "datePublished": "2013-03-27",
  "keywords": "lost painting,shaved labia,criminal,heist,hypnosis",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "James McAvoy",
      "url": "https://www.imdb.com/name/nm0564215/"
    },
    {
      "name": "Rosario Dawson",
      "url": "https://www.imdb.com/name/nm0206257/"
    },
    {
      "name": "Vincent Cassel",
      "url": "https://www.imdb.com/name/nm0001993/"
    }
  ],
  "director": [
    {
      "name": "Danny Boyle",
      "url": "https://www.imdb.com/name/nm0000965/"
    }
  ],
  "creator": [
    {
      "name": "Joe Ahearne",
      "url": "https://www.imdb.com/name/nm0013878/"
    },
    {
      "name": "John Hodge",
      "url": "https://www.imdb.com/name/nm0388076/"
    }
  ]
}