{
  "type": "Movie",
  "name": "American Animals",
  "url": "https://www.imdb.com/tt6212478/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYTc4ZWQyODItMTZjYy00OTVmLWEzMjUtNTlkOTJjMzhiYzAxXkEyXkFqcGdeQXVyODE0MDY3NzY@._V1_.jpg",
  "description": "Four young men mistake their lives for a movie and attempt one of the most audacious heists in U.S. history.",
  "review": {
    "author": "christopher-underwood",
    "dateCreated": "2020-02-19",
    "inLanguage": "English",
    "heading": "Very rare and illuminating experience",
    "reviewBody": "Such a good film. I felt shattered at the end, as if I had been through some terrible trauma, but exciting all the same, of course. First big surprise here is that this largely American film is directed by an English documentary filmmaker. Second is that the poster and title are just a wee bit misleading. Depicting a real incident in Kentucky we accompany four students on a mission to steal some rare books. Involving an excellent Evan Peters as leader of the group and also featuring the actual four from the original incident freshly released from jail. I have never seen anything like this as we slip from acted to real and back mixing and matching dialogue with the one character talking to himself at one point. Very involving throughout and very imaginatively shot, this leads to the most incredible heist. I&apos;m not sure my heart has ever beat as fast and the mixture of fear, excitement, relief and horror was quite incredible. Most of this is down to the fact that the filmmaking technique used tends to draw you in personally and breaks down the so called fourth wall and as in a dream (or nightmare!) a large part of you is actually mentally engaged in the action. Inside as opposed to outside. Very rare and illuminating experience when the urge of four kids to do something different and make something of themselves tips over into something unstoppable.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 48524,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7
  },
  "contentRating": "15",
  "genre": [
    "Biography",
    "Crime",
    "Drama"
  ],
  "datePublished": "2018-09-07",
  "keywords": "heist,heist gone wrong,rare book,book,disguise",
  "duration": "PT1H56M",
  "actor": [
    {
      "name": "Spencer Reinhard",
      "url": "https://www.imdb.com/name/nm9858131/"
    },
    {
      "name": "Warren Lipka",
      "url": "https://www.imdb.com/name/nm9858130/"
    },
    {
      "name": "Eric Borsuk",
      "url": "https://www.imdb.com/name/nm9858133/"
    }
  ],
  "director": [
    {
      "name": "Bart Layton",
      "url": "https://www.imdb.com/name/nm1717925/"
    }
  ],
  "creator": [
    {
      "name": "Bart Layton",
      "url": "https://www.imdb.com/name/nm1717925/"
    },
    {
      "name": "Jon Croker",
      "url": "https://www.imdb.com/name/nm1638619/"
    },
    {
      "name": "Peter Straughan",
      "url": "https://www.imdb.com/name/nm1661186/"
    }
  ]
}