{
  "type": "Movie",
  "name": "Crazy Rich Asians",
  "url": "https://www.imdb.com/tt3104988/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTYxNDMyOTAxN15BMl5BanBnXkFtZTgwMDg1ODYzNTM@._V1_.jpg",
  "description": "This contemporary romantic comedy based on a global bestseller follows native New Yorker Rachel Chu to Singapore to meet her boyfriend&apos;s family.",
  "review": {
    "author": "gerald-koh99",
    "dateCreated": "2018-08-30",
    "inLanguage": "English",
    "heading": "Entertaining look at wealth, identity and cultural tradition",
    "reviewBody": "Let me say straight off the bat that this does not give an accurate representation of 99% of Singaporeans, such as myself, ordinary people with more modest, down-to-earth backgrounds. This didn&apos;t stop me from enjoying this movie, which featured terrific acting, a storyline that translated decently onto the screen and wonderful camerawork and production values.\n\nMichelle Yeoh, acting as the stern, imposing mother of the male protagonist Nicholas gave the standout performance for me- I could sense the intensity of this character without going over-dramatic. Constance Wu, playing the female protagonist, also did terrifically as the girl thrust into a world she&apos;s totally unprepared to face. Everyone else, including Henry Goulding as the male protagonist, were also solid.\n\nI found the character development in the movie impressive, not just with the two main characters but even the minor ones too, as their backstories and motivations for behaving the way they did unfolded effectively. The storyline does fall prey to corny moments typical of most rom-coms- indeed, on that note, the story itself unfolded in a manner very formulaic of a rom-com, but that isn&apos;t too big of a deal in a script which overall works well. And it&apos;s supplemented by interesting camerawork and beautiful production values, illuminating the story very nicely.\n\nMany people seem to really detest this movie (and even the book it&apos;s based on), perceiving it as a shallow, silly, even offensive glorification of ultra-rich families and modern-day materialism. I&apos;d say that&apos;s too simplistic of an overview, as the heightening of a mega-wealthy bubble that is presented in the story is simply to illustrate the issues and circumstances that someone in that scenario would face. It draws out themes such as the love of wealth, the desire to maintain a reputation before others, and how to manage cultural/social expectations and traditions when they conflict with your wishes. That is something I really appreciated in the film, and would recommend you disregard the negative reviews and give it a watch.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 186670,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.9
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2018-09-14",
  "keywords": "materialism,rich man poor woman,asian american,singapore,nouveau riche",
  "duration": "PT2H",
  "actor": [
    {
      "name": "Constance Wu",
      "url": "https://www.imdb.com/name/nm2090422/"
    },
    {
      "name": "Henry Golding",
      "url": "https://www.imdb.com/name/nm6525901/"
    },
    {
      "name": "Michelle Yeoh",
      "url": "https://www.imdb.com/name/nm0000706/"
    }
  ],
  "director": [
    {
      "name": "Jon M. Chu",
      "url": "https://www.imdb.com/name/nm0160840/"
    }
  ],
  "creator": [
    {
      "name": "Peter Chiarelli",
      "url": "https://www.imdb.com/name/nm1095804/"
    },
    {
      "name": "Adele Lim",
      "url": "https://www.imdb.com/name/nm1004604/"
    },
    {
      "name": "Kevin Kwan",
      "url": "https://www.imdb.com/name/nm5858664/"
    }
  ]
}