{
  "type": "Movie",
  "name": "Sgt. Stubby: An American Hero",
  "url": "https://www.imdb.com/tt5314190/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTY5NzEwNDczMl5BMl5BanBnXkFtZTgwMjY1MTY4NDM@._V1_.jpg",
  "description": "The true story of a stray dog who joins his new master on the battlefields of the First World War. For his valorous actions, Sgt. Stubby is still recognized as the most decorated dog in American history.",
  "review": {
    "author": "brianjohnson-20043",
    "dateCreated": "2018-04-18",
    "inLanguage": "English",
    "heading": "Great Movie. Wish they had more money to make the animation pixar quality",
    "reviewBody": "You don&apos;t very often see kids movie which are based on true stories or war. But that&apos;s what this film is about. And surprisingly, it works. \n\nThe strengths are the score, the story and the fact that it doesn&apos;t have one of the likely endings one might predict. I suspect the outcome is largely due to this being based on a true story. I&apos;m unaware how accurate this portrayal is to the real story, but it seemed like a respectable adaptation to me. The way they managed to show the awful reality of The Great War, while keeping it G rated is really a difficult triumph. It&apos;s important for kids to have movies that highlight errors in war, as opposed to just the victories and heroism. This film highlights both. \n\nThe weaknesses: the voice acting doesn&apos;t stand out as great. The dialogue isn&apos;t a strength. But they get a longer leash (no pun intended) because it&apos;s a kids movie. The animation is great in the 2D segments, and much of the 3D animation is fine. However there are clips where I can tell they didn&apos;t have the funds to make the animation as good as they&apos;d like it to be. The clips of the soldiers marching seem noticeably too synchronized and took me out of the story.\n\nOverall, I recommend this film to anyone. It&apos;s not a film expect to win Oscars or nominations. But, It&apos;s a distinctive likable real-story dog movie. And the film is especially good if you want a mostly uplifting real story for kids about a subject they likely know little about: World War 1. \n\nI&apos;m probably in the minority, but I find the history of World War 1 to be just interesting and important as World War 2. It seems the average person knows 10 times more about World War 2 than World War 1 and there&apos;s about 10 World War 2 movies for each World War 1 movie. World War 1 highlights how futile and unnecessarily evil war can be even for the victors. World War 2 on the other-hand, often enables the attitude of supporting war, because a lot of the losses to world war 2 seem worth it or necessary because of what was gained and what was at stake. A lot of wars are more like WW1 than WW2, and this is something we should all understand.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 2517,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.9
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Adventure",
    "Family"
  ],
  "datePublished": "2018-08-10",
  "keywords": "world war one,french army,american history,heroic dog,military working dog",
  "duration": "PT1H24M",
  "actor": [
    {
      "name": "Logan Lerman",
      "url": "https://www.imdb.com/name/nm0503567/"
    },
    {
      "name": "Helena Bonham Carter",
      "url": "https://www.imdb.com/name/nm0000307/"
    },
    {
      "name": "Gérard Depardieu",
      "url": "https://www.imdb.com/name/nm0000367/"
    }
  ],
  "director": [
    {
      "name": "Richard Lanni",
      "url": "https://www.imdb.com/name/nm4175844/"
    }
  ],
  "creator": [
    {
      "name": "Richard Lanni",
      "url": "https://www.imdb.com/name/nm4175844/"
    },
    {
      "name": "Mike Stokey",
      "url": "https://www.imdb.com/name/nm0831408/"
    }
  ]
}