{
  "type": "Movie",
  "name": "The Oath",
  "url": "https://www.imdb.com/tt18925050/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYTIyYWVmOTgtYTE0Zi00NDI1LWE5NmYtY2YxOTVhMzFjMjcyXkEyXkFqcGdeQXVyNDk5MjA2MQ@@._V1_.jpg",
  "description": "400 A.D., in a forgotten time of Ancient America, a lone Hebraic fugitive must preserve the history of his fallen nation while being hunted by a ruthless tyrant. But rescuing the King&apos;s abused mistress could awaken a warrior&apos;s past.",
  "review": {
    "author": "adamknudsen",
    "dateCreated": "2023-12-10",
    "inLanguage": "English",
    "heading": "Truly one of the worst films I&apos;ve ever seen.",
    "reviewBody": "The Room. Samurai Cop. The Oath. These three films stand in a class of their own.\n\nNo matter which way you look at this, it&apos;s very amateur. Right off the bat, it was obvious the editing was very shoddy, and there is hideously overdone color correction throughout the entire thing. Besides some drone footage, the camera work is very bland, and there is a frustrating lack of deep focus shots, leaving any scenery just a blur in the background. The worst thing is it&apos;s irredeemably boring. Almost nothing happens, and scene to scene things are repetitive. The camera doesn&apos;t do anything interesting, and neither do the characters. The writing is as weak as the editing. It was very forced and cringey, and more than once I groaned audibly from something akin to physical pain. Lastly, and I mean no offense to the guy, but I was getting tired of seeing Darin Scott&apos;s face; he just doesn&apos;t have the charisma to justify that amount of screen time (or the number of thirst traps he wrote in for himself...).\n\nI&apos;m happy that the guy got to make his movie in the exact same way I&apos;m happy for Tommy Wiseau.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 1
    }
  },
  "rating": {
    "ratingCount": 520,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.5
  },
  "contentRating": "PG-13",
  "genre": [
    "Action",
    "Adventure",
    "Drama"
  ],
  "datePublished": "2023-12-08",
  "keywords": "book of mormon",
  "duration": "PT1H44M",
  "actor": [
    {
      "name": "Darin Scott",
      "url": "https://www.imdb.com/name/nm1576079/"
    },
    {
      "name": "Billy Zane",
      "url": "https://www.imdb.com/name/nm0000708/"
    },
    {
      "name": "Eugene Brave Rock",
      "url": "https://www.imdb.com/name/nm4726999/"
    }
  ],
  "director": [
    {
      "name": "Darin Scott",
      "url": "https://www.imdb.com/name/nm1576079/"
    }
  ],
  "creator": [
    {
      "name": "Darin Scott",
      "url": "https://www.imdb.com/name/nm1576079/"
    },
    {
      "name": "Michelle Scott",
      "url": "https://www.imdb.com/name/nm2480554/"
    }
  ]
}