{
  "type": "Movie",
  "name": "The Grinch",
  "url": "https://www.imdb.com/tt2709692/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI5NDY5NzM2MV5BMl5BanBnXkFtZTgwMjQyODA3NTM@._V1_.jpg",
  "description": "A grumpy Grinch plots to ruin Christmas for the village of Whoville.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2018-11-20",
    "inLanguage": "English",
    "heading": "Neither a Christmas cracker or a bah humbug",
    "reviewBody": "Part of me was interested in seeing &apos;The Grinch&apos;, being a fan of the original Dr Seuss story and especially the 1966 animated version with Boris Karloff voicing Grinch (do like the Jim Carrey version better than most) and being someone who likes Benedict Cumberbatch and a lot of what he&apos;s done. Was nervous though too because the trailer did not look good, the reviews are mixed to not great and did question whether it was necessary.\n\nDr Seuss adaptations have been very hit and miss. The animated short television specials have fared significantly better than the feature films, Dr Seuss&apos; work lends itself better to adaptations of a short length and the television specials were not only great adaptations and true in detail and spirit but great on their own. Of the feature films, the best one is by far &apos;Horton Hears a Who&apos; with the worst being the live action &apos;The Cat in the Hat&apos; (to me among the worst films ever made). Illumination has also been variable, loved the first two &apos;Despicable Me&apos; films while not caring for &apos;Minions&apos;.\n\nSaw &apos;The Grinch&apos; anyway as someone trying to see and review as many 2018 films as possible and loving the story and Christmas films, also to see how Cumberbatch would fare as Grinch. Seeing it, it is nowhere near as good as the 1966 version and is neither a Christmas cracker or a bah humbug. It is also neither among the best or worst films of the year, somewhere in the middle for me.\n\nThere are definitely great things here. The animation cannot be faulted, so much gorgeous and meticulous attention to detail and rich vibrant colours that really immerses one into the world of Whoville. Some of the soundtrack has a festive and infectious feel. There are funny and emotional moments, the former with the funny and adorable (plus more interesting) Max and the latter with the Cindy Lou subplot, that and the character herself being the sweet and charming heart of the film.\n\nIt is not a film without soul, having a warm glow more than once and some spirited elaborate set pieces, it does well with sticking to the spirit of the story and with the back and forth between Mount Crumpet and Whoville. It is not too long and has a lively pace generally. As said, Max and Cindy Lou are the best characters. Mostly the voice acting is good, with Cameron Seely being the clear standout.\n\nHaving said all of this, &apos;The Grinch&apos; could have been better. It does offer very little new or fresh, trying to be faithful to the source material while not moving enough beyond that that it all feels too safe. It could have done with more humour and heart generally, could have done without the repetitive and tired screaming goat gag and outside of the Cindy Lou subplot soul is missing.\n\nFound myself mixed on the pretty unrecognisable Cumberbatch. He does well providing a curmudgeonly touch and has moments of grinchy- meanness, plaudits too for not making Grinch too scary or resorting to excessive mugging. Do feel though that he was not mean or Grinchy-enough and he would have fared much better using his own voice for the character which would have fitted better. Had a big issue with the annoying, intrusive and over-explanatory narration that was not always necessary and with a rather out of place Pharrell Williams. Other parts of the soundtrack grated and too reminiscent of commercial music neither catchy or to my taste that didn&apos;t gel with the setting or the rest of the film. Too many of the supporting characters are forgettable and one-dimensional.\n\nOverall, better than what the critics have generally said but was rather mixed on a film with a lot of great merits but feels too safe and one does question the point of it. 6/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 89404,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "datePublished": "2018-11-09",
  "keywords": "dr. seuss&apos; how the grinch stole christmas,christmas,3d animation,computer animation,christmas movie",
  "duration": "PT1H25M",
  "actor": [
    {
      "name": "Benedict Cumberbatch",
      "url": "https://www.imdb.com/name/nm1212722/"
    },
    {
      "name": "Cameron Seely",
      "url": "https://www.imdb.com/name/nm7372981/"
    },
    {
      "name": "Rashida Jones",
      "url": "https://www.imdb.com/name/nm0429069/"
    }
  ],
  "director": [
    {
      "name": "Yarrow Cheney",
      "url": "https://www.imdb.com/name/nm0155528/"
    },
    {
      "name": "Scott Mosier",
      "url": "https://www.imdb.com/name/nm0608714/"
    }
  ],
  "creator": [
    {
      "name": "Michael LeSieur",
      "url": "https://www.imdb.com/name/nm1942829/"
    },
    {
      "name": "Tommy Swerdlow",
      "url": "https://www.imdb.com/name/nm0842476/"
    },
    {
      "name": "Dr. Seuss",
      "url": "https://www.imdb.com/name/nm0317450/"
    }
  ]
}