{
  "type": "Movie",
  "name": "The House with a Clock in Its Walls",
  "url": "https://www.imdb.com/tt2119543/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjQyMDMwMzI3Ml5BMl5BanBnXkFtZTgwOTU2NzQxNTM@._V1_.jpg",
  "description": "A young orphan named Lewis Barnavelt aids his magical uncle in locating a clock with the power to bring about the end of the world.",
  "review": {
    "author": "cruise01",
    "dateCreated": "2018-09-22",
    "inLanguage": "English",
    "heading": "A fun fantasy with a growing up story about a boy and learning magic but a shallow story.",
    "reviewBody": "The House with a Clock in its Walls (3 out of 5 stars).\n\nThe House with a Clock in its Walls is a fantasy family film that brings a story about warlocks and magic and a house filled with lively things such as a moving couch, ever changing glass work, or even a pet plant lion. It is surprising that director Eli Roth, the guy that does mainly gory horror films is taking on a family oriented film. Do not worry, he tries for the cheap jump scare tricks and some creepy setting. It would seem like a Tim Burton type of film. Yet again, the movie does seem similar to Miss Peregrine with people and gifted abilities and a plot that is dark. \n\nWell the plot was decent and yet forgettable. It takes place in 1955, Lewis (Owen Vaccaro) parents passed away. And he is sent away to live with his estranged uncle Jonathan (Jack Black). Lewis meets Jonathan&apos;s neighbor Florence (Cate Blanchett) that spends most of the time with him. Lewis enters his uncle&apos;s big house with many antiques, clocks, and mannequins. When Jonathan informs Lewis that he is a warlock. And can teach him spells. Lewis has trouble making friends in school. He tries to impress a kid by showing him some magic which leads to something more. While, Jonathan has been on a search for a clock hidden in the walls in the house that is counting down to something more dark.\n\nThe plot had a nice concept of warlocks, magic, and even a dark third act. But the film spends most of the time with Lewis learning about his uncle and his warlock lifestyle. Seeing that the furniture being lively. And struggling to keep a friend in school. While he makes the stupid decision to impress a kid with a dark magic. And the movie spending most of the time with Jonathan trying to figure out where the clock is hidden. Until, the final act, they conveniently connected the dots of its whereabouts. Sure, the final act picks up the pace of the movie. And can get a little creepy when armored knights walk around the house, books fly around chaotically, and the villains motive with the hidden clock is dark. Do not worry, the film lights up the tone with cheesy, tacky humor, and even a disturbing grown up person&apos;s head on a baby body. \n\nJack Black was decent as Jonathan playing a cool uncle that tries too be relatable. Cate Blanchett playing Florence was good. Owen Vaccaro could have given a little bit of a better performance. Felt like he was reading straight from the script with cliff notes on the characters emotions.\n\nThe visual effects were okay. But it does have a creepy setting and direction. Jack O lanterns coming alive. Dolls moving around, paintings changing, and a couch that acts more like a puppy. While, the script does set up a slow story that does not progress until the final act. \n\nOverall, The House with a Clock in Its Walls is a fair fantasy film. Interesting dark concept with a creepy house setting that has a mixture of Adam&apos;s family, or Miss Peregrines. The acting was decent. The visuals and direction was good on being creepy fun. The plot focused too much on characters searching for a clock and not much of a story until its dark finale.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 54801,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "datePublished": "2018-09-21",
  "keywords": "basketball,magic,mouse,bowtie,knapsack",
  "duration": "PT1H45M",
  "actor": [
    {
      "name": "Jack Black",
      "url": "https://www.imdb.com/name/nm0085312/"
    },
    {
      "name": "Cate Blanchett",
      "url": "https://www.imdb.com/name/nm0000949/"
    },
    {
      "name": "Owen Vaccaro",
      "url": "https://www.imdb.com/name/nm6236783/"
    }
  ],
  "director": [
    {
      "name": "Eli Roth",
      "url": "https://www.imdb.com/name/nm0744834/"
    }
  ],
  "creator": [
    {
      "name": "John Bellairs",
      "url": "https://www.imdb.com/name/nm0068662/"
    },
    {
      "name": "Eric Kripke",
      "url": "https://www.imdb.com/name/nm0471392/"
    }
  ]
}