{
  "type": "Movie",
  "name": "Colossal",
  "url": "https://www.imdb.com/tt4680182/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTY2NTExOTA2MF5BMl5BanBnXkFtZTgwNTMwMjE2MTI@._V1_.jpg",
  "description": "Gloria is an out-of-work party girl forced to leave her life in New York City and move back home. When reports surface that a giant creature is destroying Seoul, she gradually comes to the realization that she is somehow connected...",
  "review": {
    "author": "mbs",
    "dateCreated": "2017-03-29",
    "inLanguage": "English",
    "heading": "Solidly engaging film may leave you with a couple of questions after its over, but Hathaway and Sudekis do terrific work",
    "reviewBody": "Attended a preview screening of this courtesy of a friend the other night with zero idea of what the movie was about so imagine to my surprise that it was a wry take on a Godzilla movie but with a seriously intriguing and rather perplexing narrative hook. If you're reading this right now, you're either deciding whether to see this, or you've already seen this and are looking for opinions on what other people thought. \n\nWithout spoiling anything I'll just say that i thought the director (who also wrote the script) does an impressive job of keeping you into the story being told, and just slightly off track as to what's around the bend story wise. There were a couple times watching this where I thought i knew where the story was going to go, but ended up being somewhat off the mark. As the movie kept going I also started to wonder how the heck the director was going to bring this thing to a satisfying ending, and the answer to that question was with a fantastic climactic sequence that i very much liked watching unfold but didn't quite hit the mark in terms of satisfying to me, but somehow still felt quite right in keeping in tone with what we had been watching the whole time. \n\nSo basically i'm just saying--its worth checking out but with some slight reservations about the story as it unfolded. (I personally thought the big reveal about the origins of the monster's appearance was a little too symbolic and mystical and out of the blue, but other people might like how its explained)\n\nAll that said, the main concept of the movie i thought was pretty superb, and I thought Anne Hathaway in a kind of role we rarely if ever see her play was excellent and does a tremendous job in a very difficult role. If you don't like her, you'll end up hating the movie because she is a very large component of the movie. I thought even tho her character is aimless, she did a terrific job of keeping her likable throughout, even when you're kind of cringing at some of the decisions she makes on screen. Similarly, i thought the performance of Jason Sudekis was also surprisingly good. He starts out the film the way you normally see him in films, as the seemingly good hart-ed, wry, slightly bumbling slob, but as the story unfolds and he gradually starts to change those very qualities ever so subtly, it may not be til very late in the film or possibly thinking about it on the way home that you realize how strong a job he did as well playing opposite Hathaway. (Dan Stevens for the record has a very smallish part so if you're going to see this specifically for him, you might be disappointed) \n\nIn closing i'll just say that if you already know the premise to the film and are wondering whether or not its for you, I'll just say that if you like slightly out there premises, you should check this out because overall despite again some narrative choices I might not have been too crazy about, i thought it was a very solidly engaging movie, and for what its worth, I didn't think it was too strange to appeal to people who think that this may be too far out there for their comfort zones/slightly more mainstream tastes.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 68713,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "R",
  "genre": [
    "Comedy",
    "Drama",
    "Fantasy"
  ],
  "datePublished": "2017-04-20",
  "keywords": "destroying property,drinking,moral dilemma,narcissist,female alcoholic",
  "duration": "PT1H49M",
  "actor": [
    {
      "name": "Anne Hathaway",
      "url": "https://www.imdb.com/name/nm0004266/"
    },
    {
      "name": "Jason Sudeikis",
      "url": "https://www.imdb.com/name/nm0837177/"
    },
    {
      "name": "Austin Stowell",
      "url": "https://www.imdb.com/name/nm3271473/"
    }
  ],
  "director": [
    {
      "name": "Nacho Vigalondo",
      "url": "https://www.imdb.com/name/nm1443023/"
    }
  ],
  "creator": [
    {
      "name": "Nacho Vigalondo",
      "url": "https://www.imdb.com/name/nm1443023/"
    }
  ]
}