{
  "type": "Movie",
  "name": "Girls Trip",
  "url": "https://www.imdb.com/tt3564472/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjMwNTEzODUwMV5BMl5BanBnXkFtZTgwNjE5NjA5MjI@._V1_.jpg",
  "description": "When four lifelong friends travel to New Orleans for the annual Essence Festival, sisterhoods are rekindled, wild sides are rediscovered, and there's enough dancing, drinking, brawling and romancing to make the Big Easy blush.",
  "review": {
    "author": "subxerogravity",
    "dateCreated": "2017-07-23",
    "inLanguage": "English",
    "heading": "This movie is pure laughs. Absolutely funny.",
    "reviewBody": "I went into it with a good feeling about it. The trailer looked like the film was going to be real entertaining, but this was better than I expected. \n\nIt's funny that Queen Latifah and Jada Pinkett Smith are not more centered stage in this movie as I though they were bigger stars than that, but I forget Regina Hall has made quite a name for herself in the last few years. The film centers around her character, Ryan who gathers her crew who she has not scene for years to an event in New Orleans so that they can reconnect.\n\nAll the women were funny in this movie but special shout out to Tiffany Haddish who I've never herd of before this movie but will never forget. She gave it all to get the big laughs just like Melissa McCarthy did in Bridesmaids.\n\nNothing's more funnier than watching women get down and dirty about things that would not be considered proper etiquette. I want to see it all and I got that from Girls Trip. This had me laughing from beginning to end. It's hilarious. Plus it's a good movie about friends hanging with each other. You get the vibe from all the characters that they have been down for one another forever, and it gives you that good feeling.\n\nA great movie.\n\nhttp://cinemagardens.com",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 40267,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "R",
  "genre": [
    "Adventure",
    "Comedy",
    "Drama"
  ],
  "datePublished": "2017-07-21",
  "keywords": "no panties,camel toe,anus,male frontal nudity,big penis",
  "duration": "PT2H2M",
  "actor": [
    {
      "name": "Regina Hall",
      "url": "https://www.imdb.com/name/nm0356021/"
    },
    {
      "name": "Queen Latifah",
      "url": "https://www.imdb.com/name/nm0001451/"
    },
    {
      "name": "Jada Pinkett Smith",
      "url": "https://www.imdb.com/name/nm0000586/"
    }
  ],
  "director": [
    {
      "name": "Malcolm D. Lee",
      "url": "https://www.imdb.com/name/nm0002700/"
    }
  ],
  "creator": [
    {
      "name": "Erica Rivinoja",
      "url": "https://www.imdb.com/name/nm1106214/"
    },
    {
      "name": "Kenya Barris",
      "url": "https://www.imdb.com/name/nm1244069/"
    },
    {
      "name": "Tracy Oliver",
      "url": "https://www.imdb.com/name/nm2002824/"
    }
  ]
}