{
  "type": "Movie",
  "name": "The Only Living Boy in New York",
  "url": "https://www.imdb.com/tt0460890/",
  "poster": "https://m.media-amazon.com/images/M/MV5BODEzODA5NjU2NF5BMl5BanBnXkFtZTgwODkwNzA5MjI@._V1_.jpg",
  "description": "Adrift in New York City, a recent college graduate&apos;s life is upended by his father&apos;s mistress.",
  "review": {
    "author": "mblumenfield-02427",
    "dateCreated": "2017-08-01",
    "inLanguage": "English",
    "heading": "The story has depth, poignancy and surprise which will grab hold you and won&apos;t let go throughout the film.",
    "reviewBody": "This movie has some shades of a Woody Allen film in its character studies of people and in capturing the atmosphere of Manhattan. It examines family and sexual relationships between a husband and wife as well as extramarital love and sex. It looks at a young man&apos;s struggle with his sexual and romantic feelings. This is a psychological drama that highlights guilt, jealousy and even an important aspect of the oedipal complex. It is complicated and heavy stuff and it all flows from the pen of screenwriter Allen Loeb, who had written several successful movies before this earlier script ultimately came to fruition. This didn&apos;t happen until Marc Webb became attached to it as director and a terrific ensemble cast was put together which includes Jeff Bridges, Pierce Brosnan, Cynthia Nixon, Kiersey Clemons and Kate Beckinsale. However, the character who ties the plot together is relative newcomer, Callum Turner, who plays Thomas, the 25-year-old son who ultimately makes deep seated discoveries about himself and each of his parents before he can move on with his life.\n\nThis is the type of movie that will capture your attention and make you ponder each character&apos;s motivation. The story has depth, poignancy and surprises which will grab hold you and won&apos;t let go throughout the film. It certainly kept us thinking and talking as we left the theater. (2017) – Scheduled for release August 11th. FilmRap.net",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 17173,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "R",
  "genre": [
    "Drama"
  ],
  "datePublished": "2017-07-27",
  "keywords": "son has sex with father&apos;s mistress,father and son have sex with same woman,title based on song,publisher,author",
  "duration": "PT1H29M",
  "actor": [
    {
      "name": "Callum Turner",
      "url": "https://www.imdb.com/name/nm4360085/"
    },
    {
      "name": "Kate Beckinsale",
      "url": "https://www.imdb.com/name/nm0000295/"
    },
    {
      "name": "Pierce Brosnan",
      "url": "https://www.imdb.com/name/nm0000112/"
    }
  ],
  "director": [
    {
      "name": "Marc Webb",
      "url": "https://www.imdb.com/name/nm1989536/"
    }
  ],
  "creator": [
    {
      "name": "Allan Loeb",
      "url": "https://www.imdb.com/name/nm1615610/"
    }
  ]
}