

{
  "type": "Movie",
  "name": "A Haunted House",
  "url": "https://www.imdb.com/tt2243537/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTM1ODgyOTI0NF5BMl5BanBnXkFtZTcwODgyMDY3OA@@._V1_.jpg",
  "description": "Malcolm and Kisha move into their dream home, then learn that a demon also resides there. When Kisha becomes possessed, Malcolm--determined to keep his sex life on track--turns to a priest, a psychic, and a ghostbusting team for h...",
  "review": {
    "author": "Michael_Elliott",
    "dateCreated": "2013-01-18",
    "inLanguage": "English",
    "heading": "I Wasn't Expecting to Say This But It's Very Funny",
    "reviewBody": "A Haunted House (2013) \n\n*** (out of 4) \n\nMalcolm (Marlon Wayans) moves his girlfriend Kisha (Essence Atkins) in with him and soon they start to encounter the paranormal. Look, I'll freely admit that I walked into A HAUNTED HOUSE with incredibly low expectations but within the first minute I had tears running down my face from laughing so hard. I'll admit that I'm shocked at how much I enjoyed this thing but unlike SCARY MOVIE and other spoofs, this film here isn't just a copycat of the films it's spoofing but instead it's actually a well thought out comedy that has a lot of imagination that takes it down various funny roads. If you've seen SCARY MOVIE (or countless other spoofs) then you know there's always going to be some pot jokes. Well, this film here contains a pot gag and it was one of the funniest scenes I've seen in any movie in a very long time. The majority of the gags really hit their mark, which is so impressive considering that they're being thrown at the very every few seconds. As you'd expect the majority of the jokes are vulgar and cheap but what's most important is that they're funny. We get fart jokes, gay jokes, racial jokes as well as making fun of countless horror movies and they all work. Wayans turns in one of his funniest performances is ages and his scene in the bathtub is just downright classic in oh so many ways. Atkins is also extremely good in her role and takes a lot of abuse but the two have such great chemistry that you can't help but laugh. Nick Swardson, David Koechner, Dave Sheridan and Cedric the Entertainer play the people who get involved with the ghosts and all add some terrific laughs. A HAUNTED HOUSE wasn't made to win Oscars or be taken serious. It's a spoof and for the most part it's actually a lot better than many of the films that it's making fun of.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 49567,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Fantasy",
    "Horror"
  ],
  "datePublished": "2013-06-19",
  "keywords": "parody,priest,female nudity,spoof,woman wears a bikini",
  "duration": "PT1H26M",
  "actor": [
    {
      "name": "Marlon Wayans",
      "url": "https://www.imdb.com/name/nm0005541/"
    },
    {
      "name": "Essence Atkins",
      "url": "https://www.imdb.com/name/nm0040591/"
    },
    {
      "name": "Marlene Forte",
      "url": "https://www.imdb.com/name/nm0287168/"
    }
  ],
  "director": [
    {
      "name": "Michael Tiddes",
      "url": "https://www.imdb.com/name/nm1639277/"
    }
  ],
  "creator": [
    {
      "name": "Marlon Wayans",
      "url": "https://www.imdb.com/name/nm0005541/"
    },
    {
      "name": "Rick Alvarez",
      "url": "https://www.imdb.com/name/nm0023315/"
    }
  ]
}