

{
  "type": "Movie",
  "name": "G.I. Joe: Retaliation",
  "url": "https://www.imdb.com/tt1583421/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzk5ODM0OTQ0N15BMl5BanBnXkFtZTcwODg2ODE4OA@@._V1_.jpg",
  "description": "The G.I. Joes are not only fighting their mortal enemy Cobra; they are forced to contend with threats from within the government that jeopardize their very existence.",
  "review": {
    "author": "CMTiago",
    "dateCreated": "2014-04-03",
    "inLanguage": "English",
    "heading": "Thrilling ride if you don't take it seriously",
    "reviewBody": "The sequel to the first G.I.Joe movie gathered some negative reviews like its predecessor. This kind of thing doesn't deter me from watching any movie and one of the reasons is because you have to understand what kind of movie you're going to watch. I know that this is a mindless action flick with a simple plot. It's entertaining and it doesn't have to prove a point by being a perfectly constructed movie. It's meant to look cool and lack any real depth. After getting that out of my system, I can say that I enjoyed watching Retaliation and will try to watch it many times in the future, as this is the kind of film I watch when I wanna have fun. Ranging from The Rock to Willis this movie has very stylistic characters that ultimately kick ass with the Snake Eyes/Storm Shadow battles coming to mind. The special effects also look impressive, particularly in one massive destruction scene. If you like to just lay back and see great fights and a little eye candy then this is the movie for you. Anyone trying to be logic about this I'll just tell you that you are wasting your time.\n\nRating 8/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 186799,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2013-03-27",
  "keywords": "gi joe,ninja,martial arts,ensemble cast,air strike",
  "duration": "PT1H50M",
  "actor": [
    {
      "name": "Dwayne Johnson",
      "url": "https://www.imdb.com/name/nm0425005/"
    },
    {
      "name": "Channing Tatum",
      "url": "https://www.imdb.com/name/nm1475594/"
    },
    {
      "name": "Adrianne Palicki",
      "url": "https://www.imdb.com/name/nm1597316/"
    }
  ],
  "director": [
    {
      "name": "Jon M. Chu",
      "url": "https://www.imdb.com/name/nm0160840/"
    }
  ],
  "creator": [
    {
      "name": "Rhett Reese",
      "url": "https://www.imdb.com/name/nm1014201/"
    },
    {
      "name": "Paul Wernick",
      "url": "https://www.imdb.com/name/nm1116660/"
    }
  ]
}