

{
  "type": "Movie",
  "name": "Insidious: Chapter 2",
  "url": "https://www.imdb.com/tt2226417/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTg0OTA5ODIxNF5BMl5BanBnXkFtZTcwNTUzNDg4OQ@@._V1_.jpg",
  "description": "The Lamberts believe that they have defeated the spirits that have haunted their family, but they soon discover that evil is not beaten so easily.",
  "review": {
    "author": "jaguiar313",
    "dateCreated": "2013-09-13",
    "inLanguage": "English",
    "heading": "Insidious sequel is spooky fun.",
    "reviewBody": "Insidious: Chapter 2 starts up almost right after the original Insidious ended with Josh (Patrick Wilson) and Renai (Rose Byrne) Lambert reunited with their son Dalton (Ty Simpkins) after his spirit was held prisoner by a demon in an afterlife dimension called 'The Further'. But, as we saw in the final frames, something else was now inhabiting Josh's body and it had strangled paranormal investigator Elise (Lin Shaye) to death. We pick up as the unsuspecting family, including older son Foster (Andrew Astor) and their infant daughter Kali, have moved in with Josh's mother Lorraine (Barbara Hershey) while police investigate Elise's mysterious death in their house. They are barely moved in when supernatural occurrences start to begin again with objects moving, spectral voices, apparitions appearing and dear old dad acting very strange. While Renai tries to deal with the fact that supernatural forces are still with them, Josh tries to convince her all is well and Lorraine decides to team up with Elise's former assistants paranormal investigators Specs (Leigh Whannell who also wrote the screenplay) and Tucker (Angus Sampson) along with one of the original investigators from Josh's childhood haunting, Carl (Steve Coulter) to get down to the bottom of these haunted hi-jinx once and for all. And that is all I will say about the story as, despite some familiar trappings, James Wan (The Conjuring) takes this installment in some clever directions and once again uses the familiar elements very well. We get to know the story behind the evil woman in black seen in the last film and even revisit The Further though, this time it is inventively linked to events in the first film. The pace is a bit slower and more methodical this time round but, since this film is a bit of a mystery as well as haunting, it takes it's time to let the story unfold and secrets be revealed. We still get some spooky scenes but, it is refreshingly mixed in with Lorraine and co's equally goose bump inducing investigation. And what they find is deviously fun. The film is not quite as lively as Insidious part one but, I liked the mystery element and the film earned points with me for using it's return to 'The Further' a bit more clever and less silly then last time. That is the point where the first film lost it's grip on me and here I like how it was done and was with this supernatural chiller up to the spooky end. Wan is a good director and he takes what could have been a ho-hum retread and makes it a fun follow-up. He gets good performances out of all his cast and while I found Patrick Wilson to be bland in both Insidious and The Conjuring, he gets a far more lively performance out of him here. He gets to ham it up a bit and it suits him. The film has some beautiful and creepy visuals, as is Wan's trademark, and Joseph Bishara's score adds some nice atmosphere too. So in conclusion, while the story elements are more familiar; we've seen some of it before and the pace a bit slower, Wan does give us a spooky mystery to add to the paranormal activity and makes much more clever use of his otherworldly 'Further'. He also gives us some clever answers to the questions left by his first Insidious and that all adds up to a spooky fun time at the movies. Also stars House Of The Devil's Joceline Donahue as young Lorraine in some equally clever flashback sequences that tie into the rest of the film in a fun way.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 187521,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "15",
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2013-09-13",
  "keywords": "police detective,barricading a door,injection in leg,taser,attacked with a knife",
  "duration": "PT1H46M",
  "actor": [
    {
      "name": "Patrick Wilson",
      "url": "https://www.imdb.com/name/nm0933940/"
    },
    {
      "name": "Rose Byrne",
      "url": "https://www.imdb.com/name/nm0126284/"
    },
    {
      "name": "Barbara Hershey",
      "url": "https://www.imdb.com/name/nm0001347/"
    }
  ],
  "director": [
    {
      "name": "James Wan",
      "url": "https://www.imdb.com/name/nm1490123/"
    }
  ],
  "creator": [
    {
      "name": "Leigh Whannell",
      "url": "https://www.imdb.com/name/nm1191481/"
    },
    {
      "name": "James Wan",
      "url": "https://www.imdb.com/name/nm1490123/"
    }
  ]
}