

{
  "type": "Movie",
  "name": "Kick-Ass 2",
  "url": "https://www.imdb.com/tt1650554/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4OTQxNzc0N15BMl5BanBnXkFtZTcwOTQxOTU5OQ@@._V1_.jpg",
  "description": "Following Kick-Ass' heroics, other citizens are inspired to become masked crusaders, but Red Mist leads his own group of evil super-villains to get revenge, kill Kick-Ass, and destroy everything he stands for.",
  "review": {
    "author": "Vartiainen",
    "dateCreated": "2014-01-31",
    "inLanguage": "English",
    "heading": "Lacks the novelty and the charm of the original",
    "reviewBody": "If the first Kick-Ass movie was that cool cousin, who's a bit rough around the edges and definitely a badass, then this film is that young brat, who tries to imitate said cousin, but only partly succeeds.\\n\\nThe first Kick-Ass film had a few good things going for it. It had a completely new take on the superhero genre, it skillfully juggled both effective comedy and brutally violent action scenes, plus it had some pretty convincing characters and a dark storyline. The sequel, on the other hand, fails at the juggling part. The action scenes are still pretty brutal and effective, but the humour lacks that razor sharp edge that made the first one so believable despite its premise. Instead it relies on racial stereotypes and potty humour, which just isn't that funny.\\n\\nAdd in a lackluster storyline that honestly feels like watching tennis. First one character has a change of heart, then few minutes later he/she bounces back and another character decides to change his/her opinion, immediately after which the first one changes his/her stand. Rinse and repeat. A compelling and captivating story this does not make, especially when the villain generates mostly embarrassed facepalms and the final battle rejuvenates some of the first clich\\u00e9s the first film so artfully dodged.\\n\\nThat being said, the production values are still excellent, some of the new characters are pretty interesting (though there's way too many of them), I still like both Kick-Ass (Aaron Taylor-Johnson) and Hit-Girl (Chlo\\u00eb Grace Moretz) and they had some really good scenes together. If you liked the first film and want to see the storyline continued, this one is worth checking out if you're not expecting miracles.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 286664,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "datePublished": "2013-08-14",
  "keywords": "bully,ben wa balls,fetish fashion,sex in a bathroom,jail",
  "duration": "PT1H43M",
  "actor": [
    {
      "name": "Aaron Taylor-Johnson",
      "url": "https://www.imdb.com/name/nm1093951/"
    },
    {
      "name": "Chlo\\u00eb Grace Moretz",
      "url": "https://www.imdb.com/name/nm1631269/"
    },
    {
      "name": "Christopher Mintz-Plasse",
      "url": "https://www.imdb.com/name/nm2395586/"
    }
  ],
  "director": [
    {
      "name": "Jeff Wadlow",
      "url": "https://www.imdb.com/name/nm0905592/"
    }
  ],
  "creator": [
    {
      "name": "Jeff Wadlow",
      "url": "https://www.imdb.com/name/nm0905592/"
    },
    {
      "name": "Mark Millar",
      "url": "https://www.imdb.com/name/nm2092839/"
    },
    {
      "name": "John Romita Jr.",
      "url": "https://www.imdb.com/name/nm1348210/"
    }
  ]
}