

{
  "type": "Movie",
  "name": "Oz the Great and Powerful",
  "url": "https://www.imdb.com/tt1623205/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjMyMzQ1ODM1MF5BMl5BanBnXkFtZTcwMjE2MTQxOQ@@._V1_.jpg",
  "description": "A small-time magician is swept away to an enchanted land and is forced into a power struggle between three witches.",
  "contentRating": "PG",
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "datePublished": "2013-03-08",
  "keywords": [
    "wicked witch of the west character",
    "year 1905",
    "glinda the good character",
    "3 dimensional",
    "camera focus on female butt"
  ],
  "duration": "PT2H10M",
  "rating": {
    "ratingCount": 213717,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "review": {
    "author": "DrewAlexanderR1",
    "dateCreated": "2015-08-14",
    "inLanguage": "English",
    "heading": "A Perfect Prequel",
    "reviewBody": "Oz the Great and Powerful tells the story of how the great wizard Oz from the Wizard of Oz came to be. It follows the young Oz (James Franco) as he is swept away to an enchanted land ending up in the middle of a power struggle between three witches. The young Oz is a trickster who deceives those he wants and/or needs for his own ends. This attitude has consequences and those consequences are what drives the story forward.\\n\\nJames Franco plays the young Oz brilliantly. The character is a shallow small time magician and the story shows how he comes full circle to be the Great and Powerful Oz from the Wizard of Oz. Unfortunately, his change happens after taking a grievous toll. The three witches who Oz comes to affect are Theodora (Mila Kunis), Rachel Weisz (Evanora), and Glinda (Michelle Williams). The three play their parts and give great performances to add to their resumes. \\n\\nFor those who watched and loved the Wizard of Oz in their childhood, this movie is the perfect prequel. Watching it as an adult was a treat. The writers did well to adapt the script to make it a worthy prequel. In addition, the movie does well to entertain both children and adults. It slots in perfectly as the precursor to the Wizard of Oz. \\n\\nThe film didn't have the best reception but I encourage you to ignore this. The directing is probably the weakest link in this movie, but the story and actors more than makeup for this. The character development is amazing and shows exactly why things were they way they are in the Wizard of Oz. Simply stated Oz the Great and Powerful is truly a prefect prequel.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "actor": [
    {
      "name": "James Franco",
      "url": "https://www.imdb.com/name/nm0290556/"
    },
    {
      "name": "Michelle Williams",
      "url": "https://www.imdb.com/name/nm0931329/"
    },
    {
      "name": "Rachel Weisz",
      "url": "https://www.imdb.com/name/nm0001838/"
    }
  ],
  "director": [
    {
      "name": "Sam Raimi",
      "url": "https://www.imdb.com/name/nm0000600/"
    }
  ],
  "creator": [
    {
      "name": "Mitchell Kapner",
      "url": "https://www.imdb.com/name/nm0438449/"
    },
    {
      "name": "David Lindsay-Abaire",
      "url": "https://www.imdb.com/name/nm1865755/"
    },
    {
      "name": "L. Frank Baum",
      "url": "https://www.imdb.com/name/nm0000875/"
    }
  ]
}