

{
  "type": "Movie",
  "name": "R.I.P.D.",
  "url": "https://www.imdb.com/tt0790736/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTM5OTYxNzE5N15BMl5BanBnXkFtZTcwMDU1MTQ4OQ@@._V1_.jpg",
  "description": "A cop killed by his own partner joins RIPD, an afterlife law enforcement department working to apprehend various monsters disguised as humans living on earth, and gets paired up with a smart-mouthed veteran.",
  "review": {
    "author": "Hellmant",
    "dateCreated": "2013-07-24",
    "inLanguage": "English",
    "heading": "Not nearly as bad as a lot of people like to say it is.",
    "reviewBody": "'R.I.P.D.': Three and a Half Stars (Out of Five)\n\nOne of the summer's biggest expensive casualties is this Dark Horse comic adaptation starring Ryan Reynolds and Jeff Bridges as two police officers in the after life fighting undead ghouls. It was directed by Robert Schwentke (who also directed the action films 'RED' and 'FLIGHPLAN') and written by Phil Hay, Matt Manfredi and David Dobkin. Peter M. Lenkov created the comic book it's based on and also executive produced the film. The film also co-stars Kevin Bacon, Mary-Louise Parker, Stephanie Szostak, Marisa Miller and James Hong. Oddly both Reynolds and Parker had two big films opening the same weekend (Reynolds also can be heard in the animated family film 'TURBO' and Parker reprised her role in the sequel to Schwentke's 'RED'). All three films bombed and Reynolds now has a pretty big reputation for constantly delivering box office misfires. That doesn't mean they're bad films though and I actually enjoyed 'R.I.P.D.' to a certain degree (definitely not an especially good movie though).\n\nThe film opens with a Boston cop named Nick Walker (Reynolds), having a dispute with his partner, Bobby Hayes (Bacon), over whether or not to turn in gold they found at a recent drug bust. Walker is shot and killed by Hayes during a shootout and is recruited by the R.I.P.D. (Rest In Peace Department) in the afterlife. The R.I.P.D. specializes in catching 'deados', which are souls who have refused to leave the land of the living. Walker is teamed with an old U.S. Marshal from the Old West, named Roy Pulsipher (Bridges), while he attempts to track down his old partner and clear his reputation with the love of his life, Julia Walker (Szostak). \n\nThe biggest complaint I've heard about the trailer for the film is how much it resembles the film 'MEN IN BLACK' and I have to say, after seeing the film as well, that it very much resembles a 'MEN IN BLACK' movie. It's of course not nearly as good as that campy sci-fi classic but it is better than it's first sequel (arguably 'MEN IN BLACK 3' as well). The fact is the movie is not nearly as bad as a lot of people like to say it is. It's a lot of fun, funny at times and the visuals are spectacular. It had a budget of approximately $130 million and as a purely visual treat it paid off; as far as the special effects go, plus the women are all super hot (Szostak and Miller are breathtaking in the flick). Watching Reynolds and Bridges together (as an odd couple duo) is a treat as well and it's funny to see Reynolds being mostly the straight man while Bridges mostly hams it up (Bacon is also once again a great despicable villain). Not a great film by any means but not a bad one either.\n\nWatch our movie review show 'MOVIE TALK' at: https://youtu.be/NdWU81GeyN4",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 142861,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2013-09-20",
  "keywords": "villain,end of the world,gun fu,gunslinger,buddy cop",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Ryan Reynolds",
      "url": "https://www.imdb.com/name/nm0005351/"
    },
    {
      "name": "Jeff Bridges",
      "url": "https://www.imdb.com/name/nm0000313/"
    },
    {
      "name": "Mary-Louise Parker",
      "url": "https://www.imdb.com/name/nm0000571/"
    }
  ],
  "director": [
    {
      "name": "Robert Schwentke",
      "url": "https://www.imdb.com/name/nm0777881/"
    }
  ],
  "creator": [
    {
      "name": "Phil Hay",
      "url": "https://www.imdb.com/name/nm0006534/"
    },
    {
      "name": "Matt Manfredi",
      "url": "https://www.imdb.com/name/nm0542062/"
    },
    {
      "name": "David Dobkin",
      "url": "https://www.imdb.com/name/nm0229694/"
    }
  ]
}