

{
  "type": "Movie",
  "name": "The Lifeguard",
  "url": "https://www.imdb.com/tt2265534/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjExOTI5MjY3Ml5BMl5BanBnXkFtZTcwMjU2NDk3OQ@@._V1_.jpg",
  "description": "A former valedictorian quits her reporter job in New York and returns to the place she last felt happy: her childhood home in Connecticut. She gets work as a lifeguard and starts a dangerous relationship with a troubled teenager.",
  "contentRating": "15",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2014-02-24",
  "keywords": "woman has an affair with a teenage boy,sex with a teenager,teenager,sex scene,woman teenager relationship",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Kristen Bell",
      "url": "https://www.imdb.com/name/nm0068338/"
    },
    {
      "name": "Mamie Gummer",
      "url": "https://www.imdb.com/name/nm0336701/"
    },
    {
      "name": "Martin Starr",
      "url": "https://www.imdb.com/name/nm0771414/"
    }
  ],
  "director": [
    {
      "name": "Liz W. Garcia",
      "url": "https://www.imdb.com/name/nm1225921/"
    }
  ],
  "creator": [
    {
      "name": "Liz W. Garcia",
      "url": "https://www.imdb.com/name/nm1225921/"
    }
  ],
  "review": {
    "author": "manicmeuk",
    "dateCreated": "2013-08-31",
    "inLanguage": "English",
    "heading": "heavily dependant on life circumstances",
    "reviewBody": "where to start on this one...\n\ni think opinions on this film will be formed from personal life experience and how much someone can relate to the characters. myself, I'm similar in age and circumstance to Leigh and recently made a life change much like hers (moving back home from the city) and while the mistakes and tumbles she makes are outright irresponsible, i could not help but like her character and the maturity she showed at the end.\n\nthe romance aspect of this movie, whilst most definitely *inappropriate* does reflect the mental state of the main female character played by Kristen bell. stifled by her routine adult life and the responsibilities that come with it, she finds solace in a younger group who bring out her inner teen as it were. i think this is extremely well portrayed in the film through the three main adult cast members, who were friends in highschool, that upon the return of Leigh (KB) all suddenly start to regress and rebel against the adult strains put on them. all three characters go a little wild and forget that 'time only moves in one direction' and their subsequent battles to re-balance themselves as adults was interesting to watch.\n\nthe strength of the young actors in this film prevented it from becoming smut. David Lambert had enough charisma that it was plausible that a confused and disturbed woman would be drawn to him, whilst still maintaining that young innocence that made the story equally as much about him maturing as it was about KBs character. Alex Shaffer was impressive and moving in his portrayal of a tormented young man.\n\ncould it have been done better? absolutely. does it contain inappropriate feelings and relationships...obviously yes. Does it convey the ability of people to mess up in the most stupid irresponsible ways....yup. i liked it. i wouldn't watch it again, but it was a good film. comedy it is not however and the tag-line cheapens the movie.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 15171,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  }
}