

{
  "type": "Movie",
  "name": "The Hangover Part III",
  "url": "https://www.imdb.com/tt1951261/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTA0NjE1MzMzODheQTJeQWpwZ15BbWU3MDY4MTQ3Mzk@._V1_.jpg",
  "description": "When one of their own is kidnapped by an angry gangster, the Wolf Pack must track down Mr. Chow, who has escaped from prison and is on the run.",
  "datePublished": "2013-05-24",
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Crime"
  ],
  "duration": "PT1H40M",
  "keywords": "male full frontal nudity,2010s,man wears eyeglasses,man tied up,hood over head",
  "actor": [
    {
      "name": "Bradley Cooper",
      "url": "https://www.imdb.com/name/nm0177896/"
    },
    {
      "name": "Zach Galifianakis",
      "url": "https://www.imdb.com/name/nm0302108/"
    },
    {
      "name": "Ed Helms",
      "url": "https://www.imdb.com/name/nm1159180/"
    }
  ],
  "director": [
    {
      "name": "Todd Phillips",
      "url": "https://www.imdb.com/name/nm0680846/"
    }
  ],
  "creator": [
    {
      "name": "Todd Phillips",
      "url": "https://www.imdb.com/name/nm0680846/"
    },
    {
      "name": "Craig Mazin",
      "url": "https://www.imdb.com/name/nm0563301/"
    },
    {
      "name": "Jon Lucas",
      "url": "https://www.imdb.com/name/nm0524190/"
    }
  ],
  "review": {
    "author": "Michael_Elliott",
    "dateCreated": "2013-05-23",
    "inLanguage": "English",
    "heading": "One of the Laziest Comedies in Recent Memory",
    "reviewBody": "The Hangover Part III (2013) \n\n* 1/2 (out of 4) \n\nMan, if you thought things couldn't get any worse than THE HANGOVER PART II then sadly you were mistaken. The Wolf Pack are back and this time a gangster (John Goodman) are after them because Mr. Chow (Ken Jeong) stole forty-two million in gold. I'm really not going to waste anytime writing out everything going on here in regards to a plot synapses because why should I? It's clear that director and writer Todd Phillips along with stars Bradley Cooper, Ed Helms and Zach Galifianakis just made this thing either for the money or they had some sort of contract that required them to do so. While watching this thing it became rather sad because there simply weren't any laughs but what was worse is that it didn't seem the group were trying to make anything funny. This here is without question one of the laziest comedies I've ever seen because the filmmakers don't even bother to even attempt any laughs and what laughs there are are usually just winks to the first picture. It's really amazing to see how this series has fallen after a clever first film but the old saying that sequels usually end up poorly is certainly true. Cooper, Helms and Galifianakis fit their roles just fine but there's just no energy to be found here. Perhaps even they knew the screenplay was lackluster. Jeong is good in small doses but putting him into so much of this just made his character annoying. Goodman was good in his part but sadly he wasn't given much to do, which is the same for Mike Epps and Heather Graham. THE HANGOVER PART III claims to be the final in an epic series of films and lets pray that it really is. Bad movies happen sometimes even when everyone had their hearts into the project. There's just no evidence here that anyone cared about anything other than money. Part two proved that people would show up no matter how bad it was and the filmmakers got even lazier by delivering something worse.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 333116,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  }
}