

{
  "type": "Movie",
  "name": "The Center of the World",
  "url": "https://www.imdb.com/tt0240402/",
  "poster": "https://m.media-amazon.com/images/M/MV5BM2JlNmQ0OWEtNmJiMC00ZWZlLTg0YmMtOTVmNzA4NmVmMjExXkEyXkFqcGdeQXVyNjU1MDU2MTY@._V1_.jpg",
  "description": "A successful computer engineer meets a stripper in a cafe. He offers her $10,000 and she offers three days and nights of no penetration in Vegas.",
  "review": {
    "author": "kkcoold",
    "dateCreated": "2001-05-07",
    "inLanguage": "English",
    "heading": "Love in the Time of Dotcoms",
    "reviewBody": "A digital camera does not a movie make but Wayne Wang didn't rely on avant-garde technique alone when he decided to revisit the basic boy-meets-girl story. He simplifies the problem by choosing two people with very little in common and then taking them out of their natural settings and putting them in the unreal world of Las Vegas. The man is a socially inept but financially successful engineer so typical of our times and his character is developed and portrayed very realistically by Peter Saarsgard in a role very different from what he played in Boys Don't Cry. He's got it down even to the careless dressing and awkward laugh. I know - I work in the Bay Area. Molly Parker is equally convincing as the drummer-by-day-stripper-by-night career woman who has such a cool and invincible air about her that it makes quite an impact in the few occasions when she does let her armor down.\\n\\nIt almost seems as if Wang has taken the Hollywood classic Pretty Woman and has decided to deHollywoodize it. And in that he has been quite successful. The graininess of the Blair Witch style digital camera coupled with innovative shots including unexpected close-ups follow no clich\\u00e9s. Equally clich\\u00e9-free is the screenplay which follows a loosely linear narrative advanced primarily by the sexual encounters between a man and a woman who are placed in the near-equivalent situation of a desert island and come from different worlds. In this, one can discern shades of Last Tango in Paris, except that this movie is set in a more cynical time where love has been deconstructed and is not worth killing for. Sex becomes the center of their world but even as they escape into sex they cannot quite leave their personalities, their dreams, their insecurities behind and that is what ultimately saves them and their story from the mundaneness of a forgettable sexual encounter. Although they go into into the deal for purely selfish reasons - he desiring an escape from Internet porn and she looking for some extra cash - their encounter, like all good stories, becomes something of a journey of self-discovery.\\n\\nMention must be made of the attention to detail which makes the setting very believable. The soundtrack is eclectic and follows the local Californian club scene rather than big label network music. And the dialogue is very boy-girl-next-door rather than being made up of grand lines. However, this movie is not everybody's cup of tea. The lack of a discernable narrative in some of the scenes risks losing the viewer's attention. And there's no simple message or tying up of loose ends here. But those who can brave that and the graininess will be rewarded with a contemporary look at love in our times.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 5183,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "contentRating": "18",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2001-09-21",
  "keywords": [
    "female stripper",
    "lap dance",
    "object in vagina",
    "woman fingering her vagina",
    "vagina"
  ],
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Shane Edelman",
      "url": "https://www.imdb.com/name/nm0249006/"
    },
    {
      "name": "Balthazar Getty",
      "url": "https://www.imdb.com/name/nm0001267/"
    },
    {
      "name": "Molly Parker",
      "url": "https://www.imdb.com/name/nm0662504/"
    }
  ],
  "director": [
    {
      "name": "Wayne Wang",
      "url": "https://www.imdb.com/name/nm0911061/"
    }
  ],
  "creator": [
    {
      "name": "Wayne Wang",
      "url": "https://www.imdb.com/name/nm0911061/"
    },
    {
      "name": "Miranda July",
      "url": "https://www.imdb.com/name/nm0432380/"
    },
    {
      "name": "Paul Auster",
      "url": "https://www.imdb.com/name/nm0000808/"
    }
  ]
}