

{
  "type": "Movie",
  "name": "Chloe",
  "url": "https://www.imdb.com/tt1352824/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTczMzExNTkyMV5BMl5BanBnXkFtZTcwODUyMzAyMw@@._V1_.jpg",
  "description": "Suspecting her husband of infidelity, gynecologist Dr. Catherine Stewart hires an escort named Chloe in order to test his faithfulness. Soon, the relationships between all three intensify.",
  "review": {
    "author": "imdbbl",
    "dateCreated": "2010-05-23",
    "inLanguage": "English",
    "heading": "Solid erotic thriller even if predictable",
    "reviewBody": "When David (Liam Neeson) misses his flight home from New York and, as a result, the surprise party his wife Catherine (Julianne Moore) has planned for him, Catherine is forced to swallow her disappointment and any suspicions and return to the waiting guests. Reading a text message sent to David's phone the following morning from one of his female students, Catherine's fear grows. More suspicious than ever that David is having an affair, Catherine seeks out Chloe (Amanda Seyfried), an escort, hiring her to test David's fidelity.\\n\\nChloe is a very solid thriller. Extremely engaging and incredibly entertaining, this story is ultimately about human nature and instincts. The film really grabs your attention and visually, it's quite a feat. The minimalistic sets and the way it was shot give this film a really modern and slick look. I feel like I should warn that there's quite a bit of nudity and somewhat graphic scenes but nothing outrageous or out of place.\\n\\nMoore was absolutely terrific, she has proved her value already but here she delivers possibly one of the best performances of her career. Seyfried was quite a surprise. Her performance was subtle but very efficient and she seems a very promising young actress. Liam Neeson was not nearly as good as he usually is but it's understandable considering his wife died during the shooting of the film.\\n\\nAs I said, Chloe is a very solid and well done film. Unfortunately it has one major flaw, the predictably of the plot. I saw the twist coming from a mile way and I think any avid movie-goer will too. Still, it was a great watch, very entertaining and extremely well acted. Worth seeing.\\n\\n7/10",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 77391,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2010-03-05",
  "keywords": "lesbian sex,woman orgasms during lesbian sex,older woman younger woman relationship,female orgasm,female in a shower",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Julianne Moore",
      "url": "https://www.imdb.com/name/nm0000194/"
    },
    {
      "name": "Amanda Seyfried",
      "url": "https://www.imdb.com/name/nm1086543/"
    },
    {
      "name": "Liam Neeson",
      "url": "https://www.imdb.com/name/nm0000553/"
    }
  ],
  "director": [
    {
      "name": "Atom Egoyan",
      "url": "https://www.imdb.com/name/nm0000382/"
    }
  ],
  "creator": [
    {
      "name": "Erin Cressida Wilson",
      "url": "https://www.imdb.com/name/nm0933379/"
    },
    {
      "name": "Anne Fontaine",
      "url": "https://www.imdb.com/name/nm0284774/"
    }
  ]
}