

{
  "type": "Movie",
  "name": "Finding Bliss",
  "url": "https://www.imdb.com/tt1185242/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjIxMDc1MjEzNV5BMl5BanBnXkFtZTcwNDk2MzQ0Mg@@._V1_.jpg",
  "description": "A romantic comedy that explores the adult film industry through the eyes of an idealistic 25 year-old award winning film school grad.",
  "review": {
    "author": "princebansal1982",
    "dateCreated": "2011-06-07",
    "inLanguage": "English",
    "heading": "Awkward mix of romantic drama and sex comedy",
    "reviewBody": "Finding Bliss is promoted almost like a sex comedy, but is not a sex comedy. Instead it is an awkward mix of romantic drama and sex comedy. While trying to do two things, this movie ends up a mess. I don't think it will appeal to wither the male or female demographic. I know that it is a good movie can be equally enjoyed by both sexes, but this tries to combine the genres which have a set audience in mind.\n\nIt is a B grade movie. Everything from the acting to the script is amateur. Even Leelee Sobieski has done not done a good job. It feels as if that the whole film was made in a hurry. It has production values of straight to DVD sex comedies. The plot and the characters are not believable either. Everything is just to contrived.\n\nBy the way it is not a sex comedy, so if you are expecting that I recommend you watch something else. I have still given it an average rating though, because though it is a cheap B movie, It knows that it is a cheap B movie and doesn't pretends otherwise. There is a small payoff for those who like romantic movies, but I don't think it is worth it to watch the whole thing.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 2636,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.2
  },
  "contentRating": "R",
  "genre": [
    "Comedy",
    "Romance"
  ],
  "datePublished": "2011-12-15",
  "keywords": [
    "adult film industry",
    "pubic hair",
    "female nudity",
    "bikini",
    "blonde"
  ],
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Leelee Sobieski",
      "url": "https://www.imdb.com/name/nm0005447/"
    },
    {
      "name": "Matthew Davis",
      "url": "https://www.imdb.com/name/nm0205127/"
    },
    {
      "name": "Jamie Kennedy",
      "url": "https://www.imdb.com/name/nm0005085/"
    }
  ],
  "director": [
    {
      "name": "Julie Davis",
      "url": "https://www.imdb.com/name/nm0006874/"
    }
  ],
  "creator": [
    {
      "name": "Julie Davis",
      "url": "https://www.imdb.com/name/nm0006874/"
    }
  ]
}