{
  "type": "Movie",
  "name": "Repeaters",
  "url": "https://www.imdb.com/tt1580426/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQyMDEzNzU4Ml5BMl5BanBnXkFtZTcwMDYxODI1Nw@@._V1_.jpg",
  "description": "Three twenty-somethings find themselves in an impossible time loop, where each day they awaken to the same terrifying day as the preceding one.",
  "review": {
    "author": "knockemdeadkidd23",
    "dateCreated": "2013-03-17",
    "inLanguage": "English",
    "heading": "Not a synopsis",
    "reviewBody": "As it states, I&apos;m not going to repeat what you already know.\n\nIn the strange event that today repeated itself, tomorrow, and the next day, and so on. Questions you would ask yourself would be grand, and this movie does NOT leave many questions.\n\nIf you were given the same day to do what ever you want, would you kill, would you murder, would you rape, or would you save a life? these are possibly already questions you may have. \n\nLuckily this movie gets to the darker groundhogs day that some people may have been thinking about the whole time. I mean why wouldn&apos;t some one want to go rob a bank, or possibly commit a even more heinous crime? Tomorrow it wouldn&apos;t count right?\n\nThis movie bends your emotions, plays with your mind, and doesn&apos;t stop until the end. \n\nThis movie does lack real depth, which may cause you to not be as close with the characters, or may cause you to lose interest. But with that being said with what depth it tries to create it isn&apos;t a reason that this film should be avoided, not by any means.\n\nThe filming is perfect, it captures the lovely British Columbia that I&apos;ve loved since I was a kid, and happens to make a wicked back drop for the entire film.\n\nThere was only one actress I knew in this entire film, which was Amanda Crews, asides from that I have never seen any of the other actors/actresses in anything. If they have been in several other works than that would explain how their acting helps this movie on so many levels, it will play with every emotion no matter how heartless you are.\n\nBut if this is actually one of their few jobs they pulled it off perfectly.\n\nI couldn&apos;t give this anything less than a 6",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 7026,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "18",
  "genre": [
    "Action",
    "Crime",
    "Drama"
  ],
  "datePublished": "2021-09-01",
  "keywords": "reliving same event,time warp,time travel,time loop,scene repeated with a different finale",
  "duration": "PT1H29M",
  "actor": [
    {
      "name": "Dustin Milligan",
      "url": "https://www.imdb.com/name/nm1682420/"
    },
    {
      "name": "Amanda Crew",
      "url": "https://www.imdb.com/name/nm1468739/"
    },
    {
      "name": "Richard de Klerk",
      "url": "https://www.imdb.com/name/nm0209113/"
    }
  ],
  "director": [
    {
      "name": "Carl Bessai",
      "url": "https://www.imdb.com/name/nm0078762/"
    }
  ],
  "creator": [
    {
      "name": "Arne Olsen",
      "url": "https://www.imdb.com/name/nm0647592/"
    }
  ]
}