{
  "type": "Movie",
  "name": "The Last Song",
  "url": "https://www.imdb.com/tt1294226/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjA5NjM5MDA0M15BMl5BanBnXkFtZTcwMjg2NzQwMw@@._V1_.jpg",
  "description": null,
  "review": {
    "author": "katie-joy",
    "dateCreated": "2010-03-31",
    "inLanguage": "English",
    "heading": "&apos;Last Song&apos; hits some good notes, misses others",
    "reviewBody": "Enter Veronica &apos;Ronnie&apos; Miller, a recently graduated seventeen-year-old with an attitude problem, divorced parents, a fresh shoplifting arrest and combat boots. When Ronnie is sent from New York to Georgia to live with her dad for the summer, she is less than thrilled and at first resists letting anyone in.\n\nEnter Will Blakelee, a rich small town &apos;hunk&apos; (if you will), with volleyball skill and charm. Not exactly a rebellious teen aged girl&apos;s cup of tea, right? Well... not quite.\n\nRonnie, played by Disney&apos;s princess Miley Cyrus, seems set not falling for anyone over the summer. But she ends up doing the opposite. Will&apos;s (Liam Hemsworth, Australian newbie) consistency pays off after just a couple of run-ins. He&apos;s writing &apos;Forever&apos; on Ronnie&apos;s converse and playfully pushing her into the ocean before she even comes to fairly good terms with her piano-playing father, Steve. (Greg Kinnear) The fast pace relationship was sweet, considering it&apos;s between teenagers. Nothing like cliché summer romance, huh? If only there was more depth to the relationship... (not counting Will&apos;s secretly damaged family, and Ronnie&apos;s dramatic anger towards her dad) ... then maybe it would have been a more successful movie as a whole.\n\nI&apos;m not going to blame Cyrus&apos; ability to act (or maybe lack thereof) on the low points of the film. I&apos;ll actually give it to her, she did a nice job transitioning from little miss Hannah Montana to a darker, not as tween-based character. There is always room for improvement, however, as she seems to get bored of her alter ego throughout the film. But all in all, I did find her likable for the most part.\n\nAt the end of the day, I cannot really complain or bash The Last Song. It was a debut in a lot of ways... Julie Anne Robinson&apos;s directorial debut, Nicholas Spark writing a screenplay debut, and Miley&apos;s debut as someone other than Hannah. So, cut it some slack. Excuse the sometimes cheesy moments and keep your mind open.\n\n6/10, Not too shabby.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 92058,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6
  },
  "contentRating": "PG",
  "genre": [
    "Drama",
    "Music",
    "Romance"
  ],
  "datePublished": "2010-04-30",
  "keywords": "father daughter relationship,love,beach,pianist,fire",
  "duration": "PT1H48M",
  "actor": [
    {
      "name": "Miley Cyrus",
      "url": "https://www.imdb.com/name/nm1415323/"
    },
    {
      "name": "Liam Hemsworth",
      "url": "https://www.imdb.com/name/nm2955013/"
    },
    {
      "name": "Greg Kinnear",
      "url": "https://www.imdb.com/name/nm0001427/"
    }
  ],
  "director": [
    {
      "name": "Julie Anne Robinson",
      "url": "https://www.imdb.com/name/nm1455688/"
    }
  ],
  "creator": [
    {
      "name": "Nicholas Sparks",
      "url": "https://www.imdb.com/name/nm0817023/"
    },
    {
      "name": "Jeff Van Wie",
      "url": "https://www.imdb.com/name/nm3491486/"
    }
  ]
}