{
  "type": "Movie",
  "name": "Transformers",
  "url": "https://www.imdb.com/tt0418279/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNWI1NjkxM2MtOTU4My00YzQ5LTliNGMtNmFlM2U5NWM3MDY1XkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_.jpg",
  "description": "An ancient struggle between two Cybertronian races, the heroic Autobots and the evil Decepticons, comes to Earth, with a clue to the ultimate power held by a teenager.",
  "review": {
    "author": "byrann_gowan",
    "dateCreated": "2011-10-27",
    "inLanguage": "English",
    "heading": "Watch this if you know what you are in for",
    "reviewBody": "For those of you who are not fans of Michael Bay: for starters, do not watch this movie. It&apos;s really as simple as that. But, I&apos;ve read some of the negative comments on this film, and it baffles me to read that all this film consists of is hot girls, hot action, and not the greatest acting. Come on, guys. This is a Michael Bay film, and let me emphasize the words MICHAEL BAY. When I think about him, I think about entertainment, and entertainment only, because that is what his films are about. With films like this, I don&apos;t go in expecting some great story, with amazing dialogue. This movie is not academy award worthy, nor should it be. This is an action film, that&apos;s what it&apos;s meant to be, and when it comes to action films, Bay knows how to deliver. Again, the storyline could be better, and Megan Fox could use some acting lessons, but like I said, when you watch these movies, you should watch them for entertainment. So, if you know what this film delivers, and you don&apos;t like Michael Bay, then by all means, skip this movie. But, if you do end up watching this movie, and say that it&apos;s nothing but a bunch of clanging metal and hot girls, well then, welcome to the world of Michael Bay. I saw it in theatres back in 2007, I went with an open mind, and I enjoyed it. 9/10 for me.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 670982,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2007-07-27",
  "keywords": "evil alien robot,transformers,product placement,alien contact,remake of tv show",
  "duration": "PT2H24M",
  "actor": [
    {
      "name": "Shia LaBeouf",
      "url": "https://www.imdb.com/name/nm0479471/"
    },
    {
      "name": "Megan Fox",
      "url": "https://www.imdb.com/name/nm1083271/"
    },
    {
      "name": "Josh Duhamel",
      "url": "https://www.imdb.com/name/nm0241049/"
    }
  ],
  "director": [
    {
      "name": "Michael Bay",
      "url": "https://www.imdb.com/name/nm0000881/"
    }
  ],
  "creator": [
    {
      "name": "Roberto Orci",
      "url": "https://www.imdb.com/name/nm0649460/"
    },
    {
      "name": "Alex Kurtzman",
      "url": "https://www.imdb.com/name/nm0476064/"
    },
    {
      "name": "John Rogers",
      "url": "https://www.imdb.com/name/nm0736966/"
    }
  ]
}