{
  "type": "Movie",
  "name": "Wall Street: Money Never Sleeps",
  "url": "https://www.imdb.com/tt1027718/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTU5MDEzMzYwMF5BMl5BanBnXkFtZTcwNTcwMjUxMw@@._V1_.jpg",
  "description": "Now out of prison but still disgraced by his peers, Gordon Gekko works his future son-in-law, an idealistic stock broker, when he sees an opportunity to take down a Wall Street enemy and rebuild his empire.",
  "review": {
    "author": "chrichtonsworld",
    "dateCreated": "2010-10-26",
    "inLanguage": "English",
    "heading": "Unbelievable mess!",
    "reviewBody": "The first twenty minutes were very promising. Then it got boring. Extremely boring. There just isn&apos;t any plot. Gekko (Michael Douglas) getting together with his daughter maybe was touching for a moment. But the girl crying all the time got on my nerves. She is supposed to be an adult. In stead she is acting like a little child. I like Shia, but what on earth was he representing. At least Charlie Sheen as Bud Fox had a clear objective. (Speaking of which, his cameo as the guy we know from Two and a half men is so in contrast of the character Bud Fox that completely diminishes the first movie. I could not believe that they would make a parody of his role). Shia&apos;s character was a guy who was ambitious but stuck with his green energy project. While any men or woman with common sense would bail on it. No, it is the right thing do. Oh, please. Now, this isn&apos;t Shia&apos;s fault. But I blame Oliver Stone for this, what happened to you. He used to be brilliant. This movie is not even a good depiction of the economic crisis the world is in right now, so it is not even enlightening. If there was one thing you could count on it was how meticulous Oliver Stone was when it comes to history and actual topics. In this film that is completely absent.\n\nI can&apos;t recommend this at all. In the first place there should have never been a sequel to Wall Street. That tale was ended. Secondly how is it possible that a sequel directed by Oliver Stone ruins the the spirit of the original one in every way it can. This is an incredible waste of time and celluloid. Don&apos;t bother.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 106249,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "12A",
  "genre": [
    "Drama"
  ],
  "datePublished": "2010-10-06",
  "keywords": "corporate greed,finance,finance industry,businessman,stocktrader",
  "duration": "PT2H13M",
  "actor": [
    {
      "name": "Shia LaBeouf",
      "url": "https://www.imdb.com/name/nm0479471/"
    },
    {
      "name": "Michael Douglas",
      "url": "https://www.imdb.com/name/nm0000140/"
    },
    {
      "name": "Carey Mulligan",
      "url": "https://www.imdb.com/name/nm1659547/"
    }
  ],
  "director": [
    {
      "name": "Oliver Stone",
      "url": "https://www.imdb.com/name/nm0000231/"
    }
  ],
  "creator": [
    {
      "name": "Allan Loeb",
      "url": "https://www.imdb.com/name/nm1615610/"
    },
    {
      "name": "Stephen Schiff",
      "url": "https://www.imdb.com/name/nm0771496/"
    },
    {
      "name": "Stanley Weiser",
      "url": "https://www.imdb.com/name/nm0007140/"
    }
  ]
}