

{
  "type": "Movie",
  "name": "Deliver Us from Eva",
  "url": "https://www.imdb.com/tt0301181/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZTVlYTAyZDMtNmQxMy00MWQ0LWFiNmEtMGQ0ODQ3NTFjYWU2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": null,
  "datePublished": "2003-02-07",
  "duration": "PT1H45M",
  "contentRating": "12",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "keywords": "latex gloves,blue jeans,hat,feel good romance,love",
  "rating": {
    "ratingCount": 7687,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6
  },
  "review": {
    "author": "nifabs",
    "dateCreated": "2003-08-08",
    "inLanguage": "English",
    "heading": "Surprisingly Warm!!!",
    "reviewBody": "Despite criticism, this manages to deliver a bit of comedy and drama. \\n\\nGabrielle Union gives a standout performance as the unbelievable Eva Dandridge who needs someone like Ray to knock her from her high horse but she&apos;s that way cos she&apos;s taken too many knocks from life. She is pure evil. \\n\\nLL Cool J is a bit too neat or not too expressive maybe it&apos;s the role maybe not but he cuts a slightly bland figure. \\n\\nBetween the two of them,they manage to create a cracking chemistry that sizzles and makes all other characters pale by comparison.\\n\\nThis movie was touching and sincere for a Black movie(a trait which is played down in most Black flicks), there&apos;s been a recent departure from the gangsta and hood epics or drugs and money flicks. \\n\\nGabrielle Union was a delight to watch as ice queen Eva Dandridge(who&apos;s been jilted by a one time-fianc\\u00e9e), watching over her sisters with a ruthless passion and closely guarding her heart against intrusion. I kinda felt sympathy when I realised she&apos;d given up on her life (when her parents died)to raise and care for her siblings, but the time came to take a backseat, she moved on and was woman enough to breach the gap she&apos;d created between her siblings and their men.\\n\\nLL Cool J was smooth as the player who took her on a bet. I admire the way he brought Eva down to earth, that&apos;s what women respect in a man. Knowing your own self worth, never kowtowing to them but meeting them at the right point and giving in only if need be. This may sound sexist but show me a sista or woman who&apos;d respect her man if he yessed to her all the time. Not One!!\\n\\nGabrielle and J simply stole the movie, the supporting cast are just supporting(no insults meant), there was no one who came close to touching the two leads not because they were the stars but they infused strength and dynamism into their respective roles, they breathed life into them...\\n\\nIt&apos;s good to see Black movies with a forte like this; it portrays us as intelligent and coming of age, which we did centuries ago anyway!!\\n\\nLEAD ME INTO THIS!!!!\\n\\n10/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "actor": [
    {
      "name": "Gabrielle Union",
      "url": "https://www.imdb.com/name/nm0005517/"
    },
    {
      "name": "LL Cool J",
      "url": "https://www.imdb.com/name/nm0005112/"
    },
    {
      "name": "Essence Atkins",
      "url": "https://www.imdb.com/name/nm0040591/"
    }
  ],
  "director": [
    {
      "name": "Gary Hardwick",
      "url": "https://www.imdb.com/name/nm0362544/"
    }
  ],
  "creator": [
    {
      "name": "James Iver Mattson",
      "url": "https://www.imdb.com/name/nm0560468/"
    },
    {
      "name": "B.E. Brauner",
      "url": "https://www.imdb.com/name/nm1135440/"
    },
    {
      "name": "Gary Hardwick",
      "url": "https://www.imdb.com/name/nm0362544/"
    }
  ]
}