

{
  "type": "Movie",
  "name": "Identity",
  "url": "https://www.imdb.com/tt0309698/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjE2NzgyNDYzNl5BMl5BanBnXkFtZTYwODM2Nzc2._V1_.jpg",
  "description": "Stranded at a desolate Nevada motel during a nasty rain storm, ten strangers become acquainted with each other when they realize that they're being killed off one by one.",
  "review": {
    "author": "SnoopyStyle",
    "dateCreated": "2014-10-09",
    "inLanguage": "English",
    "heading": "well made murder mystery and then ...",
    "reviewBody": "Psychiatrist Malick (Alfred Molina) is treating mass murderer Malcolm Rivers. It's the night before his execution and he's being transported to a hearing to determine his sanity. Meanwhile another part of the movie centers on an isolated motel. It's a torrential rainstorm in the middle of the night. George York (John C. McGinley) brings in his injured wife Alice (Leila Kenzle) and finds motel manager Larry (John Hawkes). Ed (John Cusack) the chauffeur distracted by spoiled actress Caroline Suzanne (Rebecca De Mornay) had run her over after the Yorks broke down by the side of the road. Con woman Paris (Amanda Peet) hit a telephone pole and knocks out the land line. The motel is cut off by flooding. Lou (William Lee Scott) and Ginny (Clea DuVall) are newlyweds as well as corrections officer Rhodes (Ray Liotta) who is transporting a prisoner (Jake Busey) are also stranded at the motel. The prisoner escapes and people starts dying.\n\nThe movie starts out as two related stories of a escaped killer. That is something a little bit off about the scenario but it's never quite obvious. For example, the movie doesn't need to go back to Dr. Malick if this is a simple slasher flick. The characters are all a bit specific. The total isolation seems too convenient. The movie seems to be a good B-movie with a lot of solid actors for the first two acts. Then it becomes something even more.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 265296,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.3
  },
  "contentRating": "15",
  "genre": [
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2003-06-13",
  "keywords": "motel room key,motel,murder,dissociative identity disorder,serial killer",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "John Cusack",
      "url": "https://www.imdb.com/name/nm0000131/"
    },
    {
      "name": "Ray Liotta",
      "url": "https://www.imdb.com/name/nm0000501/"
    },
    {
      "name": "Amanda Peet",
      "url": "https://www.imdb.com/name/nm0001605/"
    }
  ],
  "director": [
    {
      "name": "James Mangold",
      "url": "https://www.imdb.com/name/nm0003506/"
    }
  ],
  "creator": [
    {
      "name": "Michael Cooney",
      "url": "https://www.imdb.com/name/nm0177769/"
    }
  ]
}