

{
  "type": "Movie",
  "name": "Gomgashtei dar Aragh",
  "url": "https://www.imdb.com/tt0317226/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMGQ1ZmFlNDMtNjg4MC00NTVhLTk2MzMtOWY4YTkzOTBhMmNiXkEyXkFqcGdeQXVyNjkxOTM4ODY._V1_.jpg",
  "description": "During the war between Iran and Iraq, a group of Iranian Kurd musicians set off on an almost impossible mission. They will try to find Hanareh, a singer with a magic voice who crossed the border and may now be in danger in the Ira...",
  "review": {
    "author": "GrowingMind",
    "dateCreated": "2007-03-06",
    "inLanguage": "English",
    "heading": "Marooned In Iraq: Nomadic Kurds Heed No Political Boundaries",
    "reviewBody": "Marooned in Iraq is a story about a Kurdish father named Mirza and his two sons living in Iran who embark on a quest to find Mirza's former wife who is the one marooned in Iraq. Straight from a modern soap opera, she left Mirza for hist best friend and broke up their band in the process. Something has happened and she has sent for Mirza to help her.\n\nThe story occurs during Saddam Hussein's brutal attacks on the Kurds. During the three men's quest, there is the constant reminder of Saddam's hostility by the sounds of bombers flying overhead and a scene of a mass grave filled with massacred Kurdish men. The director is evidently making his commentary on the inhumanity shown by the ruthless dictator.\n\nAnother political statement being made by the director is on the issue of political boundaries being placed on a historically nomadic people. The Kurds have occupied what they call Kurdistan for thousands of years in the area now politically divided between the countries of Turkey, Iraq, and Iran. During a scene late in the film, Mirza simply steps on the border between Iraq and Iran as he crosses over showing that to the nomadic Kurds, they heed no boundaries.\n\nThe director does a great job of using the terrain in the backdrops of each scene making you feel like you are there. Although the film is subtitled, not every word is translated; however, you get enough to understand the conversation. The film was quite educational on the life of the Kurds and what they went through under Saddam Hussein's regime.\n\nI would recommend this film to anyone interested in the middle east, specifically the Kurds. If you don't like foreign/subtitled film, this movie is not for you. Overall, I enjoyed this film and felt it quite educational.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 1612,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.4
  },
  "contentRating": null,
  "genre": [
    "Drama",
    "War"
  ],
  "datePublished": "2002-10-09",
  "keywords": "kurdistan,iran,oppression,iraq,kurd",
  "duration": "PT1H40M",
  "actor": [
    {
      "name": "Shahab Ebrahimi",
      "url": "https://www.imdb.com/name/nm1287137/"
    },
    {
      "name": "Faegh Mohamadi",
      "url": "https://www.imdb.com/name/nm1288005/"
    },
    {
      "name": "Allah-Morad Rashtian",
      "url": "https://www.imdb.com/name/nm1288336/"
    }
  ],
  "director": [
    {
      "name": "Bahman Ghobadi",
      "url": "https://www.imdb.com/name/nm0315842/"
    }
  ],
  "creator": [
    {
      "name": "Bahman Ghobadi",
      "url": "https://www.imdb.com/name/nm0315842/"
    }
  ]
}