

{
  "type": "Movie",
  "name": "Out of Time",
  "url": "https://www.imdb.com/tt0313443/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjAxMTMzNTI5Ml5BMl5BanBnXkFtZTcwNDAwMTQ2NA@@._V1_.jpg",
  "description": "A Florida police chief must solve a vicious double homicide before he himself falls under suspicion.",
  "datePublished": "2003-12-26",
  "duration": "PT1H45M",
  "contentRating": "12A",
  "genre": [
    "Crime",
    "Drama",
    "Mystery"
  ],
  "keywords": "florida noir,woman murders a man,wife murders her husband,wife shoots her husband,adultery",
  "rating": {
    "ratingCount": 65087,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "review": {
    "author": "hitchcockthelegend",
    "dateCreated": "2012-02-29",
    "inLanguage": "English",
    "heading": "Would you have given it to me if I slept with you?",
    "reviewBody": "Out of Time is directed by Carl Franklin and written by David Collard. It stars Denzel Washington, Eva Mendes, Sanaa Lathan, Dean Cain and John Billingsley. Music is by Graeme Revell and cinematography by Theo Van de Sande.\\n\\nMatthias Whitlock (Washington) is chief of police in little Banyan Key, Florida. Respected for his work and basically honest in the line of duty. Away from work, however, his marriage to Alex (Mendes) has failed, he&apos;s having an affair with an abused wife and he likes a little drink on duty. So when his lover Anne Harrison (Lathan) springs on him the shocking news that she has been diagnosed with terminal cancer, it naturally shakes his world. But this news is merely the start of something bigger, for pretty soon Matt will be in the unusual situation of having to stay one step of his own kind or face dire consequences.\\n\\nIt&apos;s a film proudly wearing a badge of homage to film noir of the 40s. In fact it very much plays out as a contemporary riff on John Farrow&apos;s excellent Ray Milland starrer of 1948, The Big Clock. But that&apos;s fine, especially when you have some knowing craft in front and behind the camera in the shape of Franklin (Devil in a Blue Dress) and Washington (take your pick here really!). Yet as great as Franklin and Washington&apos;s work is, they all owe a debt to Collard&apos;s screenplay. Inventive in how it plays out as a plot, with it&apos;s many tight situations laid down for Washington&apos;s duped law enforcer to try and get out of, the screenplay has a knack for deft humour, often sly, which is something that even some of the hardest of noirs from the golden era are tinted with. The secret is being able to blend the humour with quality moments of suspense, and this picture manages to do that with some interest.\\n\\nFilm also benefits greatly from the tight atmosphere created by photographer de Sande. Sweaty Florida in daylight doesn&apos;t cry out as being a good starting point for an offshoot of film noir (real Florida locations were thankfully used), but the scenic beauty is never realised during the drama sequences, colours are toned down, even for a stunning red sky, and this perfectly becomes at one with a near frantic Washington as the tricksters of Banyan Key start to close in on him. It&apos;s nice too see, also, interracial couples forming the core of the story, while the dominance of sexuality is firmly given a shrewd work over by director and writer. There&apos;s good thought gone in to making this, enough to steer it away from charges of just being a faux neo-noir production.\\n\\nProblems? Yes, a few. Inevitability of outcome is hard to shake off whilst viewing it, especially for those well versed in the genre (sub-genre). Clich\\u00e9s and contrivances are stacked up like a pile of cop thriller 101 books, and Franklin goes smug (daft) by dropping in a couple of slow frame sequences that the film clearly didn&apos;t need. While the big showdown in the finale lacks a gut punch. But this is a good viewing, sexy at times and always eye catching, it also pleasingly chooses perky dialogue over action to make its dramatic point. The cast around Washington enhance the quality: Lathan in the tricky role shows a number of layered gears, Cain is imposing as a bully boy husband (where did this Cain go?) and Billingsley almost sneaks in and steals the movie as the loyal and stoic comedy side-kick.\\n\\nSo pesky flaws aside, this is a good recommendation as a night in movie for those with a kink for contemporary neo-noir. 7/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "actor": [
    {
      "name": "Denzel Washington",
      "url": "https://www.imdb.com/name/nm0000243/"
    },
    {
      "name": "Sanaa Lathan",
      "url": "https://www.imdb.com/name/nm0005125/"
    },
    {
      "name": "Eva Mendes",
      "url": "https://www.imdb.com/name/nm0578949/"
    }
  ],
  "director": [
    {
      "name": "Carl Franklin",
      "url": "https://www.imdb.com/name/nm0002083/"
    }
  ],
  "creator": [
    {
      "name": "Dave Collard",
      "url": "https://www.imdb.com/name/nm1152581/"
    }
  ]
}