

{
  "type": "Movie",
  "name": "Rugrats Go Wild",
  "url": "https://www.imdb.com/tt0337711/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOTYzMTAwNTI3MV5BMl5BanBnXkFtZTYwMzU3NTM3._V1_.jpg",
  "description": "The Rugrats get tangled in an exotic adventure, where they&apos;re helped by the Thornberrys, a family that travels the world making nature documentaries.",
  "datePublished": "2003-08-08",
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "duration": "PT1H21M",
  "keywords": "rugrats,wild thornberrys,older actors younger roles,boy wears eyeglasses,child",
  "rating": {
    "ratingCount": 8946,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2009-03-02",
    "inLanguage": "English",
    "heading": "A complete surprise overall!",
    "reviewBody": "I am 16, and like the Rugrats very much, but I love the Wild Thornberrys. I bought this two days ago, and watched it with low expectations, and boy was it a huge surprise. This was infinitely better than I expected, if not quite as good as anything to do with the Wild Thornberrys or Rugrats. My favourite characters were Spike, Nigel, Angelica and Debbie.\\n\\nFor the first time, we hear Spike talk, and he was brilliantly voiced by Bruce Willis, who put some of his previous films into this, and that was perfectly refreshing. The other voice talents were great, with great voice veterans like Nancy Cartwright, Danielle Harris and Tim Curry.I did notice though that Christine Cavanaugh, I think, was missing. It was a shame though that Curry was reduced to talking childishly for a good bit of the movie, and don&apos;t expect too much from the plot.\\n\\nThe humour was also not bad. I don&apos;t care whether it was the same as in other movies, because they did it in the other Rugrats outings, don&apos;t you remember. I loved the ever-imitated mirror sequence in the waterfall, and when Nigel hits his head and turns into a baby. There is a lot of imagination, as Angelica imagines herself as an island princess, and she is the toddler equivalent to Debbie. And the animation is true to the style of both shows, colourful and crisp, plus the time goes by quickly.\\n\\nAs for the songs, they were the weakest category of the film, but they had so many funny lyrics. The melodies were a bit uninspired, but the lyrics were a lot funnier than the overall script, which I thought had a lot of heart and humour. Plus, we get to hear Bruce Willis sing, which for me was the biggest surprise of the film, because he can actually sing.\\n\\nIn conclusion, a movie that was much better than expected. Kids will love this, and adults MIGHT probably laugh at the funny lyrics of the songs. 7/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "actor": [
    {
      "name": "Jodi Carlisle",
      "url": "https://www.imdb.com/name/nm0137627/"
    },
    {
      "name": "Lacey Chabert",
      "url": "https://www.imdb.com/name/nm0000327/"
    },
    {
      "name": "Tim Curry",
      "url": "https://www.imdb.com/name/nm0000347/"
    }
  ],
  "director": [
    {
      "name": "John Eng",
      "url": "https://www.imdb.com/name/nm0256983/"
    },
    {
      "name": "Norton Virgien",
      "url": "https://www.imdb.com/name/nm0899329/"
    },
    {
      "name": "Priit P\\u00e4rn",
      "url": "https://www.imdb.com/name/nm0681264/"
    }
  ],
  "creator": [
    {
      "name": "Kate Boutilier",
      "url": "https://www.imdb.com/name/nm0100326/"
    },
    {
      "name": "Monica Piper",
      "url": "https://www.imdb.com/name/nm0684919/"
    },
    {
      "name": "David Regal",
      "url": "https://www.imdb.com/name/nm0716366/"
    }
  ]
}