

{
  "type": "Movie",
  "name": "Sinbad: Legend of the Seven Seas",
  "url": "https://www.imdb.com/tt0165982/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTIyMzE1ODI3NF5BMl5BanBnXkFtZTYwMDE3NDc2._V1_.jpg",
  "description": "The sailor of legend is framed by the goddess Eris for the theft of the Book of Peace and must travel to her realm at the end of the world to retrieve it and save the life of his childhood friend Prince Proteus.",
  "review": {
    "author": "Dkish",
    "dateCreated": "2003-06-27",
    "inLanguage": "English",
    "heading": "Sinbad is a charming animated film with the DreamWorks edge",
    "reviewBody": "Sinbad the Sailor, probably the greatest anti-hero of the Arabian Knights, has seen many incarnations over the years. This time a new animated film from DreamWorks delves into the myth with some celebrity voices in tow.\\n\\nSinbad (Brad Pitt) is a happy pirate bent on retiring to Fiji after stealing the legendary Book of Peace. The only problem is that his childhood friend Proteus (Joseph Fiennes) stands in his way. Sinbad finds himself in a conundrum when he fails to obtain the book and ends up following his friend back to his palace where he is introduced to Proteus&apos;s future wife Marina (Catherine Zeta-Jones).\\n\\nWhen Sinbad is eventually framed by Eris (Michelle Pfeiffer), the Goddess of Chaos for stealing the Book of Peace, Proteus defends his friend for the crime. Proteus puts his life on the line so that Sinbad can sail into uncharted territory and retrieve the book. Unbeknownst to Sinbad, Marina tags along. Can Sinbad wrestle with a goddess and get through uncharted territory in time to save his friend?\\n\\nSinbad has always been an epic character and one of my favorites from classic literature and myth. He has inspired so many other multi-layered adventure characters over the years. I was first exposed to his adventures when I was a child and obsessed with seeing more movies from legendary creature creator, Ray Harryhausen. The Sinbad trilogy from Harryhausen still has a soft spot in my plethora of movie favorites. I loved the magic and vastness of worlds that inhabited Sinbad as a character.\\n\\nIt was that knowledge and foundation that made me so excited about seeing a new incarnation of a classic character. I had the same reaction when Disney re-invented `Tarzan&apos; in their animated film. I was half-hoping that there would be a great musical score like that of Disney&apos;s `Tarzan&apos; or `Aladdin&apos; but what I did end up seeing wasn&apos;t your typical animated cartoon. That was a whole new blessing unto itself.\\n\\nDreamWorks&apos;s Sinbad was definitely a whole re-envisioning of the character but also quite a bold project on its own. I loved how the film seamlessly melded standard animation and computer graphics. There hasn&apos;t been an animated film yet that has been able to make such a successful fusion. The backgrounds were utter eye-candy. I also really enjoyed how smart and delectable the dialogue was between these characters. The humor and drama were very involving and extremely enjoyable. As with every Sinbad movie, you always want to see more far off lands and more creatures. That allure and mystery is alive and well in this version.\\n\\nWhat was probably the most interesting was that this was the first time an animated film had a character fall in love with his best friend&apos;s future wife or that an executioner is ready with a giant axe to slice off a character&apos;s head. Even some of the tongue-in-cheek humor was more aimed at adults than children. I liked that because it acknowledged that you don&apos;t have to be under 12 years old to enjoy animated films.\\n\\nMy only wish for Sinbad would be that it had a grander score or a memorable song. I wanted some epic music for such a grand character. A bolder score would have made the animated film feel big enough to encompass what Sinbad is. I liked how DreamWorks used music in both `Spirit&apos; and `Road to El Dorado&apos; but seemed to have dropped the ball for this one.\\n\\nSinbad is a charming animated film with the DreamWorks edge but it needed to be bolder and bigger to do justice to such a legendary character. I just wanted more. (4 out of 5) So Says the Soothsayer.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 58995,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2003-07-25",
  "keywords": "pirate,greek goddess,evil goddess,frame up,siren",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Brad Pitt",
      "url": "https://www.imdb.com/name/nm0000093/"
    },
    {
      "name": "Catherine Zeta-Jones",
      "url": "https://www.imdb.com/name/nm0001876/"
    },
    {
      "name": "Joseph Fiennes",
      "url": "https://www.imdb.com/name/nm0001212/"
    }
  ],
  "director": [
    {
      "name": "Patrick Gilmore",
      "url": "https://www.imdb.com/name/nm1369708/"
    },
    {
      "name": "Tim Johnson",
      "url": "https://www.imdb.com/name/nm0426333/"
    }
  ],
  "creator": [
    {
      "name": "John Logan",
      "url": "https://www.imdb.com/name/nm0517589/"
    }
  ]
}