

{
  "type": "Movie",
  "name": "Shurayukihime",
  "url": "https://www.imdb.com/tt0310149/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjlhNGJkMjUtOTJhNy00NTMzLWIyZmMtNGQ5Y2EwYjU2NjQ3XkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_.jpg",
  "description": "Raised by assassins, Yuki is the last of the Takemikazuchi royal bloodline. A deadly weapon in her own right, she learns the gruesome truth about the death of her beloved mother and joins forces with a mysterious rebel leader.",
  "contentRating": "18",
  "genre": [
    "Action",
    "Sci-Fi"
  ],
  "datePublished": "2001-12-15",
  "keywords": "based on comic book,japan,katana,japanese cyberpunk,mother",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Yumiko Shaku",
      "url": "https://www.imdb.com/name/nm1139614/"
    },
    {
      "name": "Hideaki Itô",
      "url": "https://www.imdb.com/name/nm0411692/"
    },
    {
      "name": "Yôichi Numata",
      "url": "https://www.imdb.com/name/nm0637894/"
    }
  ],
  "director": [
    {
      "name": "Shinsuke Sato",
      "url": "https://www.imdb.com/name/nm0766263/"
    }
  ],
  "creator": [
    {
      "name": "Shinsuke Sato",
      "url": "https://www.imdb.com/name/nm0766263/"
    },
    {
      "name": "Kei Kunii",
      "url": "https://www.imdb.com/name/nm1165767/"
    },
    {
      "name": "Kazuo Koike",
      "url": "https://www.imdb.com/name/nm0463521/"
    }
  ],
  "review": {
    "author": "winner55",
    "dateCreated": "2006-08-06",
    "inLanguage": "English",
    "heading": "disappointing",
    "reviewBody": "once we accept that the world we're looking at is in an alternative universe that developed along the same lines as our own, the fantasy element of this film is a little easier to bear.\\n\\nunfortunately, even allowing that, the plotting is just way too heavy-handed and convoluted to be very much fun.\\n\\nthere are a lot of action scenes in this film - choreographed by the great Donnie yen - and for the most part they are well-done and very violent, which suits me fine; but they do have one big problem - Shaku Yumiko as Yuki - she doesn't know how to fight.\\n\\nbeing a long sword best used held with both hands, the katana, or samurai sword, requires the body's complete and focused energy. in some styles, you swing it from the hips, in others from the back-bone; but if you have to swing it from the shoulder, you better have strong legs, because that's where the energy is really going to come from. if you swing from the shoulder alone, with no chi flowing from other parts of the body, you might as well be swinging a broom - definitely not the single lethal stroke the katana is designed to accomplish.\\n\\nwell, but that's what she does - she swings her katana from the shoulders. no wonder she gets banged around so much in this movie.\\n\\nthis can't be yen's fault, he's too well versed in traditional fighting techniques; and the other performers do fines. i think we're just stuck here with a young actress who lacks confidence. to some extent, that wouldn't even be her fault. no, it's the casting director, the producer, and the director who must take the blame for this one.\\n\\nfrom the synopsis, i was expecting much more; instead, i got much less.\\n\\nby the way, she doesn't act all that convincingly either.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 3079,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  }
}