

{
  "type": "Movie",
  "name": "Man on the Train",
  "url": "https://www.imdb.com/tt1646922/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzUwZjY4Y2UtNTRiNy00MTcyLWI1MjQtMzIzNTEyMGUzZmZhXkEyXkFqcGdeQXVyMDAwMDg2MQ@@._V1_.jpg",
  "description": "A criminal arrives in a small town and plans to rob the local bank. But when he arrives, he meets a retired professor, and his plans change unexpectedly. The professor lets the thief live in his home, and a troubled friendship arises between the two.",
  "review": {
    "author": "ninaerchy",
    "dateCreated": "2023-03-13",
    "inLanguage": "English",
    "heading": "Dear fellow IMDB-er, just skip it dude!",
    "reviewBody": "Dear god this movie was almost unwatchable to me. There are scenes so cringy you feel embarrassed to watch it.\\n\\nBut I saw many good reviews here and I said to myself ,, I will check it out, I will stick around until its end, there must be something people liked so much,,.\\n\\nSo I started watching it and already in the beginning Sutherland being dumb old jolly man almost caused me to stop watching that&apos;s how much cringy it was to watch him giggling all the time as a character of such low emotional intelligence ughhh This other younger guy that old guy met on a train was even worse. Totally below average robber guy who supposedly starts admiring the old man and his attentive listening during his ,,change,, is horrible to watch. Even when he&apos;s supposed to ,,realize,, something and grow he still has that dumb expression that&apos;s just annoying. But he&apos;s trying very hard to sound wise and serious. Yuck.\\n\\nThey look like dumb and dumber.\\n\\nOmg and that sound quality is to barf, in some scenes background music is so much louder than actors voices it&apos;s hard to follow what they are saying while standing face to face so close you feel embarrassed to watch them.\\n\\nI mean irresponsible from producers to just leave it like that in a movie, even after sound checks that are supposed to be made before releasing the movie, just plain stupid.\\n\\nAnd the chemistry between main two characters; just awfully awkward for god&apos;s sakes sometimes you as a watcher are not even able to tell if they are just friendly with each other or are actually flirting (as two gays in the closet).\\n\\nOh and listen to this; Younger guy is calm and serious, and an old guy is immature and goofy ughhhh.\\n\\nLook I don&apos;t know what else to tell you dear fellow Imdb-er who&apos;s reading this review, I didn&apos;t like it one bit man (or a woman ).\\n\\nThis movie felt made in a hurry , low quality, badly directed, cheap...\\n\\nBest way to describe it is telling you to imagine you have a serious movie plot to film but with cheap porno stars who are trying to switch their acting genre.\\n\\nSkip it. Run away.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 2
    }
  },
  "rating": {
    "ratingCount": 755,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.4
  },
  "contentRating": "PG-13",
  "genre": [
    "Crime",
    "Drama"
  ],
  "datePublished": "2011-10-28",
  "keywords": [
    "professor",
    "bank robber",
    "befriending",
    "philosophical discussion",
    "living life of someone else"
  ],
  "duration": "PT1H40M",
  "actor": [
    {
      "name": "Donald Sutherland",
      "url": "https://www.imdb.com/name/nm0000661/"
    },
    {
      "name": "Larry Mullen Jr.",
      "url": "https://www.imdb.com/name/nm0611979/"
    },
    {
      "name": "Graham Greene",
      "url": "https://www.imdb.com/name/nm0001295/"
    }
  ],
  "director": [
    {
      "name": "Mary McGuckian",
      "url": "https://www.imdb.com/name/nm0570082/"
    }
  ],
  "creator": [
    {
      "name": "Patrick Cauvin",
      "url": "https://www.imdb.com/name/nm0460104/"
    },
    {
      "name": "Mary McGuckian",
      "url": "https://www.imdb.com/name/nm0570082/"
    }
  ]
}