

{
  "type": "Movie",
  "name": "The Holy Land",
  "url": "https://www.imdb.com/tt0283387/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNGNhYWY1OTEtMTg3OS00OGRkLTgyZGMtZWFkMDYyNTc3NDc5XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
  "description": "Mendy is a young man struggling to keep his mind focused on rabbinical school. His teacher tells him to rid himself of desires by visiting a prostitute in Tel Aviv. Mendy falls head over heels in love with a Russian harlot named S...",
  "review": {
    "author": "Quinoa1984",
    "dateCreated": "2003-08-19",
    "inLanguage": "English",
    "heading": "Occasional intrigue in the performances and atmosphere of life in modern day Jerusalem...",
    "reviewBody": "...but first time writer/director Eitan Gorlin, adapting from his own play, takes too much for granted in the destinies of his characters, a rabbinical student and a Russian prostitute, as well as for the supporting players. There could be so much that could happen to these characters, so many different turns they could take in their relationship, and while it unfolds as something that's somewhat acceptable, it contains an outcome that's a too pre-ordained. \\n\\nThe set-up has minor promise- a rabbinical student is told by his teacher that he should let off some steam, so to speak, by paying a trip to a whorehouse around in Tel Aviv before completely immersing himself in his studies (to get it out of his system). He meets a prostitute, and a Mike, a drunk who owns a bar in Jerusalem and who also gives a place to live for his girl as, soon enough, as well as for the student. Eventually, the student works as a bartender, meets the locals, the radicals, and sees for himself what it's like in such a landscape. Among this, an amicable, though non-sexual relationship commences with the the two opposites- the student awkward and introspective and the prostitute sarcastic and (when she needs to be) emotional. \\n\\nI can't say that I hated the Holy Land, because there seemed to be a earnest urgency to show, in good intentions, what it's like in the city against the thinking of Americans of the region. It's dangerous terrain, but it's not like how the media here portrays it exactly. And while our lead character comes of age by drinking and smoking and being among these people and all that, he leaves without much of a change in him, or towards the girl he has admired and adored for the length of the picture. In other words, it may be pretty hard to care about these people as much as Gorlin wants us to, and it's evident that it gets too conventional for its own good (the ending, especially, seems like it has a need for closure that it shouldn't of had). Grade: C",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 268,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "R",
  "genre": [
    "Drama"
  ],
  "datePublished": null,
  "keywords": "female nudity,female rear nudity,female full frontal nudity,prostitute,love",
  "duration": "PT1H42M",
  "actor": [
    {
      "name": "Oren Rehany",
      "url": "https://www.imdb.com/name/nm1150647/"
    },
    {
      "name": "Tchelet Semel",
      "url": "https://www.imdb.com/name/nm0783759/"
    },
    {
      "name": "Saul Stein",
      "url": "https://www.imdb.com/name/nm0825627/"
    }
  ],
  "director": [
    {
      "name": "Eitan Gorlin",
      "url": "https://www.imdb.com/name/nm1148912/"
    }
  ],
  "creator": [
    {
      "name": "Eitan Gorlin",
      "url": "https://www.imdb.com/name/nm1148912/"
    }
  ]
}