

{
  "type": "Movie",
  "name": "The League of Extraordinary Gentlemen",
  "url": "https://www.imdb.com/tt0311429/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZTFlOTdkMjEtNGVmMS00YTA3LThlNjQtMjAzZmFjZDAzNjllL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "In an alternate Victorian Age world, a group of famous contemporary fantasy, science fiction, and adventure characters team up on a secret mission.",
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "datePublished": "2003-10-17",
  "keywords": "library,year 1899,steampunk,mina murray character,the invisible man character",
  "duration": "PT1H50M",
  "rating": {
    "ratingCount": 183127,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "review": {
    "author": "brad12d3",
    "dateCreated": "2003-12-25",
    "inLanguage": "English",
    "heading": "It's a fun movie don't take it too seriously though.",
    "reviewBody": "One of the biggest complaints people seem to make about movies is it's unbelievability. I am a huge movie buff, and I can't help but to critique a movie while I am watching it. Now if I am watching a movie that is supposed to be based on a true story or is meant to depict real situations.. or really anything that is meant to be taken seriously, I will be very picky about details and how it was done. However, I understand that there are movies that are made strictly to be fun. L.O.E.G. is not Schindler's List, it is meant to be entertaining.. (eye candy as some would put it), so to say that you didn't like it because the plot or simply the things they did or had were unbelievable seems very strange to me considering that it is based on some of the most unbelievable but well liked fictional characters we have known. So it is believable that an invisible man, a vampire, a man that can suddenly change physical form to become a giant beast joining forces with a few other people included is believable,... but giving them extraordinary technology and putting them in extraordinary situations is going to far? If you don't like these kind of movies then don't watch them.... I however do enjoy watching movies with cool special effects, as well as the more serious and artistic films. The movie delivered what it was meant to deliver, and that is some very stunning visuals,... come on really,.. what did you expect? League is a fun movie to watch, it's not going to be nominated for Best Picture or anything like that, but if your looking to escape reality and experience a quite stunning fantasy world with some pretty cool characters then you might rent it. Not too bad.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 183127,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "actor": [
    {
      "name": "Sean Connery",
      "url": "https://www.imdb.com/name/nm0000125/"
    },
    {
      "name": "Stuart Townsend",
      "url": "https://www.imdb.com/name/nm0870204/"
    },
    {
      "name": "Peta Wilson",
      "url": "https://www.imdb.com/name/nm0933959/"
    }
  ],
  "director": [
    {
      "name": "Stephen Norrington",
      "url": "https://www.imdb.com/name/nm0635759/"
    }
  ],
  "creator": [
    {
      "name": "Alan Moore",
      "url": "https://www.imdb.com/name/nm0600872/"
    },
    {
      "name": "Kevin O'Neill",
      "url": "https://www.imdb.com/name/nm1171463/"
    },
    {
      "name": "James Robinson",
      "url": "https://www.imdb.com/name/nm0732702/"
    }
  ]
}