

{
  "type": "Movie",
  "name": "X2",
  "url": "https://www.imdb.com/tt0290334/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDk0NjYxMzIzOF5BMl5BanBnXkFtZTYwMTc1MjU3._V1_.jpg",
  "description": "When anti-mutant Colonel William Stryker kidnaps Professor X and attacks his school, the X-Men must ally with their archenemy Magneto to stop him.",
  "review": {
    "author": "MinorityReporter",
    "dateCreated": "2005-12-12",
    "inLanguage": "English",
    "heading": "Another X-ellent movie!",
    "reviewBody": "Some people would tell you that X2 is more conventional and mainstream than the first movie and to that I can only say: What a load of rubbish! Not only does X2 continue in the style set by the first film but it also improves on it greatly. This is achieved by adding more characters, making a deeper story and making the ever expanding universe even more chaotic so as better to capture the essence of the comic book. Two thumbs way up! The story picks up after the events of the first film in a way that pleases the viewers of the first film and is satisfactory to new viewers. The story is still well written and the pacing has improved a lot from the first film. There are no real slow points during the movie and the director takes special care to cram many of the scenes with breath taking visual effects so the audience will never lose interest. The dialog is once again both very sharp and witty and intelligent and allows for adequate character development. The character development is something some people have seen fit to criticize as they claim there isn't enough of it and except for only two characters I whole heartedly disagree. The character development of the main characters happened pretty much in the first film and therefore it is only necessary to add a bit more depth to the characters instead of repeating the character development from the first film. I did feel, however, that the film seemed somewhat rushed at times and that is a shame as it definitely had potential to be a 2½ hour film.\\n\\nThe acting is still sublime and I, of course, have to emphasize Hugh Jackman who is still absolutely brilliant as Wolverine. Both in bringing out the animal sides during the fight sequences but also in keeping the character human like in the comics. Ian McKellen returns as well and further fleshes out his character of Magneto and makes the character every bit as devious and charismatic as in the previous film. Patrick Stewart returns as well and does what he did in the first film and he is still the only one who could play Xavier. Among the new actors are Brian Cox and Alan Cumming. Cox does what he does best and plays the new villain with the exaggerated style he usually does. Cumming on the other hand shows remarkable depth as Nightcrawler and is in spite of his appearance one of the most human characters in the film. I will miss him in the third film. Lets hope Beast is any bit as good as in the comics. Some have had their characters lessened in the sequel. Most notably James Marsden while Famke Jansen's character is developed further. Halle Berry's character Storm is still kept in the background but I'm sure she will get more screen time in the third film. Aside from the ones I have now mentioned the acting is quite good all round.\\n\\nAction wise the film took a major step up from the first film and many of the action scenes are quite simply awesome. We get to see more of Wolverine's feral rage which is always worth a look. All fights scenes with Wolverine are awesome and some of the most entertaining I've seen. Also we get a brief glimpse of Collosus kicking some ass and he does look cool I must say. In fact many of the individual mutants' powers are fleshed out in X2 and like in the original X-Men film they look absolutely beautiful. My only concern regarding the effects and action scenes is how on earth they are going to top them in the coming third X-Men film.\\n\\nIn regards to music and sound the film improved upon the first film with a much more catchy soundtrack and more audible effects. For example the sounds of Wolverine's claws shooting out and retracting have been amplified making him even more menacing than he was in the first film. Very well done.\\n\\nAll in all X2 is an excellent continuation of the original film and we are nearing something that is more like a saga than a series of films. I'm really beginning to see Bryan Singer as a master director after these two brilliant films and I am a little sad he opted to do Superman Returns rather than finish what he started with the X-Men films.\\n\\n8/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 572531,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.4
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Sci-Fi",
    "Thriller"
  ],
  "datePublished": "2003-05-01",
  "keywords": "shapeshifter,shapeshifting,adamantium,intolerance,healing factor",
  "duration": "PT2H14M",
  "actor": [
    {
      "name": "Patrick Stewart",
      "url": "https://www.imdb.com/name/nm0001772/"
    },
    {
      "name": "Hugh Jackman",
      "url": "https://www.imdb.com/name/nm0413168/"
    },
    {
      "name": "Halle Berry",
      "url": "https://www.imdb.com/name/nm0000932/"
    }
  ],
  "director": [
    {
      "name": "Bryan Singer",
      "url": "https://www.imdb.com/name/nm0001741/"
    }
  ],
  "creator": [
    {
      "name": "Zak Penn",
      "url": "https://www.imdb.com/name/nm0672015/"
    },
    {
      "name": "David Hayter",
      "url": "https://www.imdb.com/name/nm0371684/"
    },
    {
      "name": "Bryan Singer",
      "url": "https://www.imdb.com/name/nm0001741/"
    }
  ]
}