

{
  "type": "Movie",
  "name": "A Merry Friggin' Christmas",
  "url": "https://www.imdb.com/tt0910885/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTk1NDQ4MzE4Nl5BMl5BanBnXkFtZTgwNTU2NjY5MjE@._V1_.jpg",
  "description": "Boyd Mitchler and his family must spend Christmas with his estranged family of misfits. Upon realizing that he left all his son's gifts at home, he hits the road with his dad in an attempt to make the 8-hour round trip before sunrise.",
  "review": {
    "author": "JayShermanStinksYoooooo1920",
    "dateCreated": "2014-11-30",
    "inLanguage": "English",
    "heading": "One of our captain's last movies is truly awful.",
    "reviewBody": "I know you're only paying attention to this movie because of one of the greatest actors and comedians of all time, who recently died (Robin Williams if you didn't know) is in it. That's the only reason I even watched this Christmas comedy. Or, I'm actually a fan of some Christmas movies like Christmas Vacation, A Christmas Story, Miracle on 34th Street and I even thought Jingle All The Way kind of worked. However, A Merry Friggin Christmas is a poorly made comedy with a very bad cast. I like most of the actors in the film like Clark Duke , but they all did an awful job. The absolute horrible script. doesn't really help.\n\nThe story centers around a father who accidentally leaves all his son's Christmas presents at home, and attempts to make the 8-hour round trip before sunrise to get the presents, with his dad who's played by Robin Williams. Since I grew up with Robin Williams, I had to watch this. His death hit me so hard even though I never knew him or met him. I ignored the awful plot at first, but everything is just so bad about this film.\n\nThe main problem is that it's supposed to be a comedy with a few touching moments. I can't remember laughing while watching this. All the jokes were either very childish or just dumb. I don't think Robin Williams improvised any of his lines in this film, because I have never watched a movie with him there I didn't laugh at least twice. Since you weren't introduced to the characters in this comedy at all, you didn't really care about them.\n\nThis is just an awful Christmas movie everyone should at least try to avoid. I'm giving the movie a 3/10 because I still thought it was nice to see Robin Williams and Oliver Platt (who also starred together in the very good sci-fi film Bicentennial Man). Except for that, there's nothing worth mentioning here. The last years of Robin Williams consisted of poorly made comedies (except for a few movies like World's Greatest Dad), and A Merry Friggin Christmas just proves it.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 8221,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.2
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2014-11-22",
  "keywords": "christmas,road trip,santa claus,christmas present,father son relationship",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Joel McHale",
      "url": "https://www.imdb.com/name/nm0570364/"
    },
    {
      "name": "Lauren Graham",
      "url": "https://www.imdb.com/name/nm0334179/"
    },
    {
      "name": "Clark Duke",
      "url": "https://www.imdb.com/name/nm0241173/"
    }
  ],
  "director": [
    {
      "name": "Tristram Shapeero",
      "url": "https://www.imdb.com/name/nm0788426/"
    }
  ],
  "creator": [
    {
      "name": "Phil Johnston",
      "url": "https://www.imdb.com/name/nm1601882/"
    }
  ]
}