

{
  "type": "Movie",
  "name": "Happy Christmas",
  "url": "https://www.imdb.com/tt2955096/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4MTY5NDAwM15BMl5BanBnXkFtZTgwNTUwOTEwMjE@._V1_.jpg",
  "description": "After a break up, Jenny moves in with writer Kelly, her filmmaker husband, and their child. Despite a rocky start, Jenny&apos;s influence helps Kelly realize that an evolution in her life, career and relationship is necessary for her h...",
  "review": {
    "author": "ArchonCinemaReviews",
    "dateCreated": "2014-12-23",
    "inLanguage": "English",
    "heading": "Mundane and boring for most non-indie fans",
    "reviewBody": "Happy Christmas was made with only three film crew members, not including the director, in case you were curious the level of &apos;indie-ness&apos; in this film.\\n\\nJoe Swanberg writes, directs and stars in Happy Christmas, the ensemble indie film that touches on the real life minor predicament that occurs during the holiday.\\n\\nRecently broken up with her boyfriend, Jenny decides to crash at her brother Jeff&apos;s and his wife Kelly&apos;s house in Chicago while she considers laying roots in the city for a change of pace. She drinks and smokes away her sadness while she desperately tries to distract herself, coping terribly while hanging out with her old friend Carson and new friend Kevin.\\n\\nHappy Christmas is a film for fans of the typical indie genre film. It utilizes real life cinematography and puts a microscope to the real life problems within the mundanities of life. This is not some film about profound transformation or extraordinary circumstances. In fact, Happy Christmas is so ordinary in its subject matter that 20-something viewers should see themselves or their friends in this film.\\n\\nIf you, as a typical movie viewer, enjoy to put a mirror to real everyday life then you should give this film a shot. If you typically watch films to escape or put yourself into a film beyond your routine existence, then you should stay away, far away.\\n\\nHappy Christmas is a grainy film to watch, and was probably not shot in 1080p and then upscaled. this yields a mildly pixelated appearance which is nauseating on anything larger than a computer screen. Most of the film appears to be shot using hand-held or a steadicam operator which is extremely distracting as the film sight line moves along the edges of the frame. My guess is the techniques employed for the cinematography of Happy Christmas were deliberate to truly capture the reality in vision.\\n\\nThough Joe Swanberg is listed as the screenwriter of the film it seems as though most of the dialogue was improv-ed, and poorly. Mark Webber who plays Kevin and Anna Kendrick who plays the self-destructive Jenny are the most natural and believable of the bunch. Otherwise the scenes are stiff and slow with a lot of awkward pauses from the dull and banal conversation topics. The star of the film is baby Jude, real life son of director Joe Swanberg, who is so comfortable and natural that you can&apos;t help but be enamored by his energy, alas if only the whole film was like him.\\n\\nHappy Christmas is a narrative nonevent of a film that will be contemptibly boring to some and realistically introspective to others.\\n\\nPlease check out our WEBSITE for all the reviews of the recent releases.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 8849,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.4
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2014-06-26",
  "keywords": "alcoholic,family relationships,written by director,husband wife relationship,toddler",
  "duration": "PT1H22M",
  "actor": [
    {
      "name": "Anna Kendrick",
      "url": "https://www.imdb.com/name/nm0447695/"
    },
    {
      "name": "Melanie Lynskey",
      "url": "https://www.imdb.com/name/nm0001491/"
    },
    {
      "name": "Mark Webber",
      "url": "https://www.imdb.com/name/nm0916406/"
    }
  ],
  "director": [
    {
      "name": "Joe Swanberg",
      "url": "https://www.imdb.com/name/nm1846132/"
    }
  ],
  "creator": [
    {
      "name": "Joe Swanberg",
      "url": "https://www.imdb.com/name/nm1846132/"
    }
  ]
}