

{
  "type": "Movie",
  "name": "I Origins",
  "url": "https://www.imdb.com/tt2884206/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOTc4NWJjYTctZDhjOS00Y2MyLWEwYWYtNDVmYmJhN2VlYzU5XkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
  "description": "A molecular biologist and his laboratory partner uncover evidence that may fundamentally change society as we know it.",
  "review": {
    "author": "michellamoss",
    "dateCreated": "2014-12-13",
    "inLanguage": "English",
    "heading": "Absolutely original, and very powerful",
    "reviewBody": "We watch at least 4 or 5 movies every week, and I have to say that this is the best film I&apos;ve seen in a long time. Brit Marling seems to choose her films very carefully, and I&apos;m coming to suspect that anything she&apos;s involved in is going to be different, and very well done.\\n\\nThis film is inspiring - not just because of it&apos;s content, but because of the way it&apos;s made. Hollywood can NOT make films like this. They can do a lot of things, but they can&apos;t seem to write scenes, scenarios, and certainly not dialog like this. This feels like real life, and because of this, it really effects you and draws you in. You really get to know, understand and care about the characters, in a way that just doesn&apos;t seem to happen in &apos;Hollyweird&apos; films.\\n\\nI don&apos;t want to go into any detail about the film here. I just want to say that it is truly amazing, unpredictable, beautiful, powerful and worth your time.\\n\\nIMPORTANT: Be sure not to turn it off as the credits roll - there&apos;s a great little additional scene at the very end, which ads another dimension to the way the story wraps up.\\n\\nTruly excellence in film making. If there were more writer/directors like this, the world would be a better place. He makes us think and challenges us. Truly inspirational.\\n\\nMy highest recommendation.\\n\\nWill Middle of NowHere, in some snowy, remote Canadian mountains",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 132831,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.3
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Mystery",
    "Romance"
  ],
  "datePublished": "2014-09-25",
  "keywords": "eye,evolution,reincarnation,worm,elevator",
  "duration": "PT1H46M",
  "actor": [
    {
      "name": "Michael Pitt",
      "url": "https://www.imdb.com/name/nm0685856/"
    },
    {
      "name": "Steven Yeun",
      "url": "https://www.imdb.com/name/nm3081796/"
    },
    {
      "name": "Astrid Berg\\u00e8s-Frisbey",
      "url": "https://www.imdb.com/name/nm2793591/"
    }
  ],
  "director": [
    {
      "name": "Mike Cahill",
      "url": "https://www.imdb.com/name/nm2648685/"
    }
  ],
  "creator": [
    {
      "name": "Mike Cahill",
      "url": "https://www.imdb.com/name/nm2648685/"
    }
  ]
}