

{
  "type": "Movie",
  "name": "Mega Shark vs. Mecha Shark",
  "url": "https://www.imdb.com/tt3152098/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQzMDIyMjgxMF5BMl5BanBnXkFtZTgwODYzNjg4MDE@._V1_.jpg",
  "description": "A new mega shark threatens to destroy humanity. The government creates an exact robotic copy of the shark, either equal to or greater than the original. Now they must fight to the death while people and whole cities get in the way.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2014-02-14",
    "inLanguage": "English",
    "heading": "The best of the Mega Shark trilogy, doesn&apos;t ever get better than reasonably fun though",
    "reviewBody": "The Mega Shark movies are the kind that aren&apos;t to be expected much from, but even with that in mind I personally didn&apos;t consider Giant Octopus or Crocosaurus particularly good, some fun moments, mostly for the so-bad-it&apos;s-good value there was, but mostly they were too amateurish and ridiculous to take it even for what they were. Mecha Shark is the best of the three but from personal opinion it was only passable. It is the best-looking of the trilogy definitely, the scenery is very nice as well as the underwater shots and the editing is reasonable. The score is catchy and in a way drives the movie rather than bog it down. The special effects are better than average if not great, a huge improvement on its predecessors anyhow(and I&apos;d go as far to say that much of the underwater stuff was quite good), sure there are a few ropey ones here and there. Much of the acting is not bad at all despite not having very strong material to work with, the playing-it-straight approach is adopted and it suits the movie just fine, doing it without going through the motions. Elisabeth Rohm and Christopher Judge are commanding leads. And the last act is a lot of fun, the pace is snappier and while inevitably predictable some of it is amusing and at times endearingly silly. There is an exception regarding the acting and that is Deborah Gibson in her brief appearance, if she had a bigger role she would have come across as less phoned in. The characters are not annoying as such but are not very interesting, and that is including the shark who is more goofy than menacing. The script mistakes insultingly cheesy for snappy, the jargon is really stilted too and a lot of scenes have dialogue and voice-overs that over-explain things. If there was one word to describe the script, bloated would be it. The concept was ridiculous in the first place, but two thirds of Mecha Shark is rather indifferent until the last act really picks up. That it&apos;s predictable is to be expected, but the suffocating pacing, lack of tension or suspense and scenes that are very derivative, with a few parts reminiscent of those from its predecessors(like the mid-air leap jet chomp from Giant Octopus) but also reading too much of inferior copies. They were mildly fun previously while making you feel stupid at the same time, here they were just tired. All in all, at best it&apos;s reasonably fun and it is easily the best of the Mega Shark trilogy. But while it is a significant improvement technically and acting-wise, there could have been room to have more fun and the improvement does not translate into the writing department, with a sense of not just trying to do too much but also feeling very bland and indifferent. 4/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 3422,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 2.6
  },
  "contentRating": "Not Rated",
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2014-01-28",
  "keywords": "robot,robot sci fi,psychotronic film,underwater scene,kaiju",
  "duration": "PT1H25M",
  "actor": [
    {
      "name": "Christopher Judge",
      "url": "https://www.imdb.com/name/nm0431895/"
    },
    {
      "name": "Elisabeth R\\u00f6hm",
      "url": "https://www.imdb.com/name/nm0737533/"
    },
    {
      "name": "Matt Lagan",
      "url": "https://www.imdb.com/name/nm0969523/"
    }
  ],
  "director": [
    {
      "name": "Emile Edwin Smith",
      "url": "https://www.imdb.com/name/nm0808136/"
    }
  ],
  "creator": [
    {
      "name": "H. Perry Horton",
      "url": "https://www.imdb.com/name/nm4437450/"
    },
    {
      "name": "Jose Prendes",
      "url": "https://www.imdb.com/name/nm0695977/"
    }
  ]
}