

{
  "type": "Movie",
  "name": "Night at the Museum: Secret of the Tomb",
  "url": "https://www.imdb.com/tt2692250/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI1MzM2ODEyMV5BMl5BanBnXkFtZTgwNTIzODAwMzE@._V1_.jpg",
  "description": "Larry spans the globe, uniting favorite and new characters while embarking on an epic quest to save the magic before it's gone forever.",
  "review": {
    "author": "rprince-832-6294",
    "dateCreated": "2014-12-27",
    "inLanguage": "English",
    "heading": "Not fantastic, but very fun!",
    "reviewBody": "-Secret of the Tomb is the third and final installment of the Night At The Museum series, and this time the tablet's power is running out and the gang must go to the British Natural History Museum to try to find answers and save the gang! -For a film with some flaws that I noticed, it was honestly pretty fun! And that's what really matters in this, because it's for families, not Oscars.\\n\\n-The story is rushed and doesn't make much sense or hold much weight in the film honestly.\\n\\n-The pace is not bad. It doesn't waste time, but it does drag once or twice.\\n\\n-The acting is meh. I feel like Ben Stiller didn't try that hard, along with some of the supporting cast. A few others however, Robin Williams and Lancelot, are great! -The characters are cheesy, but they are not meant to be super deep, serious people. It's a fun film guys.\\n\\n-The effects range from questionable-to-good, but not Oscar worthy.\\n\\n-The music is good, but really a repeat of the first film.\\n\\n-I will say what makes it good and fun is that it feels more like the first film! It is adventurous and sometimes tearjerking, but still fun throughout.\\n\\n-It is rated PG, so yeah.\\n\\n-So although it has some major cheese and doesn't let up on a pointless story, Night At The Museum 3 is still fun and surprisingly heartwarming. I don't know if it is worth running out to see, but it is definitely worth getting in a $5 bin! I would give it a good 7/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 134315,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "PG",
  "genre": [
    "Adventure",
    "Comedy",
    "Family"
  ],
  "datePublished": "2014-12-19",
  "keywords": [
    "night watchman",
    "museum of natural history manhattan new york city",
    "star died before release",
    "gay subtext",
    "homosexual subtext"
  ],
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Ben Stiller",
      "url": "https://www.imdb.com/name/nm0001774/"
    },
    {
      "name": "Robin Williams",
      "url": "https://www.imdb.com/name/nm0000245/"
    },
    {
      "name": "Owen Wilson",
      "url": "https://www.imdb.com/name/nm0005562/"
    }
  ],
  "director": [
    {
      "name": "Shawn Levy",
      "url": "https://www.imdb.com/name/nm0506613/"
    }
  ],
  "creator": [
    {
      "name": "David Guion",
      "url": "https://www.imdb.com/name/nm1115862/"
    },
    {
      "name": "Michael Handelman",
      "url": "https://www.imdb.com/name/nm1911349/"
    },
    {
      "name": "Mark Friedman",
      "url": "https://www.imdb.com/name/nm0295296/"
    }
  ]
}