

{
  "type": "Movie",
  "name": "Oculus",
  "url": "https://www.imdb.com/tt2388715/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMzE1NzM4MjEyNV5BMl5BanBnXkFtZTgwMjYzMjMzMTE@._V1_.jpg",
  "description": "A recently released inmate from a mental asylum learns from his sister that the murders he was convicted of committing were actually orchestrated by a supernatural entity, the Lasser Glass mirror.",
  "review": {
    "author": "samuellop10",
    "dateCreated": "2014-04-12",
    "inLanguage": "English",
    "heading": "Effective trip into psychological horror",
    "reviewBody": "21 year old Tim Russell is released from a mental institution.That same week his older sister is able to get a few days alone with the Lesser mirror. Kaylie, the sister, decides to take the mirror back to their old house, where unspeakable horrors unfolded during their childhood shortly after they moved to the back-then-new-house, and their father bought the infamous mirror. Kaylie is convinced the mirror is haunted: the mirror being some sort of evil supernatural being. Tim, on the other hand, has grown completely skeptic about the supernatural aspect of the mirror, believing his sister only holds on to that notion simply to have a way to cope with the horrific events of their childhood. Needless to say, the mirror does seem haunted, and as the night progresses for the adult siblings, the door to those memories open up, revealing more and more those events which both are trying to move on from; albeit in very different ways. These two timelines (their childhood and their present-day adult selves) unfold in a parallel manner, with the ending of the film culminating the two timelines&apos; climaxes together. \\n\\nOne of the things the film gets right is the acting. Both Karen Gillian and Brenton Thwaites do a very decent job in portraying the adult version of the siblings. Their children counterparts also do an impressive work in portraying two small, terrified brother and sister with no one to turn to for help, slowly accepting the fact that they are both alone against the mirror.\\n\\nThe second good thing about it is the staging of the story. Although the concept is nothing new or original, the execution of such concept is both new and original. This injects a healthy dose of re-freshens and also a decent amount of unexpectedness to the film. Both helping in making this horror film one in which the audiences are actually engaged and interested in what will happen next, and at the same time they can have fun in the direction the story advances to. \\n\\nA neutral element in it is the way they decided to unfold both story-lines (past and present). Like mentioned above, both of them move forward hand-in-hand, with various parallels presenting themselves in the way of flashbacks from both siblings. While this works wonderfully in the first half of the film, the second half of it loses a good chunk of the excitement which this sort of narrative added to the first half. That is not to say however, that it hurts it, but by the ending it just feels it needed to continue this way to explain what had happened, rather than using it to strengthen the present events.\\n\\nMore personally speaking, the ending felt rather frustrating and just almost unimaginative. While the final events fit into the pattern of what the mirror does, it feels like it should have had a more surprising ending due to the excellent build-up the film provides in the first two-thirds. The moment when the final twist happens, it is shocking, with everything falling into place seconds later, only to add more shock to what happens. However, moments later the feeling of shock is quickly replaced by one of been-there-done-that, leaving the audience feeling that there should have been more to it, rather than it being so simple and straight-forward. \\n\\nIf you are expecting an explanation for what the mirror really is, what entity it holds, or how it came to be, you will be disappointed. If you are rather more interested in the how (instead of the why&apos;s or what&apos;s of the mirror) you will feel more satisfied. The focus of the film is in tricking its characters, and along with them the audience as well. The story is very effective in messing with one&apos;s psyche, making one actually wonder what is actually happening to the characters, and what is fake and just a product of the mirror. \\n\\nOverall, adjust your expectations into knowing that this film is good, but it does not redefine the genre in the slightest. It does feel refreshing, but other than in its execution, there is nothing new to see here. The movie is fun and unexpected (something very few recent horror movies can say), so with everything else, it is definitely an enjoyable ride as a whole.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 138862,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "15",
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2014-06-13",
  "keywords": "mirror,brother sister relationship,trauma,released from a mental hospital,supernatural horror",
  "duration": "PT1H44M",
  "actor": [
    {
      "name": "Karen Gillan",
      "url": "https://www.imdb.com/name/nm2394794/"
    },
    {
      "name": "Brenton Thwaites",
      "url": "https://www.imdb.com/name/nm4154798/"
    },
    {
      "name": "Katee Sackhoff",
      "url": "https://www.imdb.com/name/nm0755267/"
    }
  ],
  "director": [
    {
      "name": "Mike Flanagan",
      "url": "https://www.imdb.com/name/nm1093039/"
    }
  ],
  "creator": [
    {
      "name": "Mike Flanagan",
      "url": "https://www.imdb.com/name/nm1093039/"
    },
    {
      "name": "Jeff Howard",
      "url": "https://www.imdb.com/name/nm3670452/"
    },
    {
      "name": "Jeff Seidman",
      "url": "https://www.imdb.com/name/nm1529699/"
    }
  ]
}