

{
  "type": "Movie",
  "name": "Sin City: A Dame to Kill For",
  "url": "https://www.imdb.com/tt0458481/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjA5ODYwNjgxMF5BMl5BanBnXkFtZTgwMTcwNzAyMjE@._V1_.jpg",
  "description": "Some of Sin City's most hard-boiled citizens cross paths with a few of its more reviled inhabitants.",
  "contentRating": "18",
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "datePublished": "2014-08-25",
  "keywords": [
    "punched repeatedly",
    "male nudity",
    "torture",
    "facial scar",
    "talking on a phone while having sex"
  ],
  "duration": "PT1H42M",
  "actor": [
    {
      "name": "Mickey Rourke",
      "url": "https://www.imdb.com/name/nm0000620/"
    },
    {
      "name": "Jessica Alba",
      "url": "https://www.imdb.com/name/nm0004695/"
    },
    {
      "name": "Josh Brolin",
      "url": "https://www.imdb.com/name/nm0000982/"
    }
  ],
  "director": [
    {
      "name": "Frank Miller",
      "url": "https://www.imdb.com/name/nm0588340/"
    },
    {
      "name": "Robert Rodriguez",
      "url": "https://www.imdb.com/name/nm0001675/"
    }
  ],
  "creator": [
    {
      "name": "Frank Miller",
      "url": "https://www.imdb.com/name/nm0588340/"
    }
  ],
  "review": {
    "author": "sauravjoshi85",
    "dateCreated": "2021-11-06",
    "inLanguage": "English",
    "heading": "Please do not hear to critics about this film",
    "reviewBody": "Sin City: A Dame to Kill For a.k.a as Frank Miller's Sin City: A Dame to Kill For is an action crime film and follow-up to the 2005 film Sin City. The film is Directed by Robert Rodriguez and Frank Miller. The film stars ensemble cast of Mickey Rourke, Jessica Alba, Rosario Dawson, Jaime King, Late Powers Boothe, Bruce Willis, Josh Brolin, Joseph Gordon-Levitt, Eva Green, Dennis Haysbert, Ray Liotta, Christopher Lloyd, Jamie Chung, Jeremy Piven, Christopher Meloni, Stacy Keach, Lady Gaga, Alexa Vega, Julia Garner, and Juno Temple.\n\nI am still not been able to understand the hate of critics for this film. The film might not be as magnificent as it's first part but still can't be termed as an all-out disappointment.\n\nTwo biggest drawback i felt that the film has is it's similar plot and almost similar execution, new characters were added in the film but still the film lacks originality and freshness.\n\nThe screenplay of the film is good, the film might gets slow in the middle but will not loose the grip from the viewers, the film is just like it's first part is all in all violent and is full of nudity.\n\nActing is great and despite of a huge star cast almost everyone had got ample screen-time and none of them has disappointed. The climax of the film is predictable but still excites.\n\nOverall please do not go by the critics review and watch and review the film by your own wisdom.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 169629,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  }
}