

{
  "type": "Movie",
  "name": "The Boxtrolls",
  "url": "https://www.imdb.com/tt0787474/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQxODA5MDkyNV5BMl5BanBnXkFtZTgwMDMyNjkzMjE@._V1_.jpg",
  "description": "A young orphaned boy raised by underground cave-dwelling trash collectors tries to save his friends from an evil exterminator.",
  "review": {
    "author": "MediaPanther",
    "dateCreated": "2014-09-25",
    "inLanguage": "English",
    "heading": "Maybe a classic",
    "reviewBody": "For the potential viewers of this film, don't worry if you didn't read the book Here Be Monsters! first. The Boxtrolls movie stands on its own as an excellent story wrapped in visuals that pay homage to the craft of stop motion animation. It's funny, clever, gross, a bit cheeky, and a bit dark. Everything kids and many adults who accompany them or with others in the age group will enjoy. Whether it will be a classic or not, is hard to say.\\n\\nThe Boxtrolls are, well, basically trolls that have boxes they use as clothes and safety. They are a modest and timid sort. They are also industrious and like all kinds of gadgets. Since the story takes place around the time of the Industrial Revolution, there is no shortage of gears, crankshafts, bolts, wheels, or any manner of metal part they try to put to some other use. They also are good at babysitting. None more so than Fish and Shoe, the two de facto fathers of one young boy that goes by the name of Eggs (it should be noted that their names are the names of the boxes they wear).\\n\\nWithout getting into too much detail about the origins of their young charge, these three along with the other Boxtrolls have been labeled as kidnapping, baby eating, monsters by the fine townfolk of Cheesebridge. Led by the elite White Hats and their leader Lord Portly-Rind (Jared Harris) and the upwardly mobile Red Hat Archie Snatcher (Ben Kingsley), they have vowed to eradicate their hamlet of the Boxtroll vermin. The only thing more important than accomplishing this task is their love of all types of cheese. Some of the funniest and strangest scenes of the film is the discussions and consumption of cheese by the ruling class and the aforementioned Mr. Snatcher.\\n\\nBesides a wonderful voice acting performance by Sir Kingsley, The Boxtrolls is full of great turns. Two of Mr. Snatch's henchmen Mr. Pickles and Mr. Trout, (Richard Ayoade and Nick Frost, respectively) offer up metaphysical and philosophical commentary musings about life and their career choices. On the other hand, the overzealous Mr. Gristle (Tracy Morgan) is a man of few words, rather letting his actions do the talking. Elle Fanning (Maleficent) and Isaac Hempstead Wright (Game Of Thrones) are a perfect match as Winnie, the daughter of Lord Portly-Rind and Eggs. She teaches him how to act in public, while he indulges her thirst for all things creepy and crawly.\\n\\nThe look of The Boxtrolls can be summed up in one word: amazing. Not in a super saturated color, larger than life way, but in a painstakingly meticulous, attention to detail way. Although the film is in 3d and might lose something when viewed on a smaller screen, the skill, reverence and affection the animation/modeling team poured into the sets and characters, along with top shelf screen writing and acting make this film one of the best animated features to come out in quite a while.\\n\\n\\n* See more at: www.mediumraretv.org\\n",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 61199,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2014-09-12",
  "keywords": "stop motion animation,steampunk,chase,boy hero,cheese allergy",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Ben Kingsley",
      "url": "https://www.imdb.com/name/nm0001426/"
    },
    {
      "name": "Jared Harris",
      "url": "https://www.imdb.com/name/nm0364813/"
    },
    {
      "name": "Nick Frost",
      "url": "https://www.imdb.com/name/nm0296545/"
    }
  ],
  "director": [
    {
      "name": "Graham Annable",
      "url": "https://www.imdb.com/name/nm0030253/"
    },
    {
      "name": "Anthony Stacchi",
      "url": "https://www.imdb.com/name/nm0820934/"
    }
  ],
  "creator": [
    {
      "name": "Irena Brignull",
      "url": "https://www.imdb.com/name/nm0109267/"
    },
    {
      "name": "Adam Pava",
      "url": "https://www.imdb.com/name/nm1106082/"
    },
    {
      "name": "Alan Snow",
      "url": "https://www.imdb.com/name/nm2223296/"
    }
  ]
}