

{
  "type": "Movie",
  "name": "They Came Together",
  "url": "https://www.imdb.com/tt2398249/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTkzNzA2Nzc1Ml5BMl5BanBnXkFtZTgwNzcwNzk3MTE@._V1_.jpg",
  "description": "Molly owns a quaint little sweet shop. Joel works for a gigantic candy company threatening to shut her down. How they meet, fall in love, break up and get back together is hilariously recounted in this rom-com spoof.",
  "review": {
    "author": "lnvicta",
    "dateCreated": "2015-04-22",
    "inLanguage": "English",
    "heading": "They Came Together is the same joke for 80 minutes. Thankfully, the joke is funny.",
    "reviewBody": "I wasn't sure what to expect going into this movie. It seemed like it was going to poke fun at romcoms while still maintaining a grounded story and genuine romance. Yeah, that's not the case at all.\\n\\nThey Came Together is the epitome of meta comedy. It never takes itself seriously for a second and continues to barrage you with joke after joke after joke, spoofing the same romantic comedy tropes we've seen a billion times. It may sound repetitive, and it can be at times (some scenes go on for too long) but it's also the most refreshing satire I've seen in a long time. There is no point where you should be analyzing the plot to this movie. If you do, you're an idiot. Simple as that. The movie is one long joke - if you want some artistic integrity in your comedies then this movie is not for you. If you love to laugh at the expense of cheesy romcoms, then you're in for a real treat.\\n\\nThe acting in this movie is superb, if the all-star cast didn't already give that away. Paul Rudd and Amy Poehler are ace in their roles as lead caricatures, and even during the dumber moments they still give believable performances. Let me clarify: you don't believe anything the characters are doing are real, but they're convincing enough in their roles that you understand exactly what it is they're making fun of and it works wonders. Christopher Meloni is another highlight - he plays a Don Draper-esque boss that all the corporate drones follow blindly (with Paul Rudd's character being the obvious exception). I never viewed him as a comedic figure but he absolutely owns this role; the only other actor I can see doing this role justice is Jon Hamm himself. Other standouts include Jason Mantzoukas as Bob, the friendly awkward coworker, and Ed Helms playing the clich\\u00e9 douchebag that the girl falls for even though he's clearly wrong for her. \\n\\nThe best part about They Came Together is that it's wholly self-aware. It breaks the fourth wall more than a few times, and it doesn't take you out of the movie because you're never really in the movie to begin with. It's like watching an 80 minute long sketch comedy held together by a flimsy love plot. Another positive is that the movie never gets boring. It's so short and so eccentric you don't have time to get bored. Again, it's joke after joke after joke - most of them are cheesy, some are crude, but they're all so relatable as romantic comedy jabs that you can't help but laugh at the stupidity. \\n\\nThey Came Together is definitely not for everyone - if you're looking for substance, go somewhere else. This movie is pure satire from beginning to end. Nothing is believable, and none of it should be. It's a spoof movie at its core, standing head-and-shoulders above other spoofs due to great writing and a brilliant cast. Why this has such a low score on IMDb I will never know. I got everything I wanted from this movie and more. Throw in a few surprise cameos and you have yourself a winner.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 24359,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Romance"
  ],
  "datePublished": "2014-09-05",
  "keywords": "spoof,racism,new york city,halloween party,halloween",
  "duration": "PT1H23M",
  "actor": [
    {
      "name": "Paul Rudd",
      "url": "https://www.imdb.com/name/nm0748620/"
    },
    {
      "name": "Amy Poehler",
      "url": "https://www.imdb.com/name/nm0688132/"
    },
    {
      "name": "Bill Hader",
      "url": "https://www.imdb.com/name/nm0352778/"
    }
  ],
  "director": [
    {
      "name": "David Wain",
      "url": "https://www.imdb.com/name/nm0906476/"
    }
  ],
  "creator": [
    {
      "name": "Michael Showalter",
      "url": "https://www.imdb.com/name/nm0795290/"
    },
    {
      "name": "David Wain",
      "url": "https://www.imdb.com/name/nm0906476/"
    }
  ]
}