{
  "type": "Movie",
  "name": "Downton Abbey",
  "url": "https://www.imdb.com/tt6398184/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMmQxNGRkMjYtZTAyMy00MDUyLThiNmYtODI1NTkyNmI0ZTNlXkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_.jpg",
  "description": "1927. The Crawleys prepare to host King George V and Queen Mary at Downton Abbey.",
  "review": {
    "author": "TreasureHunterGirl",
    "dateCreated": "2019-09-12",
    "inLanguage": "English",
    "heading": "Perfect!",
    "reviewBody": "I love the Downton Abbey TV series so I was always going to expect a lot of the movie. I&apos;m happy to say my expectations were exceeded. Everything about the movie was brilliant.\n\nFirst of all the cast were nothing short of amazing. It must be hard to resume playing a character after years away from them but they all managed to do it and do it well. Pretty much all the actors returned which was nice for fans and reflective of what a great time they must have had working on the original series. I loved that every character got a moment, no matter how big or small.\n\nThe writing and directing was spot on. Great to see the original team still has what it takes. Grand yet subtle.\n\nThe costumes of course were stunning as usual. The attention to detail is very much to be awed.\n\nThe plot was perfect. It was a new storyline but had all the hallmarks of a great Downton episode. Plenty of laughs, lots of little romantic moments, that ordered chaos we all know and love, and of course a wonderfully acted bittersweet moment from two of my favourite characters (I won&apos;t spoil it).\n\nAnd last but not least it was so lovely to be back at Highclere Castle aka Downton Abbey. A wonderful location. It felt like going home.\n\nIn summing up, this movie was the perfect addition to a practically flawless series. As an avid fan I was thoroughly satisfied by everything about it. Highly recommend seeing it on the big screen.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 62049,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.4
  },
  "contentRating": "PG",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2019-09-13",
  "keywords": "gay kiss,man dances with a man,gay,closeted homosexual,based on tv series",
  "duration": "PT2H2M",
  "actor": [
    {
      "name": "Stephen Campbell Moore",
      "url": "https://www.imdb.com/name/nm1304386/"
    },
    {
      "name": "Michael Fox",
      "url": "https://www.imdb.com/name/nm5320024/"
    },
    {
      "name": "Lesley Nicol",
      "url": "https://www.imdb.com/name/nm0630149/"
    }
  ],
  "director": [
    {
      "name": "Michael Engler",
      "url": "https://www.imdb.com/name/nm0257554/"
    }
  ],
  "creator": [
    {
      "name": "Julian Fellowes",
      "url": "https://www.imdb.com/name/nm0271501/"
    }
  ]
}