

{
  "type": "Movie",
  "name": "Paranoid Park",
  "url": "https://www.imdb.com/tt0842929/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTM4NjM1MTg2Nl5BMl5BanBnXkFtZTcwMjc2MDE2MQ@@._V1_.jpg",
  "description": "A teenage skateboarder's life begins to fray after he is involved in the accidental death of a security guard.",
  "review": {
    "author": "plastorm",
    "dateCreated": "2007-07-19",
    "inLanguage": "English",
    "heading": "Paranoid Park Cast and Crew Screening 7-17-07",
    "reviewBody": "I was fortunate enough to attend a cast and crew screening of Gus Van Sant's latest film, Paranoid Park. Having missed Last Days, Gerry, and seeing only bits and pieces of Elephant, I didn't really know what to expect as he sheepishly greeted the crowd, said his thank you's, and let the film roll. With all the criticism, both for and against these recent films, I prepared myself for meaningless long shots of people walking, eating, and various other moments that would quickly find their way to most editor's cutting room floors. Would I be held hostage by a director too much in love with his own shots, or witness the work of a director who could, at this point in his career, easily coast -- yet continues to redefine himself? Thankfully, it was the latter.\\n\\nParanoid Park is easily one of my favorite films of the year, second only to First Snow. Both share the same kind of slow, dreamy reverie I think mainstream audiences are put off by. Both are threaded by haunting scores that are inseparable from the film as a whole. The film feels like music on its own.\\n\\nPark's story is about the death of a security guard in Portland's industrial district, very close to an infamous skate park named Paranoid Park. The film was shot entirely in Portland Oregon. Much like Van Sant's, Drug Store Cowboy, the director treats the various locales in Portland as a second character, showcasing the unique flavor of the city without coming across as a film commissioned by the Oregon tourist board.\\n\\nThe young lead in the film, Gabe Nevins, in what is perhaps his debut film role, has the uneasy task of carrying the film. He plays Alex, a shy skater type who has little interest in his parents, school, or his pretty girlfriend. His performance is commendable. In a role that could have come across as the typical Skater Boy we've all seen 100 times before, he comes off naturally, as a nervous boy who's uncomfortable in his own skin; A boy gripped by an internal struggle too personal to share with anyone. The film is ultimately about this struggle. His narration might strike many viewers as stoic and forced. I would have to disagree. I saw it as the voice of a boy nervously scribbling away at his journal \\u0097 mistakes and all. The entire film has that raw type of quality.\\n\\nWhile pleased with Nevins' performance, I can't say the same for two of the young female actresses in the film. Taylor Momsen, who plays Alex's girlfriend is awful. In contrast to Nevins' natural performance, Momsen comes off like a pretty teenager who's nervous about being watched. I've seen better acting at middle school dance recitals. In a long scene shared by the two, we hear nothing but music, this seemed less like an artistic decision and more like a creative way to tune out her distracting acting. Lauren McKinney, as Alex's friend, shows us an equally wooden performance.\\n\\nThe most impressive quality of Paranoid Park is the gorgeous cinematography by Christopher Doyle and Kathy Li. There is a rich, warm \\u0097 almost vintage quality to the film. Mixing what looked like various stocks of Super 8, digital video, and 35 MM film, each location is bathed in its own outward charm. In a scene where Alex sits on the beach, the aperture flicks forward and backwards, letting light jerk around the lens. It fits the mood of the scene perfectly, like orchestral scratches on an old LP.\\n\\nOverall, Paranoid Park is like a gorgeous and melancholy folk song. With my head still swirling from summer block busters like Transformers and Harry Potter, it was refreshing to watch a film with breathing room. Whether the many dreamlike shots are the result of a director (who edits his own film) unwilling to cut away from his favorite shots, or of an orchestrated effort to thread the film like a song and let the narrative drift in and out, I am in love with his effort and look forward to dreaming with him more.\\n\\nYours in Service, Robert Plastorm",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 31774,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "15",
  "genre": [
    "Crime",
    "Drama",
    "Mystery"
  ],
  "datePublished": "2007-12-26",
  "keywords": "skateboarder,underage sex,portland oregon,skateboard park,blonde",
  "duration": "PT1H25M",
  "actor": [
    {
      "name": "Gabe Nevins",
      "url": "https://www.imdb.com/name/nm2437336/"
    },
    {
      "name": "Daniel Liu",
      "url": "https://www.imdb.com/name/nm2436421/"
    },
    {
      "name": "Taylor Momsen",
      "url": "https://www.imdb.com/name/nm0597410/"
    }
  ],
  "director": [
    {
      "name": "Gus Van Sant",
      "url": "https://www.imdb.com/name/nm0001814/"
    }
  ],
  "creator": [
    {
      "name": "Gus Van Sant",
      "url": "https://www.imdb.com/name/nm0001814/"
    },
    {
      "name": "Blake Nelson",
      "url": "https://www.imdb.com/name/nm0625183/"
    }
  ]
}