

{
  "type": "Movie",
  "name": "Bad Asses on the Bayou",
  "url": "https://www.imdb.com/tt3525346/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzA2OTcxNjk2OF5BMl5BanBnXkFtZTgwMTgwNDUxNDE@._V1_.jpg",
  "description": "Frank Vega and Bernie Pope return, this time to Louisiana in an attempt to find a kidnapped friend.",
  "review": {
    "author": "Mischief810",
    "dateCreated": "2015-06-12",
    "inLanguage": "English",
    "heading": "What a fun (and funny) ride",
    "reviewBody": "I haven't laughed this hard in a long time. The title alone should tell you what to expect: a silly, entertaining flick with plenty of action that also brings belly laugh after belly laugh. \n\nDanny Trejo and Danny Glover are chemistry on screen. John Amos and Loni Love square out a very good cast, with Ms. Love nearly stealing the show.\n\nIf you liked the first two installments of the Badass franchise, you will absolutely love this one. If this is your first encounter with Frank And Bernie and you're expecting something taut and serious, then... well... look at the title again.\n\nThis is Craig Moss really settling into the franchise and kicking it into high gear. Though billed here at IMDb as an action/crime flick, the franchise is built on a comedic foundation and Bayou delivers. I hope a Badass 4 is in the works, because like the Expendables and Fast and Furious franchises, this must go on. \n\nBayou is appropriately paced, well directed, well acted and side-splittingly funny. Enjoy!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 2750,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Comedy",
    "Drama"
  ],
  "datePublished": "2015-03-06",
  "keywords": "female nudity, strip bar, female topless nudity, third part, sequel",
  "duration": "PT1H25M",
  "actor": [
    {
      "name": "Danny Trejo",
      "url": "https://www.imdb.com/name/nm0001803/"
    },
    {
      "name": "Danny Glover",
      "url": "https://www.imdb.com/name/nm0000418/"
    },
    {
      "name": "John Amos",
      "url": "https://www.imdb.com/name/nm0025309/"
    }
  ],
  "director": [
    {
      "name": "Craig Moss",
      "url": "https://www.imdb.com/name/nm0608936/"
    }
  ],
  "creator": [
    {
      "name": "Craig Moss",
      "url": "https://www.imdb.com/name/nm0608936/"
    }
  ]
}