

{
  "type": "Movie",
  "name": "Freeheld",
  "url": "https://www.imdb.com/tt1658801/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMzM5NTg3NjU1MV5BMl5BanBnXkFtZTgwNzAwMjA3NjE@._V1_.jpg",
  "description": "New Jersey police lieutenant Laurel Hester and her registered domestic partner Stacie Andree battle to secure Hester's pension benefits when she is diagnosed with terminal cancer.",
  "review": {
    "author": "chenggaga",
    "dateCreated": "2016-10-03",
    "inLanguage": "English",
    "heading": "A good movie with so much hateful reviews",
    "reviewBody": "Seriously people!!! So much hates on this review section. \n\nAt first I'm gonna tell you how i found this movie. I was searching for a romance movie on internet then i found it. I bought the DVD and decided to watch it alone, because it's a Homosexual romance (first i thought it's really a gay lesbian movie ).\n\nBut it was more than that. Once upon a time i was homophobic person. I hated gays and lesbians more than i hate imaginary gods. I after realized that homosexuals are humans to. They have emotions like strait people. They love, they cry and they laugh. \n\nThis movie based on a true story and very heart touching. I cried after watching this movie. Seriously it's very cute romance with saddest images of gay community. \n\nPeople, if you don't like this types of movies then don't watch. But stop saying nonsense about this. I'm from Bangladesh, a country with so much ignorance and hate. But i came to light, it's time for you to come out too. \n\nAfter all, it's very emotional movie with complexity. I liked it and watched twice.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 13172,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "12A",
  "genre": [
    "Biography",
    "Drama",
    "Romance"
  ],
  "datePublished": "2016-02-19",
  "keywords": "gay bar,partner,cancer,public hearing,hair loss",
  "duration": "PT1H43M",
  "actor": [
    {
      "name": "Julianne Moore",
      "url": "https://www.imdb.com/name/nm0000194/"
    },
    {
      "name": "Elliot Page",
      "url": "https://www.imdb.com/name/nm0680983/"
    },
    {
      "name": "Steve Carell",
      "url": "https://www.imdb.com/name/nm0136797/"
    }
  ],
  "director": [
    {
      "name": "Peter Sollett",
      "url": "https://www.imdb.com/name/nm0813164/"
    }
  ],
  "creator": [
    {
      "name": "Ron Nyswaner",
      "url": "https://www.imdb.com/name/nm0638913/"
    }
  ]
}