

{
  "type": "Movie",
  "name": "Kingsman: The Secret Service",
  "url": "https://www.imdb.com/tt2802144/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYTM3ZTllNzItNTNmOS00NzJiLTg1MWMtMjMxNDc0NmJhODU5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
  "description": "A spy organisation recruits a promising street kid into the agency's training program, while a global threat emerges from a twisted tech genius.",
  "contentRating": "15",
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2015-01-29",
  "keywords": "spy,female rear nudity,class differences,training,secret organization",
  "duration": "PT2H9M",
  "actor": [
    {
      "name": "Colin Firth",
      "url": "https://www.imdb.com/name/nm0000147/"
    },
    {
      "name": "Taron Egerton",
      "url": "https://www.imdb.com/name/nm5473782/"
    },
    {
      "name": "Samuel L. Jackson",
      "url": "https://www.imdb.com/name/nm0000168/"
    }
  ],
  "director": [
    {
      "name": "Matthew Vaughn",
      "url": "https://www.imdb.com/name/nm0891216/"
    }
  ],
  "creator": [
    {
      "name": "Jane Goldman",
      "url": "https://www.imdb.com/name/nm0963359/"
    },
    {
      "name": "Matthew Vaughn",
      "url": "https://www.imdb.com/name/nm0891216/"
    },
    {
      "name": "Mark Millar",
      "url": "https://www.imdb.com/name/nm2092839/"
    }
  ],
  "review": {
    "author": "ethanmidd",
    "dateCreated": "2015-02-25",
    "inLanguage": "English",
    "heading": "A Fun Throwback Spy Movie",
    "reviewBody": "Matthew Vaughn is now one of those directors that I can trust. This is my third movie I've seen by him and he still has not disappointed me. I remember when I first saw Kick Ass and was blown away with how great it is (probably in my top 25). \n\nThis film is a big shout out (basically) to old spy films. It has everything: women, awesome fight scenes, gadgets, and even a ridiculous villain. Samuel L. Jackson plays the villain in this movie, and it's nice because we usually don't see him in that role. He also had a lisp in the entire movie so almost everything he said would make me chuckle. There's also a girl who has blades for feet, which is outrageous but because how Vaughn did an excellent job with choreographing fight scenes, her role worked really well into the film. It's the same for Jackson's character.\n\nThe action scenes in general were fantastic. Like I said in the last paragraph, the choreography is very well done. This is also because of the smooth editing and shots Vaughn chose for all of the fight scenes. It's a very fun thing to see.\n\nThere really aren't any huge gripes for this movie. The only small thing that I can think of is I wish there was a bit more of Cookson's character in the third act. \n\nKingsman is a fun spy thriller movie that had me laughing many times and also had more than a few boundary-pushing moments. However it all worked because of the smooth editing and well-choreographed scenes along with great acting from the entire cast. If you are looking for a good popcorn movie to see, this is a movie you should see with your pals.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 710533,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  }
}