

{
  "type": "Movie",
  "name": "Maps to the Stars",
  "url": "https://www.imdb.com/tt2172584/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTY3MjQwNzYyNV5BMl5BanBnXkFtZTgwNTY3NDQ5MzE@._V1_.jpg",
  "description": "A tour into the heart of a Hollywood family chasing celebrity, one another and the relentless ghosts of their pasts.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2019-06-26",
    "inLanguage": "English",
    "heading": "Less than shining star",
    "reviewBody": "Most of David Cronenberg's films range from good to outstanding. Some of his work disappointed me or evoked a relatively mixed reaction from me, but on the most part he is a very interesting director who does stand out in a good way. The cast are very talented, Julianne Moore especially, while one can understand why Cronenberg frequently used Howard Shore as his composer of choice and their collaborations is one of the best and most consistent director-composer collaborations in my view (am especially fond of his work for 'The Fly').\n\nIt is said with sadness that despite hearing good things about it (though it's understandably very polarising here), 'Maps to the Stars' disappointed me. It is far from a terrible film, don't even think it's a bad film, but it for me was a long way from great. Much to admire but do have to share some of the criticisms here, a great concept with inconsistent execution of it. As far as Cronenberg's work goes, 'Maps to the Stars' is better than 'Stereo', 'Crimes of the Future' and 'Cosmopolis' but it is a lesser film of his, nowhere near the level of 'The Fly', 'Dead Ringers', 'Eastern Promises', 'A History of Violence' and 'Spider'.\n\nThere are good things with 'Maps to the Stars'. It looks wonderful, excepting the somewhat fake-looking fire, then again it is Cronenberg whose work from the late 1970s onwards always ranked high on a visual level (of his overall output 'Rabid' and 'Shivers' were the only real exceptions in this regard). The cinematography is stylish and quite stunning to look at, sunshine has rarely blazed in such a wonderfully dazzling way in film. Shore's score is subtly unsettling and Cronenberg does deliver in the visual aspect of his directing.\n\nSome of the satire is fiercely sharp and darkly funny and it is the satire where 'Maps to the Stars' fares best. Really admired the cast here, with Moore being excellent in the lead in her best performance in years (perhaps since 'Boogie Nights'). Evan Bird shows himself to be a young actor with huge potential, a very beyond his years performance. Have not seen a better performance from Mia Wasikowska in her most daring role and she is very affecting in it, seeing John Cusack and Olivia Williams in different roles and excelling was great to see. Robert Pattinson is much better than he was in 'Cosmopolis' and as others have said he has come on a long way since 'Twilight'.\n\nFor all those great things, 'Maps to the Stars' just didn't connect with me. Despite a promising start, there is a major change of tone that jars badly and then the film becomes unfocused and rather strange. The satirical edge is done well, but the vulgarity does get very over-the-top and mean-spirited and the cynical edge is overdone at times too. The more surreal elements didn't come over as either dreamlike or nightmarish, not much eerie here, too much of the scenes veered on ridiculous and felt very hokey. Emotionally, 'Maps to the Stars' should have been poignant but it felt too cold and clinical (Cronenberg's direction on the most part is the same). The pace can drag and with the trimming or excision of scenes that felt like padding that added nothing it would have felt much better. Cronenberg can do weird and disturbing very well, evident when he pioneered body horror, but very rarely to to such kitchen-sink or muddled effect.\n\nDidn't feel for any of the characters apart from disgust, am aware they were not meant to be likeable and be unpleasant but the film failed too to make them properly fleshed out. The only character who came close to evoking any sympathy from me was Agatha, then her true colours were revealed and that was lost. Found that the film tried to do too many things and have too many strands and elements, and too many of them were given short shrift (the Cusack and Olivia Williams subplot was severely under-explored) or became convoluted, with too many things leaving the viewer perplexed due to being unexplained or poorly resolved. The script is not as rambling or bloated as that for 'Cosmopolis' but it is the most gratuitously crass script of any Cronenberg film and never sounds natural. The ending felt tacked on.\n\nAltogether, not my cup of tea sadly but did find still a good number of great things about it. 5/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 42696,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "18",
  "genre": [
    "Comedy",
    "Drama",
    "Mystery"
  ],
  "datePublished": "2014-09-26",
  "keywords": "aspiring actor,dysfunctional family,sex,brother sister incest,male frontal nudity",
  "duration": "PT1H51M",
  "actor": [
    {
      "name": "Julianne Moore",
      "url": "https://www.imdb.com/name/nm0000194/"
    },
    {
      "name": "Mia Wasikowska",
      "url": "https://www.imdb.com/name/nm1985859/"
    },
    {
      "name": "Robert Pattinson",
      "url": "https://www.imdb.com/name/nm1500155/"
    }
  ],
  "director": [
    {
      "name": "David Cronenberg",
      "url": "https://www.imdb.com/name/nm0000343/"
    }
  ],
  "creator": [
    {
      "name": "Bruce Wagner",
      "url": "https://www.imdb.com/name/nm0905818/"
    }
  ]
}