

{
  "type": "Movie",
  "name": "Song One",
  "url": "https://www.imdb.com/tt2182972/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjM4NDM5NDI1OV5BMl5BanBnXkFtZTgwMDQ4NjE0MzE@._V1_.jpg",
  "description": "A young woman strikes up a relationship with her ailing brother's favorite musician.",
  "review": {
    "author": "prospectus_capricornium",
    "dateCreated": "2015-03-28",
    "inLanguage": "English",
    "heading": "Neither Terrible, Nor Extra-Ordinary, Song One Struggles to Keep Its Tune On Key",
    "reviewBody": "Anybody with soft spot for music and sentimental lovestories will find 'Song One' difficult to resist. It follows Franny (Hathaway), her relationship with his estranged brother, and the unexpected romantic tale that blossomed between her and the musician James, Forester. No, this one's not new, we've seen countless others like this before, but in its own ways 'Song One' strikes a chord, strumming its own rhythm to make its charm carry a tune.\\n\\nYet the tune falls flat and runs off-key on moments when it's needed to speak volume for every scene's emotional sentiment. Albeit earnest and capable, the charm dispells, and what started as a haunting melody runs out of tone and tangibility. Whatever genuine sentiment 'Song One' holds in the beginning, or as a whole, the movie just falls behind extra-ordinary. You would admire Anne Hathaway as expected, but would look past her charm when drawn by the more evident flaws-- most noticeably her seemingly missing connection with Johnny Flynn, her character's love interest--pulling the tune off its proper rhythm.\\n\\n'Song One', regardless of its emotional authenticity , stumbles upon its musical journey finding the right tune it could keep. It has beautiful beats and melodies to hum, but fails to turn them to something audible. It's neither terrible, nor excellent, just plain ordinary. 6/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 10226,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Music",
    "Romance"
  ],
  "datePublished": "2015-01-22",
  "keywords": "young,two word title,number 1 in title,musician,recording",
  "duration": "PT1H26M",
  "actor": [
    {
      "name": "Anne Hathaway",
      "url": "https://www.imdb.com/name/nm0004266/"
    },
    {
      "name": "Johnny Flynn",
      "url": "https://www.imdb.com/name/nm1926865/"
    },
    {
      "name": "Ben Rosenfield",
      "url": "https://www.imdb.com/name/nm4101208/"
    }
  ],
  "director": [
    {
      "name": "Kate Barker-Froyland",
      "url": "https://www.imdb.com/name/nm2293399/"
    }
  ],
  "creator": [
    {
      "name": "Kate Barker-Froyland",
      "url": "https://www.imdb.com/name/nm2293399/"
    }
  ]
}