

{
  "type": "Movie",
  "name": "Walking with the Dead",
  "url": "https://www.imdb.com/tt3499458/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5NTE5OTI2MV5BMl5BanBnXkFtZTgwNzc1NzY1NDE@._V1_.jpg",
  "description": "When a police officer wakes up in a hospital to find out he is in the middle of a zombie apocalypse, he will do anything to find his family, even sacrifice Twitter.",
  "review": {
    "author": "phoenixyk1",
    "dateCreated": "2017-01-07",
    "inLanguage": "English",
    "heading": "I'm not dead... Yet!",
    "reviewBody": "What has happened to Spoofs and Pardodies?\n\nOh wait... I remember! The Scary Movie Franchise...\n\nYeah, it has to be said that this movie follows all the old tropes of trying to cash grab at a popular formula. We are long past the days of Mel Brooks thanks in part to a Politically Correct sensibility that seems to have issues with people taking the P**s out of every cultural stereotype and shoving it in our faces about how Hypocritical society really is...\n\nThis was the Genius of many Early Parody Movies... Mel;; Brooks, a Jewish Director/Writer/Movie Star, was more than willing to not only shove the ridiculous stereotypes of most people into our faces and say 'Seriously! This is how Stupid we all are!' but also send up his own beliefs because he KNEW that even he and his beliefs were not above a level of Hypocrisy.\n\nBrooks, Zucker and Abrahams were very culturally aware... and never afraid to ruffle feathers for a laugh - because when we laughed at what we saw on screen, we were also laughing at ourselves... \n\nSadly, this art seems lost... This movie does NOT hit any of those notes and instead relies on 'Parody' of the most popular movies of its genre...\n\nThe Title is obviously a Parody of The Walking Dead, There are references to 28 Days Later, Star Wars, Zombieland (Parody of a Parody? Are you serious?), Warm Bodies and many more.\n\nFor what its worth, the film is NOT terrible... In fact, it has elements that are genuinely funny, though they are few and far between.\n\nThe effects are possibly one of the better elements of the movie - And sometimes quite graphic and gory... But this does not make it a great film.\n\nIts biggest problem is they try too hard to cram as many pop culture references into the film to try and score cheap laughs that most of the time just do not work.\n\nGiven that so many films seem to be pandering to the so called 'Social Justice Warriors' and avoid making jokes that may even remotely come across as Racist or Religious in anyway - Its still baffles me how so many of these movies still rely on Stoner Humour to try and get laughs!\n\nOverall, its cheap, tacky, but to be fair... Its short and mildly entertaining.\n\nIt could have been so much more though - Instead to falls into the vain of Disaster Movie, Epic Movie, Scary Movie 4, The Starving Games and such like... Only with a much lower budget.\n\nIts not going to challenge your humour much - But you may get a few cheap laughs out of it.\n\nIf people are going to continue doing parodies - PLEASE FOR GODS SAKE STOP TRYING TO BE POLITICALLY CORRECT! NOTHING SHOULD BE SACRED TO HUMOUR!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 3509,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.6
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Horror"
  ],
  "datePublished": "2015-03-20",
  "keywords": "zombie,zombie spoof",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Tim Ogletree",
      "url": "https://www.imdb.com/name/nm4333498/"
    },
    {
      "name": "Joey Oglesby",
      "url": "https://www.imdb.com/name/nm2824330/"
    },
    {
      "name": "Troy Ogletree",
      "url": "https://www.imdb.com/name/nm5738294/"
    }
  ],
  "director": [
    {
      "name": "Scott Dow",
      "url": "https://www.imdb.com/name/nm3438843/"
    }
  ],
  "creator": [
    {
      "name": "Tim Ogletree",
      "url": "https://www.imdb.com/name/nm4333498/"
    }
  ]
}