

{
  "type": "Movie",
  "name": "The Loft",
  "url": "https://www.imdb.com/tt1850397/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjAyNTM4ODM5NV5BMl5BanBnXkFtZTgwNTA4NDE3MzE@._V1_.jpg",
  "description": "Five married guys secretly share a penthouse loft in the city where they can carry out hidden affairs. The fantasy becomes a nightmare, however, when they discover a dead woman in the loft and realize one of the group must be invo...",
  "review": {
    "author": "deloudelouvain",
    "dateCreated": "2017-02-13",
    "inLanguage": "English",
    "heading": "The original Belgian version was better but this one is also fine.",
    "reviewBody": "I have a couple of questions after watching The Loft. The first one is why some people don't like this movie? If you wanted to watch a mystery thriller then this is what you got. There's no way in hell you could see the end coming. That's what makes a mystery thriller standing out from the rest. A good story with some twists you don't see coming. My second question is why do we need to remake a movie that has been made before and even better? I saw the Belgian version of 2008 before and even if it is the exact copy of this version the original was even better. So why spending all that money on a movie that already exists? Just put some subtitles under the Belgian version and you got an even better movie. Saves you money and time. And if you watched this version of The Loft to see Matthias Schoenaerts play in it than you could have watched the original version as well because he plays in both movies. That must be a premiere I think. Anyways, even though I preferred the original version I still think this one was also good. Good story with good twists and with a good cast. What else do you want on a movie night?",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 59516,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "15",
  "genre": [
    "Mystery",
    "Romance",
    "Thriller"
  ],
  "datePublished": "2014-10-15",
  "keywords": "adultery,female nudity,female rear nudity,loft,flashback",
  "duration": "PT1H48M",
  "actor": [
    {
      "name": "Karl Urban",
      "url": "https://www.imdb.com/name/nm0881631/"
    },
    {
      "name": "James Marsden",
      "url": "https://www.imdb.com/name/nm0005188/"
    },
    {
      "name": "Wentworth Miller",
      "url": "https://www.imdb.com/name/nm0589505/"
    }
  ],
  "director": [
    {
      "name": "Erik Van Looy",
      "url": "https://www.imdb.com/name/nm0887452/"
    }
  ],
  "creator": [
    {
      "name": "Bart De Pauw",
      "url": "https://www.imdb.com/name/nm0210916/"
    },
    {
      "name": "Wesley Strick",
      "url": "https://www.imdb.com/name/nm0834338/"
    }
  ]
}