{"type": "Movie", "name": "24 Hour Party People", "url": "https://www.imdb.com/tt0274309/", "poster": "https://m.media-amazon.com/images/M/MV5BYTcyYzMyZGUtOGExYi00ZTljLWE3NDEtMGQyYTZiNmIzMzRiXkEyXkFqcGdeQXVyNzQ5MzY0NjM@._V1_.jpg", "description": "In 1976, Tony Wilson sets up Factory Records and brings Manchester's music to the world.", "review": {"author": "Quinoa1984", "dateCreated": "2005-08-03", "inLanguage": "English", "heading": "how did I miss seeing this movie till now?", "reviewBody": "24 Hour Party People is just one of those movies that has that click with the subject matter. The actual style of the film corresponds with the music, the irreverence, and the energy of it all. But there's more than just the unconventionality of the script and direction; the film has that sort of stream-of-thought, wry, distinct British humor to it, and a sincerity beneath the absurdist parts. It follows its main character down the line, in a surreal way like a documentary, if that makes sense- we move between Tony Wilson addressing the audience (played by Steve Coogan, who is so on target with the honesty of the portrayal you can't picture anyone else in the role), an almost behind-the-scenes filming of it (I think), and a dramatization shot on pure digital, independent vibes.\\n\\nWilson, who sees the Sex Pistols play in Manchester (his hometown, and the main base and heart in the location of this film), is also a journalist on television. He gets so enamored with what he sees as an extremely important part of history (the viewer will get a good idea of this), he gets involved with the bands, the locals, and goes from just bands, to maintaining the Hacienda, a club. Some parts of the film one might expect, if considering it includes the rise and fall of fame (or rather, in this film, a lot of times in the mind), and the drug scene coinciding with the music. One knows that Tony Wilson is the main character, the protagonist, basically in every scene, but somehow he does not become the only important part of the film's success. The music too is a huge factor, and the speed it sets for a movie like this.\\n\\nAs much biography as musical, 24 Hour Party People brings to light the scene of Manchester as a history lesson, but an entertaining one to boot. Bands like New Order (the form after Joy Division split) will be known to most who follow music, but unless if you're not really steeped in the new-wave/dance scene of the 80's and 90's, some of the bands may sound totally unfamiliar. Still, this is not an automatic deterrent- the music is what it is, and most who will want to see the film will know what they're getting (in truth, the ratio of British punk and new-wave vs. electronica is fairly balanced). But even when some of the music doesn't stand the test of time, it serves the story all the same (some of the more interesting and darkly funny scenes are when no one comes to the club the sort of 'mix-way' between the two musical eras).\\n\\nAnd all through this, Coogan plays it like a pro. The Coogan Wilson, of course, is far from the real Tony Wilson (one of the DVD interviews says he's a 'Jerry Springer'-looking type), so it becomes more of being a character in this whole environment that springs up around and by him. In a way he's kind of like a British Andy Warhol with the idealistic, serious journalist instead of the painter/filmmaker. There's a sort of checked insanity that underlays some of his performance, and yet for most of the time, like a lot of the better British actors, he doesn't play it more for laughs than he needs, and when serious drama/tragedy comes up it's still kept to this reality. So, along with him, and the music, and the strange form of putting together a dramatized, documentary/musical/black comedy by director Michael Winterbottom and writer Frank Cottrell Boyce, it all gels. This is one of the finest sleepers I've seen in a while.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 9}}, "rating": {"ratingCount": 39351, "bestRating": 10, "worstRating": 1, "ratingValue": 7.3}, "contentRating": "18", "genre": ["Biography", "Comedy", "Drama"], "datePublished": "2002-04-05", "keywords": "dancer,kidnapping,drugs,violence,suicide by hanging", "duration": "PT1H57M", "actor": [{"name": "Steve Coogan", "url": "https://www.imdb.com/name/nm0176869/"}, {"name": "Lennie James", "url": "https://www.imdb.com/name/nm0416694/"}, {"name": "John Thomson", "url": "https://www.imdb.com/name/nm0861027/"}], "director": [{"name": "Michael Winterbottom", "url": "https://www.imdb.com/name/nm0935863/"}], "creator": [{"name": "Frank Cottrell Boyce", "url": "https://www.imdb.com/name/nm0101639/"}]}