{"type": "Movie", "name": "Ballistic: Ecks vs. Sever", "url": "https://www.imdb.com/tt0308208/", "poster": "https://m.media-amazon.com/images/M/MV5BMTkwMDk0OTcyMF5BMl5BanBnXkFtZTYwNzcxMDg5._V1_.jpg", "description": "Tasked with destroying each other, an FBI agent and a rogue DIA agent soon discover that a much bigger enemy is at work.", "datePublished": "2002-09-20", "contentRating": "15", "genre": ["Action", "Crime", "Mystery"], "duration": "PT1H31M", "keywords": "secret agent, stylized violence, mixed martial arts, tough girl, action heroine", "rating": {"ratingCount": 20955, "bestRating": 10, "worstRating": 1, "ratingValue": 3.7}, "review": {"author": "Buddy-51", "dateCreated": "2002-09-28", "inLanguage": "English", "heading": "absurdly bad espionage thriller", "reviewBody": "`Ballistic: Ecks vs. Sever' has been saddled with not only one of the worst movie titles in recent memory, but one of the worst screenplays as well. The film's third-rate espionage plot makes no sense at all and serves basically as a lame excuse for endless explosions, shootouts and double-flipping car chases, which have become the standard accoutrements for virtually every action picture since `Bullitt' in 1968. \\n\\n The problem with `Ballistic' is that the viewer can never tell who is doing what to whom or why \\u0096 and we never care. The film is really all about style anyway. How else to account for the rather ludicrous image of Lucy Liu - looking more like a fashion model out on a shoot than a trained killer doing the shooting herself - strolling in elegant slow motion through the streets of Vancouver, wiping out what seems to be an entire hit squad with a combination of superhuman marksmanship and Matrix-like kickboxing moves? With her ankle-length designer coat and her icy-cool demeanor, she looks like Calvin Klein's idea of what the well-dressed assassin should be wearing this season. It's enough to reduce the whole enterprise to the level of comic absurdity \\u0096 and, indeed, I often found myself laughing out loud at many of the ostensibly serious shenanigans occurring in the film. The flashbacks, which are obviously intended to clarify the characters' relationships, are so poorly done that they actually end up making the whole story more muddled and confusing. (And, although the child-kidnapping scenario is never as offensive in this film as it is in `Trapped,' one can still question the propriety of filmmakers running to this theme with the kind of frequency they seem to have been doing of late).\\n\\n Antonio Banderas makes up the other half of the film's title (he is Ecks, she Sever), and one only wonders what he could have been thinking about when he signed on to co-star in this particular project. `Ballistic' is utterly dispensable moviemaking: here today, forgotten tomorrow, a film utterly without distinction, conviction or purpose.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "actor": [{"name": "Antonio Banderas", "url": "https://www.imdb.com/name/nm0000104/"}, {"name": "Lucy Liu", "url": "https://www.imdb.com/name/nm0005154/"}, {"name": "Talisa Soto", "url": "https://www.imdb.com/name/nm0000650/"}], "director": [{"name": "Wych Kaosayananda", "url": "https://www.imdb.com/name/nm1126346/"}], "creator": [{"name": "Alan B. McElroy", "url": "https://www.imdb.com/name/nm0568416/"}]}