{"type": "Movie", "name": "Blade II", "url": "https://www.imdb.com/tt0187738/", "poster": "https://m.media-amazon.com/images/M/MV5BOWVjZTIzNDYtNTBlNC00NTJjLTkzOTEtOTE0MjlhYzI2YTcyXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg", "description": "Blade forms an uneasy alliance with the vampire council in order to combat the Reapers, who are feeding on vampires.", "review": {"author": "BaronBl00d", "dateCreated": "2003-04-06", "inLanguage": "English", "heading": "Vampires Make Horrible Parents!", "reviewBody": "Blade and his alter ego Wesley Snipes are back yet again to battle the vampiric scourge terrifying the world of the humans. But this time he helps...that&apos;s right, you heard me...helps the vampires fight a mutant vampire that prefers feeding on vampires over humans. Well, to spin a long (actually not that long or terribly complicated) story, Blade is...Sorry I cannot say anymore or I might give away too much of the plot - and you know movies like this are plot-driven. This film is exactly what you would expect. Gobs of blood, tons(maybe even more!) of CGI&apos;s kicking heads in, bashing heads in, splitting bodies, turning into sparkling dust, and so on and so on and so on, cute one liners with Wesley twisting his neck a lot, and lots of techo-weapons designed to do everything and anything to the body. Is it a great film? Get real. Is it entertaining? Yes, somewhat of a guilty pleasure for me I must confess. Snipes never seems to take his role or what is going on too seriously with his low-key, stoic acting. Kris Kristofferson is back as Whistler. You might remember he died in the first Blade movie, but through some plot contrivance that was designed for us not to really understand - he is back and much older and somewhat wiser for wear. The rest of the cast is acceptable EXCEPT for Reedus who is annoying. Ron Pearlman seems to be having the most fun hamming it up as a villainous vampire out to get Snipes. All in all not a bad way to spend an hour or two.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 232671, "bestRating": 10, "worstRating": 1, "ratingValue": 6.7}, "contentRating": "18", "genre": ["Action", "Horror", "Sci-Fi"], "datePublished": "2002-03-29", "keywords": "black superhero,human vampire hybrid,infected vampire,vampire,vampire versus vampire", "duration": "PT1H57M", "actor": [{"name": "Wesley Snipes", "url": "https://www.imdb.com/name/nm0000648/"}, {"name": "Kris Kristofferson", "url": "https://www.imdb.com/name/nm0001434/"}, {"name": "Ron Perlman", "url": "https://www.imdb.com/name/nm0000579/"}], "director": [{"name": "Guillermo del Toro", "url": "https://www.imdb.com/name/nm0868219/"}], "creator": [{"name": "Marv Wolfman", "url": "https://www.imdb.com/name/nm0938379/"}, {"name": "Gene Colan", "url": "https://www.imdb.com/name/nm0170160/"}, {"name": "David S. Goyer", "url": "https://www.imdb.com/name/nm0275286/"}]}