{"type": "Movie", "name": "Bowling for Columbine", "url": "https://www.imdb.com/tt0310793/", "poster": "https://m.media-amazon.com/images/M/MV5BOWY2OWM1ODEtNDU5OS00MjMwLTliYzItZWZlOTEyYmQ2Njg4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "description": "Filmmaker Michael Moore explores the roots of America's predilection for gun violence.", "review": {"author": "emma502", "dateCreated": "2003-05-07", "inLanguage": "English", "heading": "One of the most thought provoking movies.", "reviewBody": "What has become of the United States? Is there any difference from the United States that was formed by Puritans and tried to escape from persecution under the British flag? Has there always been a different mentality for the American than that of any other nationality of individual? After September 11th Michael Moore the director and writer set out to make a documentary that addressed these and other embedded questions that are addressed everyday in our news media, school systems, homes, stores and street corners. Attempting to address all sides of the issues as a person of the media Moore used not only his own experiences, his connection to the NRA, but also other persons opinions that ranged from Charlton Hesston, the well known president of the NRA and famous actor, to the average American that was confronted with the violent acts that resulted from the accessibility of fire arms. This documentary took a new approach to the display of information. Not only was animation used to explain history, American's imbedded fear of their own neighbors, but it also used rock music ( gave a beat or a pulse to the film that progress from slow to fast as the intensity of the issues progressed), sarcasm, interviews, and casual conversations. Moore traveled the country to talk to all those that make up the spectrum of the American society, he traveled to the scenes of some of the more recent American tragedies, made impromptu stops in corporations such as Kmart (where the boys from Columbine bought the ammunition used in the shooting), and traveled to Canada to get an outside or foreign opinion. The idea was to move away from the documentary style of `talking heads'; he wanted a film that would not only touch a chord with the American people but one that would also be readily watched. This idea also made the documentary, that there was too much influence placed on the `words of the professional' or the ` findings of the expert'; that these findings and misleadings flooded the news at night to increase the amount of fear that the average American has as it looked for a scape-goat to blame. The information that Moor presented in his documentary did not technically follow a pre-described narrative, but followed more of a form where the audience was left areas to think and to breakdown the information. Elements of the circular narrative were the foundation of the film, where similar elements in opinions and the common American we continually addressed. Yet, the only problem that could be addressed is one of the ways in which Moore collected some of his data. Some might see a use of trickery or manipulation was used on his part to get the responses and such passion-filled opinions stated. While others would see the same information in the light that no instigation was needed, that people have these strong beliefs, opinions and are willing to talk about them but they lack the examples or understanding of the topic to take a well informed stand on one side or the other. Such a problem is not new in the world of documentaries when controversial data is presented to the public. Moore did a great job of presenting a delicate subject to the American people and was deserving of the Academy Award for the project.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 148322, "bestRating": 10, "worstRating": 1, "ratingValue": 8}, "contentRating": "15", "genre": ["Documentary", "Crime", "Drama"], "datePublished": "2002-11-15", "keywords": "columbine high school killings,firearm,national rifle association,school shooting,gunfire", "duration": "PT2H", "actor": [{"name": "Michael Moore", "url": "https://www.imdb.com/name/nm0601619/"}, {"name": "Charlton Heston", "url": "https://www.imdb.com/name/nm0000032/"}, {"name": "Marilyn Manson", "url": "https://www.imdb.com/name/nm0001504/"}], "director": [{"name": "Michael Moore", "url": "https://www.imdb.com/name/nm0601619/"}], "creator": [{"name": "Michael Moore", "url": "https://www.imdb.com/name/nm0601619/"}]}