{"type": "Movie", "name": "Eight Legged Freaks", "url": "https://www.imdb.com/tt0271367/", "poster": "https://m.media-amazon.com/images/M/MV5BMzMzODg5MDk4OV5BMl5BanBnXkFtZTYwNTM0Nzc3._V1_.jpg", "description": "Venomous spiders get exposed to a noxious chemical that causes them to grow to monumental proportions.", "genre": ["Action", "Adventure", "Comedy"], "contentRating": "12", "datePublished": "2002-08-09", "duration": "PT1H39M", "keywords": "giant spider,town in panic,arizona desert,arizona,psychotronic film", "rating": {"ratingCount": 59915, "bestRating": 10, "worstRating": 1, "ratingValue": 5.5}, "review": {"author": "Coventry", "dateCreated": "2004-03-18", "inLanguage": "English", "heading": "Arachnocomedy!", "reviewBody": "You could either be really harsh and say the film is a stupid and completely unnecessary CGI-playground or.you could sit back, relax and search for all the adorable references towards the delightful monster-movies like they could only make them in the 50&apos;s. In fact, that&apos;s all Eight Legged Freaks represents! A spoof slash tribute, updated with the latest and most expensive computer techniques. All the typical clich\\u00e9 aspects are there: the isolated little town with the ironic sounding name, the unfortunate hero and all the charming (slightly retarded) redneck town-inhabitants. And of course the giant, mutated spiders complete with ludicrous \\u0091yummy-noises. The ways these spiders are hunting they preys is funny instead of scary with complete over-the-top situations. You should already be warneda film that stars David Arquette as the heroic savior can&apos;t be taken too seriously. Present in Eight Legged Freaks as well: two generations of stunningly beautiful actresses. Kari Wuhrer and Scarlet Johanssen. The latter is working her way up to the highest regions of Hollywood these days through starring in Oscar-favorites like \\u0091Lost in Translation&apos; and \\u0091The Girl with the Pearl Earring&apos;, whereas Wuhrer is fixing her career as a B-movie queen. After Eight Legged Freaks, she starred in (mediocre) films such as King of the Ants, The Hitcher II and another Hellraiser sequel. \\n\\nI shamelessly admit I had a great time while watching Eight Legged Freaks. It reminded me of \\u0091Tremors&apos; a biteven though that one is better. Nonetheless, it&apos;s fun and a nice change from all those irrelevant and dull teen-slashers. If you&apos;re looking for a real tribute to the 50&apos;s monsters, check out the short film `Larger than Life&apos; by the same director. That little film really breathes the monster atmosphere and formed the inspiration (and budget) to shoot Eight Legged Freaks.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 6}}, "actor": [{"name": "David Arquette", "url": "https://www.imdb.com/name/nm0000274/"}, {"name": "Kari Wuhrer", "url": "https://www.imdb.com/name/nm0001863/"}, {"name": "Scott Terra", "url": "https://www.imdb.com/name/nm0855728/"}], "director": [{"name": "Ellory Elkayem", "url": "https://www.imdb.com/name/nm0253819/"}], "creator": [{"name": "Ellory Elkayem", "url": "https://www.imdb.com/name/nm0253819/"}, {"name": "Randy Kornfield", "url": "https://www.imdb.com/name/nm0466473/"}, {"name": "Jesse Alexander", "url": "https://www.imdb.com/name/nm0018504/"}]}