{"type": "Movie", "name": "Femme Fatale", "url": "https://www.imdb.com/tt0280665/", "poster": "https://m.media-amazon.com/images/M/MV5BMGM5NWVhYTMtZjg5Zi00ODVkLWFmM2ItMDZkMTA5NGQzMDQxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "description": "A woman tries to straighten out her life, even as her past as a con-woman comes back to haunt her.", "genre": ["Crime", "Drama", "Mystery"], "contentRating": "15", "datePublished": "2002-04-30", "duration": "PT1H54M", "keywords": "breast play,lesbian sex from behind,female protagonist,sex on a pool table,female removes her dress", "actor": [{"name": "Rebecca Romijn", "url": "https://www.imdb.com/name/nm0005381/"}, {"name": "Antonio Banderas", "url": "https://www.imdb.com/name/nm0000104/"}, {"name": "Peter Coyote", "url": "https://www.imdb.com/name/nm0001075/"}], "director": [{"name": "Brian De Palma", "url": "https://www.imdb.com/name/nm0000361/"}], "creator": [{"name": "Brian De Palma", "url": "https://www.imdb.com/name/nm0000361/"}], "review": {"author": "rbverhoef", "dateCreated": "2005-06-23", "inLanguage": "English", "heading": "pure movie-making", "reviewBody": "Brian De Palma's 'Femme Fatale' is pure movie-making. In fact, it is done so well you almost forget it is all close to nonsense. But who cares, 'Femme Fatale' is an exercise in style drenched in twists and turns. Instead of cheating De Palma gives us a lot of little hints, easily missed the first time you see it. Explaining the story could ruin a lot and is probably useless anyway.\n\nI can tell the film opens with a heist, probably one of the most erotic ones out there. Laure Ash (Rebecca Romijn-Stamos) is the one who goes away with a very expensive artifact betraying a whole lot of people. This event is what drives her the rest of the movie, but in what way I can not reveal. I can say that we move forward to seven years later and that Laure has changed her identity, more by mistake than on purpose. Another important thing I can tell you is that we meet a photographer named Nicolas Bardo (Antonio Banderas). He takes a picture of Laure while she is still Laure and he is the one who takes a picture of her seven years later, a photo that could spoil everything for her.\n\nI should stop talking about the story. You have to see it for yourself, collecting clues and try to make something out of it. I love a movie like this. 'Memento', 'Mulholland Dr.' and 'Donnie Darko' are other examples. Maybe you can figure them out, if that is the filmmakers intention, maybe you can not. But it is not so much the conclusion I enjoy, it is the ride that brings us there. De Palma does it in a terrific way with a lot of love for the movies.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 9}}, "rating": {"ratingCount": 37474, "bestRating": 10, "worstRating": 1, "ratingValue": 6.2}}