{"type": "Movie", "name": "Ghost Ship", "url": "https://www.imdb.com/tt0288477/", "poster": "https://m.media-amazon.com/images/M/MV5BMTM3NTA4NDIwMF5BMl5BanBnXkFtZTYwNTc4NDE3._V1_.jpg", "description": "A salvage crew discovers a long-lost 1962 passenger ship floating lifeless in a remote region of the Bering Sea, and soon notices that its long-dead inhabitants may still be on board.", "review": {"author": "bob the moo", "dateCreated": "2006-07-05", "inLanguage": "English", "heading": "A solid genre movie that builds a good atmosphere and tension across the 90 minutes even if it isn't anything that special", "reviewBody": "Sean Murphy and his crew are the top salvage experts in the land (well, sea). They have just completed one big job when a pilot, Jack Ferriman, comes tot them with a ship that he has spotted in remote, international waters. It hasn't responded to distress signals and it seems fair game if Murphy will give Jack a cut and let him come along. Murphy accepts and they set off. The fact that the ship doesn't show up on radar doesn't ring any alarm bells with the crew, who board the ship to find a deserted vessel ripe for the pickings. However she has sustained damage and has days before she will sink forever. Diver Maureen spotted a young girl on board is only the first of several strange things to occur and soon the crew find themselves in deeper than they planned.\\n\\nOpening with a scene so brutal and gory (made all the worse for me knowing it was coming) that I literally couldn't watch, this film had me hooked at the same time as having me worried that this would just be a big gore fest with nothing else to it. Indeed this is what I had heard, having only read negative reviews for this film. However for the majority it avoids this by being spooky, atmospheric and engaging. The plot isn't anything amazing but it does the job. Many reviewers have said it turns rubbish in the final thirty minutes but to me it was still effective even if it did resort to genre by being gorier and more obvious. It will never win any awards for originality or anything else but it is an effective genre movie that avoids the b-movie schlock of stuff like Deep Rising.\\n\\nBecause it is mostly about atmosphere, the cast are only so-so as they are given little to do. Byrne is a good presence but is slumming it so obviously that he should probably have had a slot in his character's back with a studio exec feeding it every few minutes of screen time. Margulies is better as she has more to do and is a more interesting character; she can work at this level and does. Eldard has some terrible lines but does OK with Urban. Washington is better than this but is quite interesting and has a good screen presence. Harrington plays it so obviously that it is hard not to see him coming, which was a bit of a shame. The direction is good and the design/feel of the film is probably better than the material deserves \\u0096 nicely building up tension and atmosphere as it goes.\\n\\nOverall then a good genre movie. Better than b-movie stuff, it uses the gore sparingly for the most part and builds up to things well. In the end it may go just where you expect it to and not do anything that special but I found it quite enjoyable for what it was and, in the words of the advert, does exactly what it says on the tin.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 108397, "bestRating": 10, "worstRating": 1, "ratingValue": 5.6}, "contentRating": "18", "genre": ["Horror", "Mystery", "Thriller"], "datePublished": "2003-01-24", "keywords": "ghost ship,evil spirit,death trap,ghost,malevolent spirit", "duration": "PT1H31M", "actor": [{"name": "Julianna Margulies", "url": "https://www.imdb.com/name/nm0000523/"}, {"name": "Gabriel Byrne", "url": "https://www.imdb.com/name/nm0000321/"}, {"name": "Ron Eldard", "url": "https://www.imdb.com/name/nm0253035/"}], "director": [{"name": "Steve Beck", "url": "https://www.imdb.com/name/nm0065284/"}], "creator": [{"name": "Mark Hanlon", "url": "https://www.imdb.com/name/nm0360144/"}, {"name": "John Pogue", "url": "https://www.imdb.com/name/nm0688282/"}]}