{"type": "Movie", "name": "Half Past Dead", "url": "https://www.imdb.com/tt0297162/", "poster": "https://m.media-amazon.com/images/M/MV5BNjJhOTVlNzMtODIwZi00NTI0LTkxNzUtNDczYjgyN2YzODkxXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg", "description": "A man goes undercover in a hi-tech prison to find information to help prosecute those who killed his wife. While there he stumbles onto a plot involving a death-row inmate and his $200 million stash of gold.", "contentRating": "15", "genre": ["Action", "Crime", "Thriller"], "datePublished": "2003-05-02", "keywords": "fbi federal bureau of investigation,body lands on a car,knocking down a door,hk mp5,dark comedy", "duration": "PT1H38M", "actor": [{"name": "Morris Chestnut", "url": "https://www.imdb.com/name/nm0004820/"}, {"name": "Steven Seagal", "url": "https://www.imdb.com/name/nm0000219/"}, {"name": "Matt Battaglia", "url": "https://www.imdb.com/name/nm0061307/"}], "director": [{"name": "Don Michael Paul", "url": "https://www.imdb.com/name/nm0666806/"}], "creator": [{"name": "Don Michael Paul", "url": "https://www.imdb.com/name/nm0666806/"}], "review": {"author": "Thormod_Morrisson", "dateCreated": "2004-11-24", "inLanguage": "English", "heading": "One of the Worst Movies Ever Made", "reviewBody": "Steven Seagal, who has a proud history of creating some of the most realistic and exciting fight scenes in his past work is completely wasted in this movie. The money must have been good, because I don't see what else would have persuaded him to appear in it. What we have is a shallow excuse to feature some rappers on film. The script is abominable. Everything is contrived, superficial and artificial. The director seems confused about whether or not he is making a music video or an actual film. A lot of posing, unrealistically choreographed fight scenes, a lot of mindless shooting at walls. I was reminded of those ludicrous gunfights in the A Team, in which about 2,000 bullets are fired and nobody gets killed. The background music (if you can call it that) is loud and irritating. And the chief villain, boringly and predictably bumped off only at the end, displays the character development of a robot. I would have had him shot first just to ease the overall irritation of the film. Bad, bad, bad. The only reason I watched it was in the forlorn hope that Steven Seagal could do something to save it, but that was beyond even him. Stick with what you're good at, big guy, and don't appear in any more rap videos.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 16629, "bestRating": 10, "worstRating": 1, "ratingValue": 4.6}}