{"type": "Movie", "name": "Moonlight Mile", "url": "https://www.imdb.com/tt0179098/", "poster": "https://m.media-amazon.com/images/M/MV5BMTY5MTA1MTgyMV5BMl5BanBnXkFtZTYwNzE5NDg3._V1_.jpg", "description": "As he copes with the death of his fiancée, a young man befriends her parents and must figure out what he wants out of life.", "review": {"author": "q-taran", "dateCreated": "2005-01-01", "inLanguage": "English", "heading": "Good acting saves this", "reviewBody": "True, this movie is not for everyone. It is not for action junkies and it isn't that exciting as dramas go. But the excellent acting by the three main leads will hold your attention, if you let yourself get into it.\n\nDustin Hoffman is completely believable as the dad whose hopes and dreams have vanished with his daughter and he struggles to hold on to them in a state of denial. Susan Sarandon's character has accepted the fact and turns away from friends' sympathy. And as the fiancée in a slight state of paralysis from numbness, Jake Gyllenhaal proves he can play more than disturbed teen. The girl's parents try to hold onto him as their last hope of clinging to their daughter. Joe (Gyllenhaal) doesn't want to hurt them by leaving, but has to find his own path now.\n\nThe actors keep the movie going for longer than expected. Even though by the end you're glad it's over, it'll stick in your mind. It's the kind of movie you only see once, or else you'll get sick of it. But the one time will be enough for you to appreciate its quiet despair and hope.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 7}}, "rating": {"ratingCount": 14618, "bestRating": 10, "worstRating": 1, "ratingValue": 6.6}, "contentRating": "15", "genre": ["Drama", "Romance"], "datePublished": "2003-02-21", "keywords": "commercial real estate,jewish family,dog vomiting,judge,lawyer", "duration": "PT1H56M", "actor": [{"name": "Jake Gyllenhaal", "url": "https://www.imdb.com/name/nm0350453/"}, {"name": "Dustin Hoffman", "url": "https://www.imdb.com/name/nm0000163/"}, {"name": "Susan Sarandon", "url": "https://www.imdb.com/name/nm0000215/"}], "director": [{"name": "Brad Silberling", "url": "https://www.imdb.com/name/nm0797869/"}], "creator": [{"name": "Brad Silberling", "url": "https://www.imdb.com/name/nm0797869/"}]}