{"type": "Movie", "name": "Poketto monsutâ: Serebî - Toki wo koeta deai", "url": "https://www.imdb.com/tt0287635/", "poster": "https://m.media-amazon.com/images/M/MV5BZDZiYjc3MWYtODE5Mi00MDM5LWFkZTAtNjAzZmUxMzc4ZGQxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "description": "Ash must stop a hunter who forces the mythical Pokémon Celebi to help him destroy a forest.", "contentRating": "PG", "genre": ["Animation", "Action", "Adventure"], "datePublished": "2004-01-16", "keywords": "celebi,pokemon,time travel,talking cat,cat", "duration": "PT1H15M", "rating": {"ratingCount": 9277, "bestRating": 10, "worstRating": 1, "ratingValue": 5.7}, "review": {"author": "Samiam3", "dateCreated": "2013-08-17", "inLanguage": "English", "heading": "A lesser pokemon film", "reviewBody": "Of the first four Pokemon feature films, Pokemon 4ever has the strongest Disney vibe, and I feel like it is a good choice for the youngest pokemon viewers. For the more adolescent fans (however many there are), I am more dubious to recommend this. Pokemon 3 may have been dark, but the story was imaginative and had some wisdom and emotional depth. Whereas Pokemon 3 could almost have been a family movie, Pokemon 4ever is easily just a kids movie.\n\nPokemon 4ever takes Ash and friends out of the darkness and back into sunlight. As beautiful as this fourth entry is, it is also quite corny. All pokemon movies integrate a new legendary pokemon into the story. Pokemon 4ever showcases Celebi; a forest spirit who is chirpy, but nothing more. Celebi has about as much personality as the sugar fairies in Fantasia. She may be a pokemon, but a character she is not. Equally unmemorable is the cackling antagonist, who dresses like the terminator's second cousin and behaves like a shallow Disney villain.\n\nPretty much the entire film takes place in the Johto region forest, (having been aired at the end of the fourth season) This is a visually spectacular piece of landscape, which becomes the setting for a less than spectacular storyline. Pokemon 4ever, may be concise and simple in plot, but not only is it rather shallow, but it feels strangely rushed. \n\nPokemon 4ever also has the kind of syrupy ending that tries to pull to emotions out of us which it has not earned. The pokemon world can offer a variety of strong story possibilities, but this movie does not exploit them. This is essentially a Disney movie, that has pokemon in it. My conclusion is that Pokemon 4ever is a visually strong but thinly written entry in the adventures of Ash Ketchum.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 6}}, "actor": [{"name": "Veronica Taylor", "url": "https://www.imdb.com/name/nm0853301/"}, {"name": "Rica Matsumoto", "url": "https://www.imdb.com/name/nm0559551/"}, {"name": "Rachael Lillis", "url": "https://www.imdb.com/name/nm0510418/"}], "director": [{"name": "Kunihiko Yuyama", "url": "https://www.imdb.com/name/nm0951197/"}, {"name": "Jim Malone", "url": "https://www.imdb.com/name/nm0540443/"}], "creator": [{"name": "Hideki Sonoda", "url": "https://www.imdb.com/name/nm0814473/"}, {"name": "Satoshi Tajiri", "url": "https://www.imdb.com/name/nm0846969/"}, {"name": "Jun'ichi Masuda", "url": "https://www.imdb.com/name/nm2095966/"}]}