{"type": "Movie", "name": "Possession", "url": "https://www.imdb.com/tt0082933/", "poster": "https://m.media-amazon.com/images/M/MV5BZjdkODMwYzgtNWZiZS00ZTE0LWJjMjQtYjVhZTMwNDcxYzA0XkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg", "description": "A woman starts exhibiting increasingly disturbing behavior after asking her husband for a divorce. Suspicions of infidelity soon give way to something much more sinister.", "datePublished": "1981-05-27", "duration": "PT2H4M", "contentRating": "18", "genre": ["Drama", "Horror"], "keywords": "obsession, monster, dysfunctional marriage, extramarital affair, supernatural power", "rating": {"ratingCount": 41746, "bestRating": 10, "worstRating": 1, "ratingValue": 7.3}, "review": {"author": "Yoooooofffff", "dateCreated": "2007-10-04", "inLanguage": "English", "heading": "Like nothing you have EVER seen before", "reviewBody": "I'm not very good at plot synopsis, and I very rarely write reviews, but this film could quite possibly be a distant cousin to David Lynchs 'Eraserhead', in that it involves a marriage gone wrong, a (perhaps) mutant baby, infidelity, and so much more that is felt emotionally rather than explained and read into.\n\nIt contains the most OTT, eccentric, and brilliant performances I've ever seen, and you can't say that about many films, where the performances are unique and different. There's serious acting, hammy acting, B movie acting, serious/Oscar winning acting, comical acting, silent film acting, but never any acting like you have seen in this film. And I guess you could include David Lynch acting, as thats pretty unique too. And of course method acting.\n\nIts like watching a theatrical play in cinematic form on acid. A lot of acid.\n\nI showed this to my friend who has the darkest possible taste in films I've ever known, owns over a thousand dvds, and even he was blown away by the sheer chaos, resonant imagery, beautifully swift camera work and photography, and of course, the performances. Most notably Isabella Adjani who manages to be sexy and scary as hell at the same time. Her performance in this is monumental, especially the often noted 'underground menstruation' scene which could induce some viewers to a panic attack. I certainly nearly had one when I watched the film for the first time.\n\nWhen a character has a breakdown in this film (both of the leads) its a REAL breakdown. And boy, do you ever feel it. Its realistic yet surreal. God knows how the director managed to coax these types of performances out of his actors. He must of drugged them or hypnotized them or something. He certainly didn't just yell 'action'.\n\nThe way the scenes are cut together is highly unusual and unconventional but it makes absolute perfect sense. I don't know how, it just does. I'm unfamiliar with the directors other work but if its even half as good as this I'll order everything I can get of his.\n\nRecommended to any open minded individual who likes films that draw attention to themselves with an utter sense of uniqueness.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 10}}, "actor": [{"name": "Isabelle Adjani", "url": "https://www.imdb.com/name/nm0000254/"}, {"name": "Sam Neill", "url": "https://www.imdb.com/name/nm0000554/"}, {"name": "Margit Carstensen", "url": "https://www.imdb.com/name/nm0141380/"}], "director": [{"name": "Andrzej Zulawski", "url": "https://www.imdb.com/name/nm0958558/"}], "creator": [{"name": "Andrzej Zulawski", "url": "https://www.imdb.com/name/nm0958558/"}, {"name": "Frederic Tuten", "url": "https://www.imdb.com/name/nm0878292/"}]}