{"type": "Movie", "name": "Punch-Drunk Love", "url": "https://www.imdb.com/tt0272338/", "poster": "https://m.media-amazon.com/images/M/MV5BYmE1OTY4NjgtYjcwNC00NWE4LWJiNGMtZmVhYTdlMWE1YzIxXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg", "description": "Socially frustrated Barry Egan calls a phone-sex line to curb his loneliness. Little does he know it will land him in deep trouble and will jeopardize his burgeoning romance with the mysterious Lena.", "datePublished": "2003-02-07", "contentRating": "15", "genre": ["Comedy", "Drama", "Romance"], "duration": "PT1H35M", "keywords": "pudding,absurd comedy,seduction,sister,love", "rating": {"ratingCount": 175602, "bestRating": 10, "worstRating": 1, "ratingValue": 7.3}, "review": {"author": "FilmOtaku", "dateCreated": "2004-04-20", "inLanguage": "English", "heading": "A slight departure from P.T. Anderson&apos;s `usual&apos;", "reviewBody": "Being a big fan of P.T. Anderson&apos;s work since I saw `Boogie Nights&apos; (about 3 times in one week at the theater) years ago, I anxiously awaited the release of his latest film. Then I heard it starred Adam Sandler, who is one of my least favorite actors of all time, but even then I figured that if anyone is going to make me not want to start throwing things at Sandler&apos;s image, it would be Anderson. After all, he got me to respect Tom Cruise after seeing `Magnolia&apos;. When I finally got to see the film this past weekend (after wanting to see the film for about a year) I wasn&apos;t disappointed, and I found that my trust was not misplaced. Anderson took Sandler and turned him into a sad sack who is so psychologically screwed up he would be an analyst&apos;s dream. Emily Watson is his perfect counterpart as a classy yet extremely quirky love interest. \\n\\nThe content is pure P.T. Anderson. There are issues that are brought up that are completely bizarre and unexplained, and there are themes that are culled from real-life stories or incidents. Stylistically, it&apos;s a slight departure in that it isn&apos;t quite as flashy or `slick&apos; as his last two films, but the bright primary colors that pervade the cinematography are absolutely beautiful. And instead of the steady 70&apos;s and 80&apos;s soundtrack that he usually utilizes, he kept it more simple this time, and just as inspired with the continuous running of `He Needs Me&apos; from the `Popeye&apos; soundtrack. That touch was not only fitting, but also simply brilliant. \\n\\n I love the work of P.T. Anderson, and was absolutely charmed and endeared to this film. Just like `Eternal Sunshine of the Spotless Mind&apos; isn&apos;t going to make me watch a Jim Carrey comedy, I&apos;m still going to avoid Adam Sandler comedies like the plague, but I have to say that I respect him for his work in this film. This is the kind of romance film I like, and I recommend it to anyone who doesn&apos;t settle for the kind of romantic comedy/dramas that are churned out now by Hollywood.\\n\\n--Shelly", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 8}}, "actor": [{"name": "Adam Sandler", "url": "https://www.imdb.com/name/nm0001191/"}, {"name": "Emily Watson", "url": "https://www.imdb.com/name/nm0001833/"}, {"name": "Philip Seymour Hoffman", "url": "https://www.imdb.com/name/nm0000450/"}], "director": [{"name": "Paul Thomas Anderson", "url": "https://www.imdb.com/name/nm0000759/"}], "creator": [{"name": "Paul Thomas Anderson", "url": "https://www.imdb.com/name/nm0000759/"}]}