{"type": "Movie", "name": "Raaz", "url": "https://www.imdb.com/tt0307873/", "poster": "https://m.media-amazon.com/images/M/MV5BM2JkYTJjODAtZjYwZS00NTU0LTg1YjAtYzY4YTYxN2VkMTk3XkEyXkFqcGdeQXVyMzc0NzU5MTc@._V1_.jpg", "description": "Sanjana and Aditya decide to give their marriage one last chance. They plan a holiday in Ooty, but they don't know that a strange figure is waiting for them to come.", "review": {"author": "moviefreakazoid", "dateCreated": "2004-11-11", "inLanguage": "English", "heading": "Not truly bad, but not totally great either", "reviewBody": "If you really want to watch this movie at its optimum, you have to follow certain guidelines. Watch late at night. Sit alone or maybe with someone ;) Make sure the house is real quite.\\n\\nTo enjoy a movie as the director intended, an ambiance must be created, such as that created on a late night showing at the cinema. With that in mind, here's my view.\\n\\nThis movie was shown recently on a British T.V. channel late at night. I had heard good buzz about it when it was released, I love the soundtrack and so I went in open-minded.\\n\\nHowever with that in mind, I didn't enjoy the movie too much.\\n\\nAs you will know, this is a horror flick with that psychological element thrown in along with some of the Hindi trimmings, thrown in for extra measure. The plot of What Lies Beneath is regurgitated and slightly repackaged for the audience.\\n\\nI enjoyed the opening sequences, although clich\\u00e9d to an extent, they were interesting. I think the introduction of Bipashu Basu (B.B) and Dino Morea (D.M) added weaknesses to the story. B.B isn't one of the strongest actresses. D.M didn't really have much to do. The introduction set the scene well, however the movement from the introduction to the main characters was shoddy, it wasn't fulfilling. \\n\\nAs the story progresses, the scare factor does increase, however you feel as if you can predict the next scene. Don't get me wrong, this was an enjoyable movie, not something that makes you look at the clock every 5 minutes. The director does help produce some tension in some of the scenes-you know those kinds of scenes even when you know something bad is going to happen, and you're chewing on your nails! The music scenes do fit in well; the songs are really good, although I would say the opening number is pretty weak. \\n\\nAlthough the movie may be a treat for those viewers who have not seen What Lies Beneath, this movie offers nothing more than an above the average retelling. The producers could have made something more of this film, there is great potential in the storyline. The cgi doesn't help at all, when used. It only helps create that element of the horror being false.\\n\\nA few adjustments to the story would have helped make a truly great movie. However the final product is a Hollywood rip-off, packaged for a different audience. Although members of the target audience may enjoy the movie, this does no favours for boosting the opinion held by many people of the lack of originality of Hindi films.\\n\\nMy opinion- Not a total waste of time, the movie has its plus points which will keep you engrossed. However if you are looking for something original on the cinematic plateau, you won't find it here. My rating 6/10", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 4035, "bestRating": 10, "worstRating": 1, "ratingValue": 6.6}, "contentRating": "15", "genre": ["Drama", "Horror", "Musical"], "datePublished": "2002-02-01", "keywords": "vacation gone wrong,cigarette smoking,f word,driving off a cliff,foreign language film", "duration": "PT2H31M", "actor": [{"name": "Dino Morea", "url": "https://www.imdb.com/name/nm0603352/"}, {"name": "Bipasha Basu", "url": "https://www.imdb.com/name/nm0060607/"}, {"name": "Malini Sharma", "url": "https://www.imdb.com/name/nm1133218/"}], "director": [{"name": "Vikram Bhatt", "url": "https://www.imdb.com/name/nm0080333/"}], "creator": [{"name": "Mahesh Bhatt", "url": "https://www.imdb.com/name/nm0080315/"}, {"name": "Girish Dhamija", "url": "https://www.imdb.com/name/nm0223475/"}]}