{"type": "Movie", "name": "Red Dragon", "url": "https://www.imdb.com/tt0289765/", "poster": "https://m.media-amazon.com/images/M/MV5BOTAwZDI1OTctN2Q5YS00OGNiLWIyMmUtYWM4ZGFjYWYyYzJjXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg", "description": null, "review": {"author": "TheLittleSongbird", "dateCreated": "2015-06-07", "inLanguage": "English", "heading": "One of those rare instances where the remake is almost on the same level as the original", "reviewBody": "Of the Hannibal Lecter films, the best will always be The Silence of the Lambs to me, a masterful film and one of the best of its genre. Red Dragon is a remake of the 1986 Michael Mann-directed adaptation Manhunter and also a much more literal adaptation of the book, and again from personal opinion both are very good films, Red Dragon being one of the rare instances where the remake is almost on the same level as the original(though the two have components that are both better and worse than the other). All three films are vastly superior to Hannibal and Hannibal Rising, both of which were disappointing.\\n\\nManhunter has some things that are done better than in Red Dragon. It is generally grittier, more menacing and more atmospheric and the performances of Will Graham and Jack Crawford are superior. I personally didn't care for Edward Norton, who had the potential to be every bit as dark and haunted as William Peterson, but this was a rather ordinary and phoned-in performance which unusual for a great actor like Norton. Harvey Keitel is another talented actor but doesn't play Jack with anywhere near the same amount of heart as Dennis Farina did and seemed out of place.\\n\\nRed Dragon on the other hand also does things that are superior to Manhunter. I am actually of the opinion that Manhunter is still a well-made and directed film, but the budget was noticeably bigger in Red Dragon meaning it has a more expansive cinematic feel and a slicker look. It may lack the wonderfully grim look of Silence of the Lambs, but it didn't look that clean to me. Danny Elfman's music score, while not anywhere near among his best, fits very well and is very haunting and energised, much improved over the rather dated and often out of place and intrusive music in Manhunter(my only problem with that film). Dollarhyde's also better developed here(though a little less frightening), giving the character some poignancy while not ever forgetting how much of a monster he is, with the relationship between him and Rena beautifully done and played.\\n\\nBrett Ratner's direction is surprisingly good here, have never thought of it particularly highly as a director before but he brings suspense and palpable tension to the very engrossing and chillingly atmospheric story without letting the visual style get in the way. Performances are fine apart from Norton and Keitel. Anthony Hopkins reprises his most iconic role as Lecter and has the right amount of creepiness, nuance, sophistication and twisted hamminess without falling into cartoonish caricature. Emily Watson's Rena is superb and very touching, far more memorable than Joan Allen for Manhunter, and Phillip Seymour Hoffmann is amusing. Ralph Fiennes, despite reservations initially about him being too handsome and not imposing enough, is every bit as frightening as Tom Noonan, if not as much as a monster, and gives an emotional unstability that comes over in a way that allows one to sort of sympathise with him.\\n\\nOther than Norton and Keitel, my only other complaints are the ending and some of the script. Not all of the script is problematic, most of it is tightly structured, makes sense and very respectful to the style of the book's writing, also managing to be dynamic and thought-provoking, not ceasing to be suspenseful or entertaining. The film definitely could have done more with Graham's character, who lacked the colour and dimension that went visibly into Lecter and Dollarhyde, Graham was too dull, too ordinary and too clinical to me here. More of a problem is that it starts a little too heavy in the exposition, some of it being written in a sloppy and over-explanatory way, as well as going for blunt maximum drama and throwing subtlety out the window. With the ending, the climax is rushed and ridiculously over-the-top and the end twist to me felt very tacked on and reeked of studio executive interference.\\n\\nIn summary, Red Dragon is a more than worthy remake to Manhunter and is a very good film in its own right. 8/10 Bethany Cox", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 8}}, "rating": {"ratingCount": 289033, "bestRating": 10, "worstRating": 1, "ratingValue": 7.2}, "contentRating": "15", "genre": ["Crime", "Drama", "Thriller"], "datePublished": "2002-10-11", "keywords": "fbi agent,criminal profile,blindness,tabloid reporter,based on novel", "duration": "PT2H4M", "actor": [{"name": "Anthony Hopkins", "url": "https://www.imdb.com/name/nm0000164/"}, {"name": "Edward Norton", "url": "https://www.imdb.com/name/nm0001570/"}, {"name": "Ralph Fiennes", "url": "https://www.imdb.com/name/nm0000146/"}], "director": [{"name": "Brett Ratner", "url": "https://www.imdb.com/name/nm0711840/"}], "creator": [{"name": "Thomas Harris", "url": "https://www.imdb.com/name/nm0365383/"}, {"name": "Ted Tally", "url": "https://www.imdb.com/name/nm0848217/"}]}