{"type": "Movie", "name": "Resident Evil", "url": "https://www.imdb.com/tt0120804/", "poster": "https://m.media-amazon.com/images/M/MV5BZmI1ZGRhNDYtOGVjZC00MmUyLThlNTktMTQyZGE3MzE1ZTdlXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_.jpg", "description": "A special military unit fights a powerful, out-of-control supercomputer and hundreds of scientists who have mutated into flesh-eating creatures after a laboratory accident.", "review": {"author": "cherold", "dateCreated": "2003-10-08", "inLanguage": "English", "heading": "Finally, a video game adaption done right", "reviewBody": "This movie means business. Quick disaster with a mystery to it, jarring deaths, naked Milla, all in the first few minutes. It keeps up the pace throughout. In terms of critical comments, yes, you don't really care about the characters, but so what? How often do you really care about the monster fodder in horror films? And true, it wasn't a literal working of the movie, it didn't take place in a mansion and it didn't involve exploring lots of rooms and solving puzzles. That's because it's a movie. A literal translation of Resident Evil would probably be really dull. Games and movies are very different mediums. I don't think some people here understand that. One guy said he thought the movie rocked but after repeated viewings he thought it sucked, and that's a video game player attitude - movies don't have to have good replay value, it's okay to enjoy them once. I only enjoyed Star Wars once, but I don't think it sucked, it just didn't have a lot of depth. Not every movie has to be Citizen Kane. \n\nIt was an engaging story, moved like lightning and had some excellent scares.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 7}}, "rating": {"ratingCount": 286181, "bestRating": 10, "worstRating": 1, "ratingValue": 6.6}, "contentRating": "15", "genre": ["Action", "Horror", "Sci-Fi"], "datePublished": "2002-07-12", "keywords": "zombie,commando,zombie outbreak,bio weapon,amnesia", "duration": "PT1H40M", "actor": [{"name": "Milla Jovovich", "url": "https://www.imdb.com/name/nm0000170/"}, {"name": "Michelle Rodriguez", "url": "https://www.imdb.com/name/nm0735442/"}, {"name": "Ryan McCluskey", "url": "https://www.imdb.com/name/nm1011675/"}], "director": [{"name": "Paul W.S. Anderson", "url": "https://www.imdb.com/name/nm0027271/"}], "creator": [{"name": "Paul W.S. Anderson", "url": "https://www.imdb.com/name/nm0027271/"}]}