{"type": "Movie", "name": "Signs", "url": "https://www.imdb.com/tt0286106/", "poster": "https://m.media-amazon.com/images/M/MV5BNDUwMDUyMDAyNF5BMl5BanBnXkFtZTYwMDQ3NzM3._V1_.jpg", "description": "A widowed former reverend living with his children and brother on a Pennsylvania farm finds mysterious crop circles in their fields, which suggests something more frightening to come.", "review": {"author": "xfile731", "dateCreated": "2002-08-03", "inLanguage": "English", "heading": "Visually terrific", "reviewBody": "M. Night Shyamalan has done it again, and this time, better. If 'Unbreakable' left skepticism about the young director, `Signs' will make you a believer again.\\n\\nMel Gibson and his family, one boy, one girl, and Gibson's younger brother (Joaquin Phoenix) take residence in the small town of Bucks County, Pennsylvania. Gibson's wife is not a member of this household (we find out why, later). Shot over and around a 'Walton's-style' house and surrounded by crops, we get the eerie feeling that we are to be entangled here for the next two hours. Immediately, the children notice gigantic perfect circular shapes or signs as we like to call them, appearing within the crops. Is this a hoax or War of the Worlds? And, that's all you need to know. The rest of film will dazzle you with style, suspense, and downright scariness.\\n\\n The key ingredients to this recipe for storytelling is one half Close Encounters of the Third Kind, a dash of Stephen King, sprinkled with Orson Wells. Shyamalan also uses Hitchcock like close ups, wicked camera angles, and a blasting score. You are locked in as soon as the movie begins. You will tilt your head in wonder and confusion, as characters in the film do. There is a deep desire to figure this all out, while your stuck in the middle of nowhere, nowhere being Bucks County.\\n\\nThe picture gives us two ultimate dilemmas to wrestle with. Two basic questions we must ask ourselves. Are our daily occurrences and the paths we choose Coincidence? Or, are is it just plain Luck? Shyamalan weaves these posing questions into a subplot, with trickery until the end. From scene to scene, he leaves no fades to black. As one scene ends the other smartly begins. That's what keeps the audience watching as if we were tucked tightly into our beds and rapidly turning pages of a good book. Each page is significant. This movie isn't just about crops. That's what makes Shyamalan such a keen filmmaker. He has the talent and ability to fog up the film, and distract you with different propositions.\\n\\nShyamalan uses technique to peak his story, rather than dialogue. His masterful and favorite formula is the usage of flashbacks, which gives the audience a chance to catch up on what they might have missed. He emphasizes his points by re-occurring scenes and replaying them for the grand effect, the 11th hour, until he hits you with the finale. Whether you believe the outcome or not, you cannot deny his aptitude for storytelling.\\n\\n This nervous and paranoid feature film with a heart-pounding ending is terrific. I was still thinking about it when I left the theater. You too, will enjoy the ride. But, when it's over, say your prayers, get into bed, pull the sheets over your head, breathe a sigh of relief, and close the book!", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 383306, "bestRating": 10, "worstRating": 1, "ratingValue": 6.8}, "contentRating": "12A", "genre": ["Drama", "Mystery", "Sci-Fi"], "datePublished": "2002-09-13", "keywords": "crop circle,extraterrestrial,crop,farm,farmhouse", "duration": "PT1H46M", "actor": [{"name": "Mel Gibson", "url": "https://www.imdb.com/name/nm0000154/"}, {"name": "Joaquin Phoenix", "url": "https://www.imdb.com/name/nm0001618/"}, {"name": "Rory Culkin", "url": "https://www.imdb.com/name/nm0191412/"}], "director": [{"name": "M. Night Shyamalan", "url": "https://www.imdb.com/name/nm0796117/"}], "creator": [{"name": "M. Night Shyamalan", "url": "https://www.imdb.com/name/nm0796117/"}]}