{"type": "Movie", "name": "Sonny", "url": "https://www.imdb.com/tt0305973/", "poster": "https://m.media-amazon.com/images/M/MV5BMTY2MzUzMDU3Nl5BMl5BanBnXkFtZTcwNzQ1MTAwMQ@@._V1_.jpg", "description": "An honorably discharged soldier returns home to New Orleans, hoping to break away from his upbringing as a trained prostitute, but his brothel-madam mother has other expectations.", "review": {"author": "cedar_circle", "dateCreated": "2007-05-20", "inLanguage": "English", "heading": "Glued by the performances...", "reviewBody": "I'll be honest, my reasoning for renting this was to watch Franco's performance. I'm coming to respect his talent and the roles he chooses; intelligent.\n\nSo I watched the trailer and thought that it might stink. I held my breath. All I can say is 'wow'. This movie is gritty and intense and lacks the Hollywood gloss - which I loved. It's REAL. It's not pretty. It's life. \n\nI've been kicking around the idea of pursuing acting and high-tailing it to a good school, so I watched all the performer's in this like a hawk. I really did. And I couldn't see the acting. It blew me away. Everyone, down to the bit parts were spot on. Watch their eyes, everyone gives that honesty that you don't see the actor's...you loose yourself in the characters despite yourself. So I really resonated with one writer's comment on here that this is an actor's film. If you're looking for Hollywood this isn't it. I will be seeking out more Indie's now, and checking out that scene. \n\nBesides Franco, I was equally impressed with H.D. Stanton; his kitchen scene was another one of those 'wows' for me. When the movie was over I just sat there and realized what a surprise of a film it wound up being. I expected, I don't know what I expected really, but certainly not that. \n\nFor anyone who hasn't seen it: if you're into character study and performance, it's worth it. If you're looking for simple entertainment, it won't hold you and you'll be disappointed.\n\nThis was the first time I went back and watched a movie with the commentary on, I watched it with the writer's commentary first (which is hilarious at some points and cracked me up) and then with Nic's. I enjoyed both. \n\nN.\n\n*btw, I forgot to mention also that I thought the music was great also. The classical pieces were a good touch, Ring of Fire has been in my head for days and is driving me nuts; the soft theme is just haunting; emotional and tender. Subtly tragic and lonely, like the film itself. Some people might not really get this movie. I thought it was quite powerful.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 9}}, "rating": {"ratingCount": 4537, "bestRating": 10, "worstRating": 1, "ratingValue": 5.6}, "contentRating": "18", "genre": ["Crime", "Drama"], "datePublished": "2003-03-21", "keywords": "gigolo,brothel madam,prostitute,nudity,cocktail party", "duration": "PT1H50M", "actor": [{"name": "James Franco", "url": "https://www.imdb.com/name/nm0290556/"}, {"name": "Brenda Blethyn", "url": "https://www.imdb.com/name/nm0000950/"}, {"name": "Mena Suvari", "url": "https://www.imdb.com/name/nm0002546/"}], "director": [{"name": "Nicolas Cage", "url": "https://www.imdb.com/name/nm0000115/"}], "creator": [{"name": "John Carlen", "url": "https://www.imdb.com/name/nm0137368/"}]}