{"type": "Movie", "name": "Sorority Boys", "url": "https://www.imdb.com/tt0279781/", "poster": "https://m.media-amazon.com/images/M/MV5BMTA1ODMxODQ1MjheQTJeQWpwZ15BbWU2MDM2MjE3Ng@@._V1_.jpg", "description": "Strapped for cash, three fraternity playboys make one last attempt to live the high life - cheaply - by masquerading as girls. But their chauvinistic ways come back to haunt them as they get a crash course in the opposite sex.", "datePublished": "2002-03-22", "contentRating": "15", "genre": ["Comedy"], "duration": "PT1H33M", "keywords": "transvestite,false accusation,accusation,disguise,pretending to be someone else", "rating": {"ratingCount": 16189, "bestRating": 10, "worstRating": 1, "ratingValue": 5.4}, "review": {"author": "Movie-ManDan", "dateCreated": "2016-09-21", "inLanguage": "English", "heading": "I Would Be Lying If I Said This Didn't Make Me Laugh.", "reviewBody": "Guys in drag has been done with much better results than this. And there's even college films out there than this. I'm not praising this and saying this was better than Tootsie, but it was actually really funny. My 10/10 may well be a sympathy vote, but who cares, the movie was hilarious and irresistible.\\n\\nThe movie stars Barry Watson from 7th Heaven and Michael Rosenbaum from Smallville star as Dave and Adam, two high-standing people from the KOK Fraternity. Them and the frat idiot Doofer (Harland Williams) are framed for stealing money for an important cruise and are kicked out with no place to go. They then dress up as women under the names Daisy, Adina, and Roberta and pledge the DOG Sorority, where all the ugly and weird girls go. I almost hate admitting this, but the lead actors were actually kinda cute as the women they were playing. Watson particularly looks hot as Daisy. What unfolds next is your run-of- the-mill gender-bender where the guys get a chance to see life in a woman's perspective and they help the other girls change for the better. That has been done many times before with much better results. But does better always mean funnier? Not necessarily. It has its moments of sheer hilarity. Aside from that, the movie itself is just simply fun and enjoyable. This isn't a must own or highly recommended, just the perfect movie to watch if you want to kill time or crave something simple-yet-funny.\\n\\n3/4", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 7}}, "actor": [{"name": "Barry Watson", "url": "https://www.imdb.com/name/nm0005538/"}, {"name": "Harland Williams", "url": "https://www.imdb.com/name/nm0005558/"}, {"name": "Michael Rosenbaum", "url": "https://www.imdb.com/name/nm0742146/"}], "director": [{"name": "Wallace Wolodarsky", "url": "https://www.imdb.com/name/nm0938645/"}], "creator": [{"name": "Joe Jarvis", "url": "https://www.imdb.com/name/nm0419072/"}, {"name": "Greg Coolidge", "url": "https://www.imdb.com/name/nm0177637/"}]}