{"type": "Movie", "name": "Storytelling", "url": "https://www.imdb.com/tt0250081/", "poster": "https://m.media-amazon.com/images/M/MV5BNjYzNGIyNzUtNzAxZi00NzFhLTg3MDktMzljOGVmMDllNDg0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "description": "College and high school serve as the backdrop for two stories about dysfunction and personal turmoil.", "contentRating": "18", "genre": ["Comedy", "Drama", "Romance"], "datePublished": "2001-11-30", "keywords": "high school, high school student, homosexual, homosexual teenager, high school football", "duration": "PT1H27M", "actor": [{"name": "Selma Blair", "url": "https://www.imdb.com/name/nm0004757/"}, {"name": "Leo Fitzpatrick", "url": "https://www.imdb.com/name/nm0280559/"}, {"name": "Robert Wisdom", "url": "https://www.imdb.com/name/nm0936298/"}], "director": [{"name": "Todd Solondz", "url": "https://www.imdb.com/name/nm0001754/"}], "creator": [{"name": "Todd Solondz", "url": "https://www.imdb.com/name/nm0001754/"}], "review": {"author": "Chris_Docker", "dateCreated": "2001-08-27", "inLanguage": "English", "heading": "Accurate and scathing attack on various forms of political correctness", "reviewBody": "Probably Director Todd Solondz&apos; most mature work to date, Storytelling is split into two parts `Fiction&apos; and `Non-Fiction&apos; - yet similar themes underlie both and pose questions about what we call reality when it comes to prejudice and taboo subjects. Whilst in previous attempts (such as `Happiness&apos;) Solondz&apos; work has merely been controversial, in this film he berates political correctness more accurately and more entertainingly. It exposes ridiculous attitudes in the name of political correctness, whether it is the student with an awful essay who almost escapes criticism because he has cerebral palsy, or a black teacher who gets away with being a pervert because his victim doesn&apos;t want to entertain thoughts of racism. Nothing is sacred: Jews and the Holocaust also come in for merciless examination. But part of the film involves the story of a `documentary&apos; being made within the main story, by an exploitative screwed up filmmaker who wants to do his own thing in the name of art, so in this sense, Storytelling even turns on itself and questions the validity of using the subject matter that it does. A controversial, worthy, and very entertaining film that stretches your ability to make moral judgements within a convincingly coherent framework.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 8}}, "rating": {"ratingCount": 18262, "bestRating": 10, "worstRating": 1, "ratingValue": 6.8}}