{"type": "Movie", "name": "The Dangerous Lives of Altar Boys", "url": "https://www.imdb.com/tt0238924/", "poster": "https://m.media-amazon.com/images/M/MV5BOTFiNzczYWUtNTVjNS00OTZlLTk1ZTktOTg0YmY4OWM0YjZlXkEyXkFqcGdeQXVyMjY4OTU1NTE@._V1_.jpg", "description": "A group of Catholic school friends, after being caught drawing an obscene comic book, plan a heist that will outdo their previous prank and make them local legends.", "review": {"author": "Buddy-51", "dateCreated": "2003-07-05", "inLanguage": "English", "heading": "uneven, well acted film", "reviewBody": "`The Dangerous Lives of Altar Boys&apos; is NOT, as you might expect, a film about predatory priests, but rather a slice-of-life tale about four malcontent Catholic schoolboys who spend most of their free time devising preposterously elaborate and life-threatening practical jokes to play on the faculty members of their school.\\n\\nAs a coming-of-age drama, the film is fairly conventional in its plotting - i.e. young boys, in their rebellion against the uncomprehending adult world, experiment with drugs, first love, sex and general rule breaking - although there is a tricky and touchy incest-related subplot that is handled with a certain amount of delicacy and sensitivity. The highlight of the movie is the outstanding performances delivered by youngsters Emile Hirsch, Kieran Culkin and Jena Malone, whom you might remember as the young Jodie Foster in `Contact.&apos; In fact, Foster herself appears in this film (in addition to co-producing it) as the uptight nun, Sister Assumpta. Unfortunately, her character is probably the least well developed one in the film, a fact that seems more obvious than it otherwise might if an actress of Foster&apos;s caliber were not playing the part.\\n\\nThe film also displays a nice feeling for its early-70&apos;s setting and does a good job capturing the way young people actually speak and communicate (the cast members have their nonverbal expressions and gestures down beautifully as well). Working from the novel by Chris Fuhrman, screenwriters Jeff Stockwell and Michael Petroni, along with director Peter Care, interrupt the live action at regular intervals to provide animated sequences that are ostensibly derived from the anarchic superhero comic book on which the gifted boys are collaborating. We know that these sequences are intended to provide a kind of fantasy alternate universe for these troubled kids who seem to find no meaning in the restricted world of religion and rules in which they find themselves, but the fact is that these sections of the film, not very creative in themselves, merely serve to thrust us out of the story at crucial moments.\\n\\n`The Dangerous Lives of Altar Boys&apos; is an odd and somewhat misleading title for this film, since most of the `danger&apos; these boys face is, primarily, a product of their own stupidity and not of their religious upbringing. Indeed, the religious figures in the film are mainly cranky and/or ineffectual, not really dangerous. `The Dangerous Lives of Altar Boys&apos; is an uneven film, but the superb performances by its youthful cast members make it ultimately worth seeing.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 14132, "bestRating": 10, "worstRating": 1, "ratingValue": 6.9}, "contentRating": "15", "genre": ["Comedy", "Drama"], "datePublished": "2002-06-28", "keywords": ["glowing eye", "nosebleed", "watching tv", "cartoon on tv", "cigarette"], "duration": "PT1H44M", "actor": [{"name": "Kieran Culkin", "url": "https://www.imdb.com/name/nm0001085/"}, {"name": "Jena Malone", "url": "https://www.imdb.com/name/nm0540441/"}, {"name": "Emile Hirsch", "url": "https://www.imdb.com/name/nm0386472/"}], "director": [{"name": "Peter Care", "url": "https://www.imdb.com/name/nm0136775/"}], "creator": [{"name": "Chris Fuhrman", "url": "https://www.imdb.com/name/nm0297626/"}, {"name": "Jeff Stockwell", "url": "https://www.imdb.com/name/nm0830969/"}, {"name": "Michael Petroni", "url": "https://www.imdb.com/name/nm0678104/"}]}