{"type": "Movie", "name": "The Count of Monte Cristo", "url": "https://www.imdb.com/tt0245844/", "poster": "https://m.media-amazon.com/images/M/MV5BMDM0ZWRjZDgtZWI0MS00ZTIzLTg4MWYtZjU5MDEyMDU0ODBjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "description": null, "review": {"author": "sweetrupturedlight", "dateCreated": "2003-05-04", "inLanguage": "English", "heading": "Excellent!", "reviewBody": "I hired this one on a whim, remembering that i had seen the trailer and had been vaguely intrigued. I have to admit, having gone in with little expectation, i was flawed! This was one of the better movies that i have seen in a long time. Jim Caviezel&apos;s performance is slightly whiny to begin with, but in the context of the whole story, the reason therefore is appreciated and makes his transition and growth as a character that much more riveting to watch. I absolutely loved him as Edmund Dantes then the dynamic Count of Monte Cristo and cannot have imagined a better choice. He was definitely not bad on the eyes either. Every scene had him looking more dashing and more handsome than the one before.\\n\\nGuy Pierce surprised me with a performance that was totally believable. His dry humour only made him more appealing, very well acted.\\n\\nThe entire epic, though long, never gives you the impression that you have been sitting still for ages. It moves along swiftly and always had me gripped, from the action, suspense, and even to the humour that was evident from time to time. The love story surprised me most of all. Instead of taking on a highly sexual slant, as all these new films do, it was understated, the female lead doing an admirable job of portraying the wounded lover, who has always longed for her Edmund. I loved the innocence that she managed to bring to the role, a really terrific actress and a really beautiful one as well.\\n\\nWonderfully scripted, exceptionally carried out! This has to be the best adaptation yet!\\n\\nAn emphatic 10!", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 10}}, "rating": {"ratingCount": 147469, "bestRating": 10, "worstRating": 1, "ratingValue": 7.7}, "contentRating": "PG-13", "genre": ["Action", "Adventure", "Drama"], "datePublished": "2002-03-29", "keywords": "revenge,treasure,sword fight,napoleon bonaparte character,five word title", "duration": "PT2H11M", "actor": [{"name": "Jim Caviezel", "url": "https://www.imdb.com/name/nm0001029/"}, {"name": "Guy Pearce", "url": "https://www.imdb.com/name/nm0001602/"}, {"name": "Christopher Adamson", "url": "https://www.imdb.com/name/nm0011478/"}], "director": [{"name": "Kevin Reynolds", "url": "https://www.imdb.com/name/nm0721817/"}], "creator": [{"name": "Alexandre Dumas", "url": "https://www.imdb.com/name/nm0241416/"}, {"name": "Jay Wolpert", "url": "https://www.imdb.com/name/nm0938684/"}]}