{"type": "Movie", "name": "The Cat's Meow", "url": "https://www.imdb.com/tt0266391/", "poster": "https://m.media-amazon.com/images/M/MV5BZDc5YWRjZjktNWY0OC00ZTBkLThhMjQtY2QyYzdlM2Y5Y2ZkXkEyXkFqcGdeQXVyMjA5MTIzMjQ@._V1_.jpg", "description": "Semi-true story of the Hollywood murder that occurred at a star-studded gathering aboard William Randolph Hearst's yacht in 1924.", "review": {"author": "deadclowncollege", "dateCreated": "2005-05-15", "inLanguage": "English", "heading": "Peter Bogdanovich is back, folks", "reviewBody": "I have to say, I thought the Cat's Meow was the cat's pajamas. Peter Bogdanovich has made a story out of an event whose outcome is still unexplained. What's more, it feels like it actually could've happened. The interactions between the characters leading up to the act are given much more screen time than the actual act itself. So when it happens, it doesn't seem preposterous at all.\\n\\nThe story concerns newspaper honcho William Randolph Hearst (Edward Herrmann) and company celebrating the birthday of Hollywood producer Thomas Ince (Cary Elwes) on Hearst's yacht. That company includes Hearst's lover/actress Marion Davies (Kirsten Dunst), Charlie Chaplin (Eddie Izzard), author Elinor Glyn (Joanna Lumley), gossip columnist for Hearst's newspaper Louella Parsons (Jennifer Tilley), and Tom's lover. Tom hopes to negotiate a contract with W.R. Hearst for Marion to star in his next few films, but Hearst is more concerned about the attraction between Marion and Chaplin. Elinor is nearby to dispense advice, while Louella unsuccessfully attempts to mingle. There's also a pair of party girls on board attempting to have a raucous time as possible.\\n\\nThe Cat's Meow has an eclectic ensemble with a Robert Altman-esquire taste to it. Edward Herrmann's role may be the most challenging, because he has to juggle eccentric, warmth, and jealousy as W.R. Hearst. Joanna Lumley is wonderfully dry. And for those like me who only remember Eddie Izzard for his droll stand-up work, he's surprising in this film. He's quite good as Charlie Chaplin. Kirsten Dunst is the biggest name on the cast. She's very fetching in the Cat's Meow, and this represents a change of pace from her dearth of Hollywood-oriented films.\\n\\nAs good as the cast is, this is really just as much Peter Bogdanovich's film. After the excellent Last Picture Show, he sort of faded away and made smaller films (The Thing Called Love, for example). Although The Cat's Meow will not make him a household name, hopefully maybe his work will garner more attention again. His direction is very good here.\\n\\nOh, I should also mention the costume design and music here. The production values in general are excellent in imitating the feel of that era. I was reminded a little of Woody Allen's Bullets Over Broadway (and not just the Jennifer Tilly connection). Anyways, The Cat's Meow is a good movie with interesting characters and thoughtful direction.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 8}}, "rating": {"ratingCount": 8903, "bestRating": 10, "worstRating": 1, "ratingValue": 6.4}, "contentRating": "12", "genre": ["Crime", "Drama", "Romance"], "datePublished": "2004-06-04", "keywords": "1920s,watching a movie,thomas ince character,november,interwar period", "duration": "PT1H54M", "actor": [{"name": "Kirsten Dunst", "url": "https://www.imdb.com/name/nm0000379/"}, {"name": "Cary Elwes", "url": "https://www.imdb.com/name/nm0000144/"}, {"name": "Edward Herrmann", "url": "https://www.imdb.com/name/nm0001346/"}], "director": [{"name": "Peter Bogdanovich", "url": "https://www.imdb.com/name/nm0000953/"}], "creator": [{"name": "Steven Peros", "url": "https://www.imdb.com/name/nm0674432/"}]}