{"type": "Movie", "name": "The Emperor's Club", "url": "https://www.imdb.com/tt0283530/", "poster": "https://m.media-amazon.com/images/M/MV5BNmZiMTY3OTctNDlkMC00Njk0LWE0NTAtODViNzk3OTFhMzI3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "description": null, "review": {"author": "kcrawford", "dateCreated": "2002-11-27", "inLanguage": "English", "heading": "A truly great idea in mediocre clothing", "reviewBody": "I can see exactly why comparisons to Dead Poets' Society abound. Having attended boarding school and developed an irrational attachment to that film at the time, I have since discarded it like an overworn leisure suit, and tried to move on to more interesting fare. But honestly, this film made me think -- in all the ways that school should have, and the DPSociety didn't even try to.\\n\\nRobin Williams has never starred in a thinking man's film, which is why, in the end, the comparison between the two movies doesn't hold up. To get The Emperor's Club, you have to actually grasp why someone might be inspired by history -- by a time when men could truly fail, or conquer, or establish a foothold in eternity. The fact that we know Socrates existed is astounding. It is luck. If James Carville goes down in history it will be an accident, if a likely one. The point of this film is that difference -- the difference between men whose character demands to be remembered, and men whose character demands to be forgotten. It is also the story of two systems of reward and recognition -- one that produced Plato and one that produced Jerry Springer. That is why we study history, as the movie says. To learn from and be inspired by the great leaders who came before us, and to overcome the moral mediocrity of the modern world.\\n\\nBut, as the film concludes, great men are no longer chosen to lead. The Emperor's Club, while cloaked in the guise of a charming elitist flick, is actually a tale of profound disappointment and disillusionment regarding human society. The few great men who are left exist in the shadows, while the ignorant grandstanders wield political power. We elect them; we are in their hands. And it is all because of a lack of awareness, a lack of knowledge, and a lack of history. People don't vote for principle -- they vote for rhetoric. And it shows.\\n\\nI was not expecting too much from this movie, other than the always pleasurable experience of watching Kevin Kline. But, wrapped up in the sentimental moralizing, there was the story of a great man doing the only great thing left: trying to bring others out the darkness. His success or failure is as immaterial as the execution of Socrates -- it really is the thought that counts.", "reviewRating": {"worstRating": 1, "bestRating": 10, "ratingValue": 8}}, "rating": {"ratingCount": 17811, "bestRating": 10, "worstRating": 1, "ratingValue": 6.9}, "contentRating": "PG", "genre": ["Drama"], "datePublished": "2002-11-22", "keywords": "pornographic magazine,golf resort,told in flashback,ear piece,marriage", "duration": "PT1H49M", "actor": [{"name": "Kevin Kline", "url": "https://www.imdb.com/name/nm0000177/"}, {"name": "Emile Hirsch", "url": "https://www.imdb.com/name/nm0386472/"}, {"name": "Joel Gretsch", "url": "https://www.imdb.com/name/nm0340408/"}], "director": [{"name": "Michael Hoffman", "url": "https://www.imdb.com/name/nm0001355/"}], "creator": [{"name": "Ethan Canin", "url": "https://www.imdb.com/name/nm0133982/"}, {"name": "Neil Tolkin", "url": "https://www.imdb.com/name/nm0866063/"}]}