{"type": "Movie", "name": "Unfaithful", "url": "https://www.imdb.com/tt0250797/", "poster": "https://m.media-amazon.com/images/M/MV5BNWRkOTdjMjktZTViMy00ZTgyLTg3NzktODdiZDk1YTExOGFhXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg", "description": "A New York suburban couple's marriage goes dangerously awry when the wife indulges in an adulterous fling.", "review": {"author": "raysond", "dateCreated": "2002-06-01", "inLanguage": "English", "heading": "Something we had ALREADY seen before", "reviewBody": "For much of his career,director Adrian Lyne has clearly had sex on the brain,or thoughts of eroticial porno,turning out huff and puff features both good(the Oscar winning Fatal Attraction and the controversial Lolita)and bad(9 1/2 Weeks and Indecent Proposal,the latter firmly cemented as one of the worst films of its decade). Happily,Unfaithful rests more toward the upper end of the spectrum;based on a 1969 French film by Claude Chabrol(La Femme Infidele),the movie sports a continental demeanor that seems wholly appreciate,but as a whole we have seen this kind of adulterated behavior several times before. Diane Lane's standout performance is what elevates the first half,which could be easily dismissed as a straight-to-cable soaper or straight-to-video softcore porno assembly. A well to do housewife seemingly content with her husband(Richard Gere,is one of his best works here and one of his finest performances since the latter part of the 80's and early 90's),her son (Erik Per Sullivan),and her home in a quaint New York(upscale Manhattan) suburb,unexpectedly enters into a torrid affair with a French book dealer(Oliver Martinez-who looks like something out of grocery store paperback novel and one of those daytime TV soap hunks). Lane's complex portrayal of a woman caught between the borders of reason and risk is simply smashing,yet eventually she's not required to carry the picture by herself,as the second half heads off in some interesting and unexpected directions that ultimately lead to the wonderful amibiguous final shot. Unfaithful works for viewers willing to put some thought into it that only works for those who want cheap thrills will probably be disappointed,but in all its a illusion of eternal bliss that will find this easily a satisfying picture.", "reviewRating": {"worstRating": null, "bestRating": null, "ratingValue": null}}, "rating": {"ratingCount": 97481, "bestRating": 10, "worstRating": 1, "ratingValue": 6.7}, "contentRating": "15", "genre": ["Drama", "Romance", "Thriller"], "datePublished": "2002-06-07", "keywords": "infidelity,erotic thriller,marital infidelity,adulterous wife,wife's lover murdered by husband", "duration": "PT2H4M", "actor": [{"name": "Richard Gere", "url": "https://www.imdb.com/name/nm0000152/"}, {"name": "Diane Lane", "url": "https://www.imdb.com/name/nm0000178/"}, {"name": "Olivier Martinez", "url": "https://www.imdb.com/name/nm0553648/"}], "director": [{"name": "Adrian Lyne", "url": "https://www.imdb.com/name/nm0001490/"}], "creator": [{"name": "Claude Chabrol", "url": "https://www.imdb.com/name/nm0001031/"}, {"name": "Alvin Sargent", "url": "https://www.imdb.com/name/nm0765091/"}, {"name": "William Broyles Jr.", "url": "https://www.imdb.com/name/nm0115310/"}]}