{
  "type": "Movie",
  "name": "First Cow",
  "url": "https://www.imdb.com/tt9231040/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMGUzMGEzM2UtMDg2Ny00Yjk1LTgxMTctMWI1ZGM0ZDBiYjgxXkEyXkFqcGdeQXVyMTA4NjE0NjEy._V1_.jpg",
  "description": "A skilled cook has traveled west and joined a group of fur trappers in Oregon, though he only finds true connection with a Chinese immigrant also seeking his fortune. Soon the two collaborate on a successful business.",
  "review": {
    "author": "TxMike",
    "dateCreated": "2020-11-22",
    "inLanguage": "English",
    "heading": "Catchy title, interesting movie that moves slowly and seems overlong.",
    "reviewBody": "The movie begins with a modern day scene, we know the period only because we see a modern ship on the river. Then soon a skull is discovered and then two adult skeletons laying side by side in either a shallow grave, or maybe just covered by debris over the past 150+ years.\n\nMost of the story is in the 1800s as explorers travel west to build a new life and perhaps find some of that gold. Gradually two men become friends, one a Chinaman the other a man from Maryland trained as a cook after being orphaned. When the first cow shows up, owned by a wealthy man, the two hatch a plan to form a business.\n\nIt is a nice story of friendship and cooperation to overcome obstacles, but as the period would dictate the men are dirty, the scenes are unattractive, and the story often moves quite slowly. It is almost 2 hours and I found myself wishing it had been 80 to 90 minutes.\n\nThe user reviews are quite polarized, many love it while many hate it. I can understand both extremes, I am somewhere in the middle.\n\nMy wife and I watched it at home on BluRay from my local library.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 21316,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "12A",
  "genre": [
    "Drama",
    "Western"
  ],
  "datePublished": "2021-05-28",
  "keywords": "cow,friendship,oregon territory,cook,river",
  "duration": "PT2H2M",
  "actor": [
    {
      "name": "Alia Shawkat",
      "url": "https://www.imdb.com/name/nm0790057/"
    },
    {
      "name": "John Magaro",
      "url": "https://www.imdb.com/name/nm1910274/"
    },
    {
      "name": "Dylan Smith",
      "url": "https://www.imdb.com/name/nm0808055/"
    }
  ],
  "director": [
    {
      "name": "Kelly Reichardt",
      "url": "https://www.imdb.com/name/nm0716980/"
    }
  ],
  "creator": [
    {
      "name": "Jonathan Raymond",
      "url": "https://www.imdb.com/name/nm1299680/"
    },
    {
      "name": "Kelly Reichardt",
      "url": "https://www.imdb.com/name/nm0716980/"
    }
  ]
}