{
  "type": "Movie",
  "name": "Never Rarely Sometimes Always",
  "url": "https://www.imdb.com/tt7772582/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOGUzZjZhMmUtZDE4Yi00NTI0LWJlMDUtNTU1OWI2ZWM1MzBmXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
  "description": "A pair of teenage girls in rural Pennsylvania travel to New York City to seek out medical help after an unintended pregnancy.",
  "review": {
    "author": "CinemaClown",
    "dateCreated": "2020-12-05",
    "inLanguage": "English",
    "heading": "Crafted With Prudence. Told Without Prejudice. Driven By Poignant Performances.",
    "reviewBody": "A touching, heartbreaking & bracingly relevant indie that beats at its loudest during the quieter moments in between, Never Rarely Sometimes Always is a small-scale but powerfully resonant drama that tackles its difficult subject matter with prudence & without prejudice, and is wonderfully manoeuvred by the poignant performances from its young ladies.\n\nWritten & directed by Eliza Hittman, the premise is a simple one but the emotions it elicits are raw & evocative. The plot is lean, focused & constantly on the move, and Hittman places complete trust in her actors to guide her story to its destination. The characters are sketched with care & compassion, their predicament is firmly rooted in reality, and they are beautifully rendered by the cast.\n\nSidney Flanigan plays the teenage protagonist seeking medical help in the wake of an unintended pregnancy and the subtleness with which she brings her character&apos;s inner turmoil to surface is simply astounding, even more so on realising that it&apos;s her acting debut. Talia Ryder deserves a mention too, chipping in with a strong support that&apos;s just as impressive if not more as her character is challenged in her own ways.\n\nOverall, Never Rarely Sometimes Always is a sincere, heartfelt & genuinely moving indie drama that benefits from Hittman&apos;s composed direction & sensible writing, and is further elevated by emotionally engrossing inputs from both Flanigan & Ryder. The documentary-like approach, silent camerawork & relaxed pace serve as necessities to this performance-driven story while quality work from its cast makes it all the more effective & worthwhile.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 30697,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.4
  },
  "contentRating": "15",
  "genre": [
    "Drama"
  ],
  "datePublished": "2020-05-13",
  "keywords": "abortion,new york city,title spoken by character,pennsylvania,stealing money",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "Sidney Flanigan",
      "url": "https://www.imdb.com/name/nm10620978/"
    },
    {
      "name": "Talia Ryder",
      "url": "https://www.imdb.com/name/nm7867621/"
    },
    {
      "name": "Théodore Pellerin",
      "url": "https://www.imdb.com/name/nm6829691/"
    }
  ],
  "director": [
    {
      "name": "Eliza Hittman",
      "url": "https://www.imdb.com/name/nm2151374/"
    }
  ],
  "creator": [
    {
      "name": "Eliza Hittman",
      "url": "https://www.imdb.com/name/nm2151374/"
    }
  ]
}