{
  "type": "Movie",
  "name": "The Personal History of David Copperfield",
  "url": "https://www.imdb.com/tt6439020/",
  "poster": "https://m.media-amazon.com/images/M/MV5BN2NhMWM0OGMtOWIwMS00OGM1LWJlN2YtMzc4N2UyOTg5MDlkXkEyXkFqcGdeQXVyNjkwMzAwMjQ@._V1_.jpg",
  "description": "A modern take on Charles Dickens&apos;s classic tale of a young orphan who is able to triumph over many obstacles.",
  "review": {
    "author": "thisisthemotherhood",
    "dateCreated": "2020-08-11",
    "inLanguage": "English",
    "heading": "Brilliant performances all around and the film is a welcome escape from the current lack of whimsy in the world.",
    "reviewBody": "Dev Patel carries the role of David Copperfield gracefully and naturally. He meets many characters along the way that vividly come to life on screen in ways that make you feel as though you are reading the descriptions as they unfolded on the page. They are almost caricatures in a very whimsical and delightful way. The rollercoaster that takes David from being the only son of a widow to the discarded baggage of a new marriage also makes him the guest in an overwhelmingly loving (yet constantly indebted) family. The ride continues as he becomes a young man on the run and on his fresh start as a gentleman with a past and then finally landing as a man in love with a girl who is out of place in his story.\n\nThough we are introduced to a wonderful array of supporting characters who help David on his long and winding journey, we do not get to spend enough time getting to know them because of the fast pace of the film. We feel his connection to them based on all of the great performances, however, it is tough to stay connected to them on the other side of the lens as the pace through situations races ahead. The third act of the film is where it is felt the most. As all of the characters come together for a very satisfying ending, it would have been nice to have more time with the characters as they enjoy the spoils of ride they took together.\n\nIn the end, this is a redemption story about a very interesting character and his extraordinarily interesting life. David and his engaging journey have every element needed to go from whimsical to scary to revenge filled and eventually a satisfying conclusion. I would definitely recommend it. There are brilliant performances all around and the film is a welcome escape from the current lack of whimsy in the world.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 22024,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "PG",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2020-01-24",
  "keywords": "poverty,writer,1800s,period film,london england",
  "duration": "PT1H59M",
  "actor": [
    {
      "name": "Dev Patel",
      "url": "https://www.imdb.com/name/nm2353862/"
    },
    {
      "name": "Hugh Laurie",
      "url": "https://www.imdb.com/name/nm0491402/"
    },
    {
      "name": "Tilda Swinton",
      "url": "https://www.imdb.com/name/nm0842770/"
    }
  ],
  "director": [
    {
      "name": "Armando Iannucci",
      "url": "https://www.imdb.com/name/nm0406334/"
    }
  ],
  "creator": [
    {
      "name": "Armando Iannucci",
      "url": "https://www.imdb.com/name/nm0406334/"
    },
    {
      "name": "Simon Blackwell",
      "url": "https://www.imdb.com/name/nm1006581/"
    },
    {
      "name": "Charles Dickens",
      "url": "https://www.imdb.com/name/nm0002042/"
    }
  ]
}