

{
  "type": "Movie",
  "name": "Assassination of a High School President",
  "url": "https://www.imdb.com/tt1018818/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDZiYzBjZTctMzI3Yi00YmVmLTgzNmYtYWEwMjc3ZTg2OGNlL2ltYWdlXkEyXkFqcGdeQXVyMjMxNTM3ODY@._V1_.jpg",
  "description": "At a Catholic high school, a sophomore newspaper reporter investigates a case of stolen SAT exams. He thinks he's nailed the suspect and managed to get the popular girl when he realises a larger conspiracy is afoot.",
  "review": {
    "author": "gradyharp",
    "dateCreated": "2011-04-07",
    "inLanguage": "English",
    "heading": "A Mixed Bag",
    "reviewBody": "ASSASSINATION OF A HIGH SCHOOL PRESIDENT is a big step above most of the teen movies that focus on potty mouth dialogue and absurd situations just to get laughs. Writers Tim Calpin and Kevin Jakubowski have come up with a script that is sometimes smart but ultimately full of holes in deciding where it wants to take the original premise of this high school movie. Director Brett Simon seems to sort of let the movie flow as it develops, preventing a tight telling of a story with potential. \\n\\nBobby Funke (Reece Thompson, a promising new talent) is a nerdy newspaper reporter who is never able to finish a story. Student Body President/basketball star/ladies' man Paul Moore (Patrick Taylor) seems to have everything Bobby wants, including the attention of the school's most beautiful girl Francesca (Mischa Barton). As fortune would have it a crime happens - the SATs are stolen from the office of Principal Kirkpatrick (Bruce Willis playing Bruce Willis) and Booby is on the investigation and story, a story that points to Paul as the perpetrator. Bobby's nerdiness is transformed by his attention and by the affections of Francesca, and soon the school collapses under the cloud of the crime. It is how the 'crime' is inspected and resolved that ends the film. For Bobby Funke it is a matter of 'What price glory'. \\n\\nThe cast is fresh and it is a pleasure to see some new faces with promise. Whether it is the director's or the sound mixer's fault, much of the dialogue is swallowed by the soundtrack, a problem thankfully solved by turning on the subtitles. This is a movie with promise from all involved and it will be interesting to see if it has an impact on teen flick quality. \\n\\nGrady Harp",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 16327,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Crime",
    "Mystery"
  ],
  "datePublished": "2010-04-08",
  "keywords": "bare chested male,school,popularity,party,male rear nudity",
  "duration": "PT1H33M",
  "actors": [
    {
      "name": "Reece Thompson",
      "url": "https://www.imdb.com/name/nm1107127/"
    },
    {
      "name": "Mischa Barton",
      "url": "https://www.imdb.com/name/nm0059215/"
    },
    {
      "name": "Bruce Willis",
      "url": "https://www.imdb.com/name/nm0000246/"
    }
  ],
  "director": [
    {
      "name": "Brett Simon",
      "url": "https://www.imdb.com/name/nm1843195/"
    }
  ],
  "creators": [
    {
      "name": "Kevin Jakubowski",
      "url": "https://www.imdb.com/name/nm2489912/"
    },
    {
      "name": "Tim Calpin",
      "url": "https://www.imdb.com/name/nm1926674/"
    }
  ]
}