

{
  "type": "Movie",
  "name": "Brief Interviews with Hideous Men",
  "url": "https://www.imdb.com/tt0790627/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNzYxMTk4NF5BMl5BanBnXkFtZTcwMDY1MTM4Mg@@._V1_.jpg",
  "description": "A graduate student (Nicholson) copes with a recent breakup by conducting interviews with various men.",
  "datePublished": "2009-01-19",
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "duration": "PT1H20M",
  "keywords": "washroom attendant, female graduate student, husband wife relationship, anthropology, heartache",
  "actor": [
    {
      "name": "Julianne Nicholson",
      "url": "https://www.imdb.com/name/nm0629855/"
    },
    {
      "name": "Ben Shenkman",
      "url": "https://www.imdb.com/name/nm0791570/"
    },
    {
      "name": "Timothy Hutton",
      "url": "https://www.imdb.com/name/nm0000459/"
    }
  ],
  "director": [
    {
      "name": "John Krasinski",
      "url": "https://www.imdb.com/name/nm1024677/"
    }
  ],
  "creator": [
    {
      "name": "John Krasinski",
      "url": "https://www.imdb.com/name/nm1024677/"
    },
    {
      "name": "David Foster Wallace",
      "url": "https://www.imdb.com/name/nm2234724/"
    }
  ],
  "review": {
    "author": "izm-rjmega",
    "dateCreated": "2010-12-10",
    "inLanguage": "English",
    "heading": "Misogynist Movie of the Moment",
    "reviewBody": "Misogynist Film of the Moment: Brief Interviews With Hideous Men 10 Dec\n\nsexdrugsmoney.com\n\nThis movie has a pretty recognizable cast. A lot of NBC actors were involved in the making of this movie. There's like four people from The Office in it. But its not a comedy. Its like an art house, weird, documentary / drama. A few highlights throughout, but not that big of a story plot, because the plot is all about telling stories. In the movie, the main character, Sara Quinn (played by Julianne Nicholson) is a grad student conducting interviews with various men of different backgrounds for a research paper. This also follows a life changing breakup with her boyfriend. She seeks to discover a reason why men doom their relationships with women by doing this case study. The movie is directed by John Krasinski (jury still out on this guy) who takes some pretty good pictures, but didn't edit right, so slow people might get lost early in. Its a crawler of a movie. The dialogue, which consists of a lot of monologue and testimony, is on point and strong. Some of the characters are endearing, but many of the men serve to reinforce stereotypes of misogynist men in the modern era, and nobody portrays that very well (bad casting-shucks NBC!). At times, it seems like feminist propaganda. But the movie is based on a book by David Foster Wallace, and unless that a masculine pen for a femme, it couldn't be feminist. Well it damn sure ain't misogynist.\n\nQuinn unlocks the inner thoughts of the 100 or so men in the clinical interviews where they open up about relationships with women while her personal life turns into a mess (but a polite one. no Hagen-daz or bon bons and hate fests with the girls). In doing so she is hoping to understand why her boyfriend has made her feel so bad. Some like subject #17 blame the women for the failures. Some like subject #30 are happily married and in love (but only because his trophy wife stayed a trophy wife through 50). Some, like #42 and #15, are Freudian cut examples of what a man should be. A student shares a horrific story with her, stretching her notions of manhood, like an outlier on a graph, and she begins to gain insight finally. She thinks she understands it. Men are unique. Men are simple. They say they are unfaithful. They say they are sorry. They are all cowards. She thinks that men only see women as things. But when her boyfriend returns to explain the break-up, she learns the truth about the way men love.\n\n2/4 Stars. Worth watching once. But only with your lover as a conversation piece.\n\n—— Ryan Mega sexdrugsmoney.com",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 3633,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.4
  }
}