

{
  "type": "Movie",
  "name": "Gentlemen Broncos",
  "url": "https://www.imdb.com/tt1161418/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjA2NDAzMDU4Ml5BMl5BanBnXkFtZTcwMDc3Mzc3Mg@@._V1_.jpg",
  "description": "A teenager attends a fantasy writers' convention where he discovers his idea has been stolen by an established novelist.",
  "review": {
    "author": "gautreaux-christopher",
    "dateCreated": "2010-04-02",
    "inLanguage": "English",
    "heading": "Great Movie; Bad Reviews",
    "reviewBody": "As the critics would have it, this film did not see the success of Napoleon Dynamite. I believe it is because Napoleon Dynamite had a better trailer. It enticed movie goers to see it. Please also note that the critics buried Napoleon Dynamite (before its wide appeal) as well. The movie goers saved the movie.\n\nI was one of the first to see it. At first viewing, it did not seem like much. But that is the style of Jared and Jerusha Hess. One does not watch their movies once and love it. One watches their movies and finds something funny not noticed before every time. Then the love of their movie grows in the viewer's mind. And for Napoleon Dynamite, the critics had to admit there was something more to it than a cheaply made movie.\n\nThe Hess's style of writing does not focus on some crazy, larger than life shot 'em up. They always focus on the boring and average people. They make us find what is great in most of us (the commoners). I love them for that.\n\nTo set the record straight, Gentlemen Broncos was better written than Napoleon Dynamite. It had more of a plot, and the characters were far more interesting. The topics covered were more far reaching. I won't spoil the movie, but I will warn viewers against critics who allowed every Adam Sandler movie, all Michael Myers movies, American Pie movies, and Meet the Spartans to make their way to theaters. Just because they left this one out doesn't mean that it was a bad movie. Give it a chance and you will see that this was a funny, creative, and heartwarming movie.\n\nPS the humor was not crude in my opinion. I think the PG-13 rating was excessive.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 12246,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "12A",
  "genre": [
    "Adventure",
    "Comedy",
    "Sci-Fi"
  ],
  "datePublished": "2010-05-27",
  "keywords": "small town,sexual harassment,struggling parent,sexual innuendo,absurdism",
  "duration": "PT1H29M",
  "actor": [
    {
      "name": "Michael Angarano",
      "url": "https://www.imdb.com/name/nm0029400/"
    },
    {
      "name": "Jemaine Clement",
      "url": "https://www.imdb.com/name/nm1318596/"
    },
    {
      "name": "Mike White",
      "url": "https://www.imdb.com/name/nm0925234/"
    }
  ],
  "director": [
    {
      "name": "Jared Hess",
      "url": "https://www.imdb.com/name/nm0381478/"
    }
  ],
  "creator": [
    {
      "name": "Jared Hess",
      "url": "https://www.imdb.com/name/nm0381478/"
    },
    {
      "name": "Jerusha Hess",
      "url": "https://www.imdb.com/name/nm1415801/"
    }
  ]
}