

{
  "type": "Movie",
  "name": "Gigantic",
  "url": "https://www.imdb.com/tt1176251/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNWFlZjkyYzQtNjRiYy00M2ViLWFlNTktY2YwNTVmOGJmYzNhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "A mattress salesman's plan to adopt a Chinese baby is augmented by the arrival of a young woman who comes to his workplace, falls asleep on one of the beds, and upon waking starts to affect his life.",
  "review": {
    "author": "tedg",
    "dateCreated": "2010-08-09",
    "inLanguage": "English",
    "heading": "Unknowns, Edges, Dreams",
    "reviewBody": "The fashionable movies these days rely on finding an edge in convention and dangling a foot in the unknown waters on the other side. Wes Anderson and Jason Reitman and Judd Apatow are practitioners of this dynamic. The strategy is plain, with the skill coming from the balancing act.\n\nSo far, those three have done nothing but take a stable genre and story form and walk it to its edge. There is amusement along the way. I like these. But they don't go deep. They are afraid to hurt. We've had a few years of this now and already the technique has become the default in the least valuable of films: romantic comedies.\n\nWhat we need is someone who knows how to find that edge and go to it. Someone who doesn't just dip a toe, but who jumps back and forth fearlessly carrying back insight. We need more Igby from the other side, but brought back.\n\nThis young filmmaker is just what I hoped for. The filmmaking is assured. The arcs are broken as intended. It suitably confuses the newspaper critics. It hurts in places.\n\nI won't fall into the trap of summarizing what is shown, because what matters is what is not shown. Its the empty spaces in the narrative.\n\nWhy is someone familiar beating up our hero? Who is this endearing, broken soul that Zooey plays? What role does that gay guy play, the guy we meet at the beginning and never see again? What are those lines that seduce, are never said, but are remarked on as if they need not be?\n\nThere is a fold here: the sister runs a TeeVee shopping show; Zooey's character helps in an unknown way. In keeping with the gaps, we never know where the fold goes. There is a device from a standard romantic comedy: having a child. It happens but we have no idea how to register it against out romcom templates.\n\nSome may think these are signs of a broken movie or an immature writer-director. They seem to me to be effective, deliberately engineered gaps that define an unknown, moving edge we are taken to and baptized in the open ignorance we bring.\n\nZooey really does understand what is going on. She's the perfect actor for this experiment.\n\nTed's Evaluation -- 3 of 3: Worth watching.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 9922,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2009-06-19",
  "keywords": "female topless nudity,female nudity,woman,young,baby",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Paul Dano",
      "url": "https://www.imdb.com/name/nm0200452/"
    },
    {
      "name": "Zooey Deschanel",
      "url": "https://www.imdb.com/name/nm0221046/"
    },
    {
      "name": "John Goodman",
      "url": "https://www.imdb.com/name/nm0000422/"
    }
  ],
  "director": [
    {
      "name": "Matt Aselton",
      "url": "https://www.imdb.com/name/nm2911073/"
    }
  ],
  "creator": [
    {
      "name": "Adam Nagata",
      "url": "https://www.imdb.com/name/nm2900802/"
    },
    {
      "name": "Matt Aselton",
      "url": "https://www.imdb.com/name/nm2911073/"
    }
  ]
}