

{
  "type": "Movie",
  "name": "Jonas Brothers: The 3D Concert Experience",
  "url": "https://www.imdb.com/tt1229827/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTU4OTM2OTM3Ml5BMl5BanBnXkFtZTcwODg4MzQyMg@@._V1_.jpg",
  "description": null,
  "review": {
    "author": "Zaptharo",
    "dateCreated": "2009-03-13",
    "inLanguage": "English",
    "heading": "Why is Walt Disney Pictures doing this?",
    "reviewBody": "In honest truth, whether this was for getting paychecks or just putting on a pretty outfit for the girls to see, Jonas Brothers: The 3-D Concert Experience was a film that should of never made it past movie critics. This is proof that the music industry is failing on the surface and is desperate to put any no-talent jockey on the music scene.\\n\\nLook, I&apos;m not all for critics or casual onlookers, but there was no need to green light this crap. The Jonas Brothers can prove to us that we can make it big by putting on a pretty face, and getting your popularity based on your image. The sad truth is that they didn&apos;t have to work that hard to make it to the top, so they steal elements based on other music artists and they try to regurgitate them into something new. They do so with flying colors, that is, with failure. Their music sounds so horrible I can make better sounds on my computer. That&apos;s really not saying much. Their poor guitar play, horrible singing, and a stale drummer add up to the realization that they possess no talent. Certainly nothing that would make a music critic go crazy about.\\n\\nA sign of decline in this day and age is there are people dumb enough to compare the Jonas Brothers to great bands and artists of the past. Don&apos;t even try to compare them with Elvis Presley, the Beatles, the Ramones, AC/DC, Aerosmith or the other great music artists who helped make a difference in the music scene. They set the stage for what was to come and were music artists that were actually liked for their musical influence and talent. The Jonas Brothers, on the other hand, seem more fit to be a quick fad that will fade out by the year&apos;s end.\\n\\nThe worst, and perhaps the most shocking aspect of the movie is Disney&apos;s involvement with the Jonas Brothers. Just seeing the Disney logo slapped on the front is enough to make any classic Disney fan cry in terror. Who is running this show? Why should Disney be involved in any of this? What is the purpose of putting on a terrible concert show in theaters? This is simply a message that Disney does not care anymore. Back in the day, Disney was something that every child and parent looked forward to. From Snow White to the Lion King, Disney entertained audiences for generations and set the bar for creating animated masterpieces and original shows. Walt Disney was a highly respectable man and was simply ahead of his time. Jonas Brothers: The 3-D Concert Experience has none of the magic or innovation of the old Disney. It is simply a title of greed and misconception.\\n\\nThe Jonas Brothers need to leave our general conscious. If any idiot would stump so low to actually waste a hard day&apos;s paycheck to see this flying piece of crap, then that person should seek a mental hospital. The Jonas Brothers: The 3-D Concert Experience is nothing redeeming, nothing new, nothing special, and nothing exciting. I&apos;m very upset that Disney was involved in any of it, and the fact that idiots out there don&apos;t realize how bad this is, makes me very frustrated. People out there need to seek talent that is higher than the average person. All this is is a publicity stunt that can show us that any moron can go crazy over a band that was stale from the beginning.\\n\\nThis is why much of mainstream entertainment is failing to put out something of influence. Instead, they are promoting crap like Jonas Brothers: The 3-D Concert Experience in order to have the mind-controlled sheep buy more fluff. The people behind the box office should be ashamed of this title. Don&apos;t believe the hype, just ignore the title and hope that the Jonas Brothers won&apos;t come back for a sequel. Critics should know what passes for a movie, and this doesn&apos;t qualify.\\n\\nA title that holds nothing to the Disney name.\\n\\nOne out of Ten.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 1
    }
  },
  "rating": {
    "ratingCount": 17530,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 1.6
  },
  "contentRating": "U",
  "genre": [
    "Documentary",
    "Biography",
    "Music"
  ],
  "datePublished": "2009-05-29",
  "keywords": "family name in title,3d,music documentary,concert music,concert film",
  "duration": "PT1H16M",
  "actor": [
    {
      "name": "Nick Jonas",
      "url": "https://www.imdb.com/name/nm2679917/"
    },
    {
      "name": "Joe Jonas",
      "url": "https://www.imdb.com/name/nm2679438/"
    },
    {
      "name": "Kevin Jonas",
      "url": "https://www.imdb.com/name/nm2650334/"
    }
  ],
  "director": [
    {
      "name": "Bruce Hendricks",
      "url": "https://www.imdb.com/name/nm0376712/"
    }
  ],
  "creator": []
}