

{
  "type": "Movie",
  "name": "Observe and Report",
  "url": "https://www.imdb.com/tt1197628/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc0NDY4MDA5M15BMl5BanBnXkFtZTgwNTQyMzcwMzE@._V1_.jpg",
  "description": "Bi-polar mall security guard Ronnie Barnhardt is called into action to stop a flasher from turning shopper&apos;s paradise into his personal peep show. But when Barnhardt can&apos;t bring the culprit to justice, a surly police detective is ...",
  "contentRating": "15",
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "datePublished": "2009-04-24",
  "keywords": "male full frontal nudity,male nudity,male pubic hair,public nudity,pubic hair",
  "duration": "PT1H26M",
  "actor": [
    {
      "name": "Seth Rogen",
      "url": "https://www.imdb.com/name/nm0736622/"
    },
    {
      "name": "Anna Faris",
      "url": "https://www.imdb.com/name/nm0267506/"
    },
    {
      "name": "Ray Liotta",
      "url": "https://www.imdb.com/name/nm0000501/"
    }
  ],
  "director": [
    {
      "name": "Jody Hill",
      "url": "https://www.imdb.com/name/nm2095817/"
    }
  ],
  "creator": [
    {
      "name": "Jody Hill",
      "url": "https://www.imdb.com/name/nm2095817/"
    }
  ],
  "review": {
    "author": "zetes",
    "dateCreated": "2009-04-12",
    "inLanguage": "English",
    "heading": "Disturbing and funny, but maybe not funny enough",
    "reviewBody": "We have a new auteur in comedy director/writer Jody Hill. With two films and one television series under his belt now, his vision is pretty clear: he makes comedies about nasty, mean-spirited people who can be extremely unpleasant to be around. His work divide audiences sharply, and even those who like it, like myself, have their reservations. Observe and Report is heavily influenced by Taxi Driver. Seth Rogen plays the head of mall security. He spends most of his days wishing he were more important, but he also likes to believe that he is very important where he is. He dreams of shooting the bad guys and getting the hot girl (Anna Faris, a bimbo who works at a makeup counter at the mall). When a local police detective (Ray Liotta) starts horning in on his mall and his girl, Rogen begins to fly off the handle. Like Hill&apos;s previous film, The Foot Fist Way, what Observe and Report really needs is a few more laughs. It was funny, but it always felt like it could be funnier. The movie&apos;s often very depressing, and Hill is effective in making those painful moments work. Even though Rogen is pretty crazy and frankly a bad person, I felt sorry for him. If Hill could pull off more humorous moments, the balance would work a lot better.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 64941,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  }
}