

{
  "type": "Movie",
  "name": "The Cake Eaters",
  "url": "https://www.imdb.com/tt0418586/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzZkNTQ0YmItMzQ3OS00NWRjLTk1NTMtODE5YjYwNzFmNmI4XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
  "description": "Two families are brought together by the return of one family&apos;s son -- a reunion that conjures up old ghosts and issues that must be addressed.",
  "review": {
    "author": "imdbbl",
    "dateCreated": "2009-10-31",
    "inLanguage": "English",
    "heading": "Very good but had the potential to be great!",
    "reviewBody": "I love independent movies but to be honest I watched The Cake Eaters because of Kristin Stewart. I&apos;ve seen quite a few of her movies in the last weeks and aside from that Twilight crap I&apos;ve came to the conclusion that she&apos;s a great actress and her performance in this film is no exception.Here she plays Georgia Kaminski,a teenager that suffers from Friedreich&apos;s ataxia, a genetic disease that causes damage to the nervous system among other things.Her mother Elizabeth is overzealous and her grandmother, Marg, is her escape.She doesn&apos;t have that much time and wants to experience love before its too late. She meets Beagle,played by Aaron Stanford, a shy 20 year old who works in the school cafeteria,they quickly bond and become close and she decides to loose her virginity to him.Beagle is part of the The Kimbrough family.Easy is the patriarch and he&apos;s grieving over the recent loss of his wife,Guy is the older son who has been away from the family and just returned after learning that his mother had passed away, and Beagle is the youngest son. The film explores the lives of this two interconnected families. The Cake Eaters is independent film-making at his best,my only complaint is that the movie was too short. How many times do you hear that? Exactly, the movie was that good. I just feel like the story could have been explored more and it could had been taken to another level.I don&apos;t know why the director didn&apos;t push the envelope a little,he clearly knew what he was doing and the story had great potential; don&apos;t take me wrong,this is a very good movie, I just think with more running time it could have been a tremendous movie. Kristin Stewart&apos;s performance is truly incredible.When playing characters with these type of diseases, there&apos;s always a tendency to overact or go over the top but she played this role perfectly.The academy award nominee Bruce Dern who played Easy was great as well. A great piece of work that left me wanting more.\\n\\n7.5/10",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 7424,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2009-03-13",
  "keywords": "short haired female,family relationships,son,fuzzy dice,underage sex",
  "duration": "PT1H26M",
  "actor": [
    {
      "name": "Elizabeth Ashley",
      "url": "https://www.imdb.com/name/nm0039051/"
    },
    {
      "name": "Jayce Bartok",
      "url": "https://www.imdb.com/name/nm0058983/"
    },
    {
      "name": "Bruce Dern",
      "url": "https://www.imdb.com/name/nm0001136/"
    }
  ],
  "director": [
    {
      "name": "Mary Stuart Masterson",
      "url": "https://www.imdb.com/name/nm0000524/"
    }
  ],
  "creator": [
    {
      "name": "Jayce Bartok",
      "url": "https://www.imdb.com/name/nm0058983/"
    }
  ]
}