

{
  "type": "Movie",
  "name": "Breakfast on Pluto",
  "url": "https://www.imdb.com/tt0411195/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYmU5YjJlYjEtNGE5Ni00ODA5LWE4ZTAtNzZlNDhlODIzMzE4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": null,
  "review": {
    "author": "weesa729",
    "dateCreated": "2006-01-21",
    "inLanguage": "English",
    "heading": "Amazing, Touching Film",
    "reviewBody": "While this is not a completely conventional film either in structure or storytelling, it is deeply committed to telling the story of Kitten. Just as the film is committed, so is Cillian Murphy committed to being the best Kitten he can, and he succeeds to an almost uncomfortable point, which I think is part of the storytellers goal.\\n\\nWho does not want to be loved? Not many of us, and Kitten wants it more than most. Her journey to find love in whatever form it may take is both touching and harrowing at times. You cringe when she finds her self in certain situations, and you root for her to take charge of her life, but that is something she is quite unable to do for the most part of her journey.\\n\\nWhile this story features the good, the bad and the ugly of the transvestite lifestyle, there is no judgment being made, it is presented as a simple fact of Kitten&apos;s life from nearly the first time you see her. That in itself is refreshing. There are stereotypes, but not presented in stereotypical situation, which is also refreshing.\\n\\nI came away from this movie with a warm feeling in my heart for the character, the story, and the commitment of everyone involved in the film, it drew me in, it took me to places I did not expect, and it gave me a film experience you simply can not find every day in our cookie cutter Hollywood film world these days. My hat is off to all of you involved in the film. If you like something different, something unexpected, and something unusual made with a lot of love, this is the film for you.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 24175,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.2
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2006-01-13",
  "keywords": "irish,1970s,ira,transgender,priest",
  "duration": "PT2H8M",
  "actor": [
    {
      "name": "Cillian Murphy",
      "url": "https://www.imdb.com/name/nm0614165/"
    },
    {
      "name": "Morgan Jones",
      "url": "https://www.imdb.com/name/nm0428897/"
    },
    {
      "name": "Eva Birthistle",
      "url": "https://www.imdb.com/name/nm0083795/"
    }
  ],
  "director": [
    {
      "name": "Neil Jordan",
      "url": "https://www.imdb.com/name/nm0001403/"
    }
  ],
  "creator": [
    {
      "name": "Neil Jordan",
      "url": "https://www.imdb.com/name/nm0001403/"
    },
    {
      "name": "Pat McCabe",
      "url": "https://www.imdb.com/name/nm0564496/"
    }
  ]
}