

{
  "type": "Movie",
  "name": "Centurion",
  "url": "https://www.imdb.com/tt1020558/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4NTI1MTEzM15BMl5BanBnXkFtZTcwNDc3NDc1Mw@@._V1_.jpg",
  "description": "A splinter group of Roman soldiers fight for their lives behind enemy lines after their legion is devastated in a guerrilla attack.",
  "review": {
    "author": "hitchcockthelegend",
    "dateCreated": "2010-09-26",
    "inLanguage": "English",
    "heading": "Are you not entertained?",
    "reviewBody": "Centurion is directed by Neil Marshall who also wrote the screenplay. It stars Dominic West, Michael Fassbender, Olga Kurylenko, Liam Cunningham, Noel Clarke, Riz Ahmed & Imogen Poots.\\n\\nBritain, 117 AD and the Romans are struggling to contain the Picts in Caledonia. The Roman Governor sends in their best army, the Ninth Legion. But they are victims of a trap and are forced to flee on foot across the mountainous terrain with the vengeful Picts in hot pursuit. Can they stay alive and make it to the border?\\n\\nOne thing you know you are going to get with a Neil Marshall film is blood and guts. Be it squadies facing off against werewolves, pot-holing babes grappling with hungry Gollum types, or a secret unit sent in to quarantined Scotland to fend off cannibal punk rockers; Marshall likes to pile on the grue. With his latest, Centurion, he continues in this vein. Sadly that&apos;s about all there is as the talented director appears to be getting a little carried away with himself and forgetting to put some substance into his characters. What promises to be a telling historical epic anti-war movie ends up being one long chase movie. Only pausing for breath for intermittent blood letting and the now obligatory love interest sub-plot. Oh it&apos;s fun, very much so, and the visuals coupled with the excellently constructed fight sequences don&apos;t waste a penny spent. But as a whole it just doesn&apos;t work, it&apos;s more a collection of set pieces linked together by visceral pleasures under the guise of being a take on a folklore story.\\n\\nHowever, there is no denying the commitment to the genre from Marshall. Centurion is often thrilling and brutal into the bargain, so as long as you don&apos;t require any semblance of depth then it will surely entertain you. While he has assembled a very admirable cast of British & Irish thesps and put them thru a very tough shoot up in the Scottish hills. The craft is there, from director and stars, just no decent script to flesh it out. Oh and do we really need Roman soldiers saying the F word to show us how hard they are? Coming after Doomsday flopped (personally I think it&apos;s a whole bunch of fun), Marshall is at the crossroads of his career. Once the indie darling of Britain he&apos;s been courted by Hollywood and needs to make big decisions. You can only homage so much in your favoured genres (here he nods to Gladiator, The Warriors and even Zulu) before it gets to be boring. So is it time to let someone else write now? Also if he must stay mainstream then he has to get the budget to do the job properly; witness the digital blood used for the first fight sequences, laughably bad and able to take you right out of the film.\\n\\nAt times ridiculous and over the top, Centurion only works well as a pure action flick. Which of course will find an audience. But director and cast are better than this, as an effective story is bogged down by lack of narrative heart that in turn is most likely hidden by arterial blood. Lots of it. 5/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 86012,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Drama",
    "History"
  ],
  "datePublished": "2010-04-23",
  "keywords": "legion,sole survivor,britain,roman soldier,wood carving",
  "duration": "PT1H37M",
  "actor": [
    {
      "name": "Michael Fassbender",
      "url": "https://www.imdb.com/name/nm1055413/"
    },
    {
      "name": "Dominic West",
      "url": "https://www.imdb.com/name/nm0922035/"
    },
    {
      "name": "Olga Kurylenko",
      "url": "https://www.imdb.com/name/nm1385871/"
    }
  ],
  "director": [
    {
      "name": "Neil Marshall",
      "url": "https://www.imdb.com/name/nm0551076/"
    }
  ],
  "creator": [
    {
      "name": "Neil Marshall",
      "url": "https://www.imdb.com/name/nm0551076/"
    }
  ]
}