

{
  "type": "Movie",
  "name": "Daybreakers",
  "url": "https://www.imdb.com/tt0433362/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzg3NDYyMDU4Nl5BMl5BanBnXkFtZTcwODA5NzA5Mg@@._V1_.jpg",
  "description": "In the year 2019, a plague has transformed almost every human into vampires. Faced with a dwindling blood supply, the fractured dominant race plots their survival; meanwhile, a researcher works with a covert band of vamps on a way...",
  "review": {
    "author": "thefinisher_23",
    "dateCreated": "2010-01-24",
    "inLanguage": "English",
    "heading": "Ehh...",
    "reviewBody": "Some films contain better ideas for another film. That is exactly what we have here in Daybreakers. In the future, we are all vampires. Only this isn't I am Legend. We walk, talk and do as we used to do. The major difference being that we must obviously drink blood and avoid the sun. Thus any and all humans are captured and farmed for blood until the day they die. We have found a way to do these things and maintain the semblance of our day-to-day. This is the film I so wanted to see. A function society of vampires living in a world built for humanity. Sadly, we don't get enough of it.\n\nWhat's left of humanity survives by day and dodges at night. Hematologist Edward Dalton (Ethan Hawkewow its' been a while) is sympathetic to their cause because he does in fact still possess his humanity. His boss (Sam Neil) simply wants capital which should have far less importance in a world where blood is the only real necessity. Dalton's goal is to find either a cure for the disease (never explained) or a substitute to replace human blood which is dwindling fast. If the powers that be can't find a solution we will all change into a creature resembles a mutant bat and Mickey Rourke's face from The Wrestler. Dalton stumbles upon a group of humans who have found a way to cure the disease. This method is explained so simplistically it's stupid to think another vampire or two wouldn't have stumbled upon it by accident too. Among this group is Audrey (Claudia Kraven) and Elvis (Willem Dafoehere setting a precedent for cliché' sadly). Elvis has been cured thanks to his love of fast cars. Don't ask. I'll only groan.\n\nDaybreakers is far from a bad film but it's certainly a stubborn and frustrating one. There is such a fantastic idea here that is tossed aside because we are supposed to identify more with the humans than we are expected to be fascinated by this vampire-urbanity. The action scenes are rather clunky as well and not at all thrilling. That's quite peculiar because some shots in the film look so stellar you'd think they are from a different budget. Characterization is also at a bare minimum. Dalton for example has a soldier brother who serves simply as someone who can move the plot along, he doesn't have to provide any real emotion. Neil also has a daughter (Isabel Lucas last seen as chick-bot in Transformers II) whose screen time and presence in the film is really an utter waste. I suppose it provides Neil some motivation later on in the film but again, this only serves the plot. It doesn't make the film any better which can be said about most of the scenes here.\n\nA lot of folksscratch that a lot of DUDES will like Daybreakers simply because it is not New Moon. The vampires actually bite things, are dangerous, act like they are vampires and not CW stars, and the blood flows freely (the last 10 minutes may be the goriest since Planet Terror). I didn't make this comparison as the two films only have the term vampire in common. Instead I saw a film that used a genius premise to set-up a rather boring, dull and far too conventional 2 hours. I wish there was more to elaborate on but truthfully any mediocre film will make you say this: I don't care to.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 134429,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "18",
  "genre": [
    "Action",
    "Horror",
    "Sci-Fi"
  ],
  "datePublished": "2010-01-06",
  "keywords": "dystopian future,vampire,blood,food shortage,bitten by a vampire",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Ethan Hawke",
      "url": "https://www.imdb.com/name/nm0000160/"
    },
    {
      "name": "Willem Dafoe",
      "url": "https://www.imdb.com/name/nm0000353/"
    },
    {
      "name": "Sam Neill",
      "url": "https://www.imdb.com/name/nm0000554/"
    }
  ],
  "director": [
    {
      "name": "Michael Spierig",
      "url": "https://www.imdb.com/name/nm1294961/"
    },
    {
      "name": "Peter Spierig",
      "url": "https://www.imdb.com/name/nm1294962/"
    }
  ],
  "creator": [
    {
      "name": "Michael Spierig",
      "url": "https://www.imdb.com/name/nm1294961/"
    },
    {
      "name": "Peter Spierig",
      "url": "https://www.imdb.com/name/nm1294962/"
    }
  ]
}