

{
  "type": "Movie",
  "name": "Furry Vengeance",
  "url": "https://www.imdb.com/tt0492389/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjM5Mzg5NjA0Nl5BMl5BanBnXkFtZTcwMjg3MDEyMw@@._V1_.jpg",
  "description": "In the Oregon wilderness, a real-estate developer's new housing subdivision faces a unique group of protestors: local woodland creatures who don't want their homes disturbed.",
  "review": {
    "author": "reccewoody",
    "dateCreated": "2011-01-07",
    "inLanguage": "English",
    "heading": "Does what it does well enough",
    "reviewBody": "If you have seen the trailer and gone ahead and bought or rented the movie, then you know what to expect. This isn't Bergman's The Seventh Seal, or Welles Citizen Kane. It is what it is, a funny family movie with lots of forest critters causing trouble for Brendon Fraser.\n\nOf course Brendon has done better more artful movies, of course he's done more adult-themed action, but why all the hate for this movie? Sometimes I want a sophisticated cerebral comedy with witty satire and subtlety, just like sometimes I want a fancy meal. But there also times I just want to kick my shoes off, sink a beer, scoff a pizza, burp and watch a fun film. This is what you get with Furry Vengeance, and it delivers what it sets out to deliver.\n\nThe performances are exaggerated sure, and yes, you can tell no-one has spent months refining the CGI. But what the hell, the movies makes you smile throughout, with a few laugh out loud moments thrown in too, and the extras on the DVD prove that everyone had a good time making the film.\n\nChill out all you negative reviewers, appreciate this movie for what it is.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 18173,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.9
  },
  "contentRating": "PG",
  "genre": [
    "Comedy",
    "Family"
  ],
  "datePublished": "2010-05-07",
  "keywords": "barefoot male,nightmare,close up of eyes,close up of lips,close up of mouth",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Brendan Fraser",
      "url": "https://www.imdb.com/name/nm0000409/"
    },
    {
      "name": "Brooke Shields",
      "url": "https://www.imdb.com/name/nm0000222/"
    },
    {
      "name": "Ricky Garcia",
      "url": "https://www.imdb.com/name/nm2049403/"
    }
  ],
  "director": [
    {
      "name": "Roger Kumble",
      "url": "https://www.imdb.com/name/nm0474955/"
    }
  ],
  "creator": [
    {
      "name": "Michael Carnes",
      "url": "https://www.imdb.com/name/nm0138733/"
    },
    {
      "name": "Josh Gilbert",
      "url": "https://www.imdb.com/name/nm1404095/"
    }
  ]
}