

{
  "type": "Movie",
  "name": "Harry Brown",
  "url": "https://www.imdb.com/tt1289406/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTM5NjE2NzI2Ml5BMl5BanBnXkFtZTcwNDY0ODUyMw@@._V1_.jpg",
  "description": "An elderly ex-serviceman and widower looks to avenge his best friend's murder by doling out his own form of justice.",
  "review": {
    "author": "trashgang",
    "dateCreated": "2011-02-21",
    "inLanguage": "English",
    "heading": "brutal revenge gem",
    "reviewBody": "Daniel Barber, so far I have never heard of this director which is normal, this is his first major flick. And what a great movie this is. it's a revenge flick but as real and brutal as it can get. It's funny that I as a horror geek was recommended Harry Brown. But I didn't regret it watching it and I must even say that I got goosebumps by some scene's. And people who know me do know that I can take the goriest pieces without a problem. But again, it is really the reality and the brutality that makes the movie and of course Sir Michael Caine. Admit it, he always has something macabre over him but he's now in his 70's (\\u00b01933)and still can deliver the creeps. His acting is surely an Oscar worthy. But also worth mentioning is Sean Harris. he really is believable, in fact all hoodies are believable and of course the language used and the dialect gives it also its reality. This is an all points an excellent movie. Not in Rambo or Arnie style with a lot of shooting but just a straight in your face flick, big thumbs up to the director, Sir Caine and the whole bunch involved.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 90979,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.2
  },
  "contentRating": "18",
  "genre": [
    "Action",
    "Crime",
    "Drama"
  ],
  "datePublished": "2009-11-11",
  "keywords": "self defense,vigilantism,fellatio,vigilante,hooded sweatshirt",
  "duration": "PT1H43M",
  "actor": [
    {
      "name": "Michael Caine",
      "url": "https://www.imdb.com/name/nm0000323/"
    },
    {
      "name": "Emily Mortimer",
      "url": "https://www.imdb.com/name/nm0607865/"
    },
    {
      "name": "David Bradley",
      "url": "https://www.imdb.com/name/nm0103195/"
    }
  ],
  "director": [
    {
      "name": "Daniel Barber",
      "url": "https://www.imdb.com/name/nm2905562/"
    }
  ],
  "creator": [
    {
      "name": "Gary Young",
      "url": "https://www.imdb.com/name/nm0949558/"
    }
  ]
}