{
  "type": "Movie",
  "name": "Life During Wartime",
  "url": "https://www.imdb.com/tt0808526/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTYyNzg2NzUyNl5BMl5BanBnXkFtZTcwNjEzOTM2Mw@@._V1_.jpg",
  "description": "Friends, family, and lovers struggle to find love, forgiveness, and meaning in an almost war-torn world riddled with comedy and pathos.",
  "review": {
    "author": "ihrtfilms",
    "dateCreated": "2011-01-23",
    "inLanguage": "English",
    "heading": "Perhaps not as dark as Solondz&apos; previous works.",
    "reviewBody": "Life During Wartime is of sorts a sequel to Happiness, but Todd Solondz chose a different cast for his latest film to play the same characters. I have seen Happiness, but don&apos;t remember it well enough and going into Wartime was actually unaware it was a continuation of events.\n\nThree sisters, Joy, Helen and Trish are utterly different souls leading utterly different lives. Joy is a little scattered and has just separated from her husband and is visited by the ghost of a former co worker. Trish lives with her two younger kids, one of whom Timmy is preparing for his bar mitzvah. She has started dating again after her husband was jailed for molesting children, but she is unaware he has been released. Trish is a successful screenwriter in Hollywood, but is old and distant towards the rest of her family.\n\nThe sisters lives intertwine together and with characters from each others past and all three try and long to find love and happiness and is for the most part very enjoyable. I recall, perhaps vaguely that Solondz&apos; other films are a little hard going and often harsh, yet Wartime feels a little brighter. However there are some uncomfortable moments in it, such as where Trish explains her feelings towards to her new man to her son or Timmy&apos;s inquisitive questioning about &apos;faggots&apos;, but moments are few.\n\nActing across the cast is excellent with a fine performance from Alison Janney as Trish and whilst squeaky voiced Shirley Henderson can often be annoying in this she is almost endearing. It is a dark film and while it never shocks out right, it does venture to the borderline. And while it&apos;s not laugh out loud there are some funny moments in it. You don&apos;t have to be familiar with Happiness to enjoy this film, even if it&apos;s a typical audience divider film, it works well on it&apos;s on. Nor do you have to be a Solondz fan to enjoy this, though those that are will relish the film even more.\n\nMore of my reviews at iheartfilms.weebly.com",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 7801,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2010-04-23",
  "keywords": "ex convict,kiss,reference to william s. burroughs&apos; naked lunch,reference to che guevara,boy",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Shirley Henderson",
      "url": "https://www.imdb.com/name/nm0376602/"
    },
    {
      "name": "Allison Janney",
      "url": "https://www.imdb.com/name/nm0005049/"
    },
    {
      "name": "Ally Sheedy",
      "url": "https://www.imdb.com/name/nm0000639/"
    }
  ],
  "director": [
    {
      "name": "Todd Solondz",
      "url": "https://www.imdb.com/name/nm0001754/"
    }
  ],
  "creator": [
    {
      "name": "Todd Solondz",
      "url": "https://www.imdb.com/name/nm0001754/"
    }
  ]
}