{
  "type": "Movie",
  "name": "Nanny McPhee and the Big Bang",
  "url": "https://www.imdb.com/tt1415283/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTI5NDUxNDU4OF5BMl5BanBnXkFtZTcwNDk1NjM1Mw@@._V1_.jpg",
  "description": "Nanny McPhee arrives to help a harried young mother who is trying to run the family farm while her husband is away at war, though she uses her magic to teach the woman&apos;s children and their two spoiled cousins five new lessons.",
  "review": {
    "author": "DICK STEEL",
    "dateCreated": "2010-06-07",
    "inLanguage": "English",
    "heading": "A Nutshell Review: Nanny McPhee and the Big Bang",
    "reviewBody": "It&apos;s only when you need her and not want her, that she appears, and only when you want her but no longer need her, does she go away. It&apos;s been 5 years since the first Nanny McPhee film burst onto the silver screen, and now a second film comes at a time during the school holidays to provide the little ones some entertaining, family friendly fare with good moral messages to boot. Emma Thompson reprises her role as the magical nanny with facial disfigurements that disappear one at a time, each time she imparts values to children, and here she has 5 to teach the little ones to behave.\n\nLike its predecessor, Nanny McPhee appears to assist Maggie Gyllenhaal&apos;s Mrs Green, a war time wife whose husband (Ewan McGregor) has been off to war and has only corresponded back home through snail mail. Being the current breadwinner and finding great difficulty in controlling her children Vincent (Oscar Steer), Norman (Asa Butterfield) and Megsie (Lil Woods), her problems compound when they are joined by their cousins Cyril (Eros Vlahos) and Celia (Rose Taylor-Ritson) who hail from the city, and a clash of attitudes spell even more trouble for the harried Mrs Green. But not if Nanny McPhee can help it, and does so in a jiffy.\n\nSet mostly in and around the Green farm which the children&apos;s uncle Phil (Rhys Ifans) as chief baddie who tries hard to get Mrs Green to sell half her ownership so as to bail him out of gambling debts, McPhee gets to impart lessons learnt through manufactured incidents on the farm and allows her magic to be weaved even on piglets, which will probably delight the younger audience as they do strange things like climbing trees and synchronized swimming. In some ways, the lessons here somehow paled from the earlier film, and the last lesson happened more like a matter of fact rather than one properly planned out, though they do enough to allow some nifty special effects laden scenes to be played out.\n\nThe children in the film brought about fine performances and are able to hold their own against the likes of Maggie Gyllenhaal, and even the cameos of McGregor and especially Ralph Fiennes, who boomed with much stature as Lord Gray of the War Office and in that short scene, provided enough pathos and a key plot element as to why the Green&apos;s cousins came to live with them on the farm. Comedy came in the form of Maggie Smith&apos;s senile Mrs Docherty, though it was a mix of hits and misses with the latter taking unfortunate dominance.\n\nI suppose Nanny McPhee can be an enduring franchise if the younger audience embrace it as the less flashier franchise series of say, Harry Potter and even Twilight. After all, it has good moral lessons to impart, and has a feel good element about it, on one hand being light weight in treatment, yet packing some punch in its messages. Stay tuned during the end credits too for an animated sequence that&apos;s too beautifully done to miss, and for the sharp eyed viewer, let&apos;s see if you can spot a moment of goof in the film that has something to do with the film being flipped left to right. Recommended for children, and adults alike.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 36744,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "U",
  "genre": [
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "datePublished": "2010-03-26",
  "keywords": "nanny,magic,farm,flying pig,bomb",
  "duration": "PT1H49M",
  "actor": [
    {
      "name": "Emma Thompson",
      "url": "https://www.imdb.com/name/nm0000668/"
    },
    {
      "name": "Maggie Gyllenhaal",
      "url": "https://www.imdb.com/name/nm0350454/"
    },
    {
      "name": "Ralph Fiennes",
      "url": "https://www.imdb.com/name/nm0000146/"
    }
  ],
  "director": [
    {
      "name": "Susanna White",
      "url": "https://www.imdb.com/name/nm1264352/"
    }
  ],
  "creator": [
    {
      "name": "Emma Thompson",
      "url": "https://www.imdb.com/name/nm0000668/"
    },
    {
      "name": "Christianna Brand",
      "url": "https://www.imdb.com/name/nm0104447/"
    }
  ]
}