{
  "type": "Movie",
  "name": "Nowhere Boy",
  "url": "https://www.imdb.com/tt1266029/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTU4ODFmMDMtNjA2OS00ZWNiLWI4OGUtNzA3YTRjZTM2MmY4L2ltYWdlXkEyXkFqcGdeQXVyMjgyNjk3MzE@._V1_.jpg",
  "description": "A chronicle of John Lennon&apos;s first years, focused mainly in his adolescence and his relationship with his stern aunt Mimi, who raised him, and his absentee mother Julia, who re-entered his life at a crucial moment in his young life.",
  "review": {
    "author": "Troy_Campbell",
    "dateCreated": "2009-12-30",
    "inLanguage": "English",
    "heading": "An interesting insight into the musical genius.",
    "reviewBody": "I knew very little about Lennon – a Beatle, shot dead at age 40, all round musical god to millions – before seeing Nowhere Boy. I know more about him now, but not as much as I&apos;d hope. Matt Greenleigh&apos;s screenplay, based on Julia Baird&apos;s (Lennon&apos;s sister) memoirs, covers only a small period of the rocker&apos;s life, more specifically between the ages of 16 and 20. These were the years when Lennon met his real mother and learnt the truth about how he ended up living with his Aunt Mimi. Oh, and he also met Paul McCartney and George Harrison. However the film strongly focuses on his familial issues and leaves the formation of his band as a sidenote, which is a real shame because as an ignorant fan it would have been great to learn more about the Lennon / McCartney dynamic and how The Quarrymen-cum-Beatles grabbed the world&apos;s attention.\n\nIn her sophomore effort as director, Sam Taylor Wood brings a nice artistic edge to the proceedings although her picture isn&apos;t always as compelling as it should be. There are a handful of powerful scenes that&apos;ll get the heart pumping though; a tense, all-cards-on-the-table discussion between Lennon, Julia and Mimi is Nowhere Boy at its best. With the assistance of DP Seamus McGarvey, she manages to capture the mood and gloom of 50&apos;s London extremely well, the chilly weather a perfect excuse for kids everywhere to dress like Elvis.\n\nPerhaps most importantly, Wood has extracted a fine performance from the 19 year old Johnson; his brash, confused Lennon is never less than convincing. Always reliable, and almost stealing the show, is Kristin Scott Thomas as the stern but devoted Aunt Mimi. She gives Mimi so much depth and unsaid emotion, it is tour de force to witness. Not quite as engaging is Thomas Sangster as McCartney and Anne-Marie Duff as Lennon&apos;s completely bizarre mother Julia.\n\nA small, but interesting insight into the musical genius that was John Winston Lennon.\n\n3.5 out of 5 (1 - Rubbish, 2 - Ordinary, 3 - Good, 4 - Excellent, 5 - Classic)",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 38579,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama",
    "Music"
  ],
  "datePublished": "2009-12-25",
  "keywords": "paul mccartney character,john lennon character,george harrison character,jukebox musical,knocking on a door",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Aaron Taylor-Johnson",
      "url": "https://www.imdb.com/name/nm1093951/"
    },
    {
      "name": "Kristin Scott Thomas",
      "url": "https://www.imdb.com/name/nm0000218/"
    },
    {
      "name": "Anne-Marie Duff",
      "url": "https://www.imdb.com/name/nm0240359/"
    }
  ],
  "director": [
    {
      "name": "Sam Taylor-Johnson",
      "url": "https://www.imdb.com/name/nm0853374/"
    }
  ],
  "creator": [
    {
      "name": "Julia Baird",
      "url": "https://www.imdb.com/name/nm3080706/"
    },
    {
      "name": "Matt Greenhalgh",
      "url": "https://www.imdb.com/name/nm0339043/"
    }
  ]
}