{
  "type": "Movie",
  "name": "OSS 117: Rio ne répond plus",
  "url": "https://www.imdb.com/tt1167660/",
  "poster": "https://m.media-amazon.com/images/M/MV5BY2YwNGZhOGEtMDhlMS00MWUwLWE0NGYtNWNkNmM3ODhiMGI5XkEyXkFqcGdeQXVyODIyOTEyMzY@._V1_.jpg",
  "description": "Another mission of world-known French secret agent leads him to exotic Brazil.",
  "review": {
    "author": "searchanddestroy-1",
    "dateCreated": "2023-05-26",
    "inLanguage": "English",
    "heading": "Idiotic French MATT HELM or FLINT",
    "reviewBody": "I depise comedies, especially French comedies - I am French - except old Louis De Funès, Bourvil and Fernandel films - and I hate those stupid movies where I need some one to tell me when to laugh.... But those 0SS 117 features starring Jean Dujardin, there are three of them so far- I LOVE IT. And I was at first very reluctant to imagine OSS 117 as comedies. You see, I saw the genuine OSS 117 when I was a kid, starring Frederic Stafford, which were not comedies at all. So I was afraid to watch those; but what a surprise after the first time I saw them. Here the peculiarity is not the story of course, it is so stupid, but that&apos;s precisely the purpose of this masterpiece. To, FOR ONCE, the film presents a hero who is very handsome, the most handsome man on earth, womanizer, great fighter, so elegant, but AND THAT IS ALSO THE EXQUISITE CONTRAST, a guy totally racist, sexist, childish, pretentious, antisemitic, without any education nor culture, idiot at a scale you can&apos;t even imagine. I could not stop laughing during the time I saw those movies. Jean Dujardin reminds Jean Paul Belmondo, for instance in LE MAGNIFIQUE, but Belmondo&apos;s character was less idiotic, or also Dean Martin in MATT HELM films. Anyway it is absolutely impossible to show a more dumb character on screen. Just enjoy this wonderful tribute to the sixties espionnage films period and more precisely the MATT HELM and FLINT film series starring Dean Martin for the first and Jim Coburn for the second.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 16372,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2009-04-15",
  "keywords": "1960s,latin america,south america,brazil,male nudity",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "Jean Dujardin",
      "url": "https://www.imdb.com/name/nm0241121/"
    },
    {
      "name": "Louise Monot",
      "url": "https://www.imdb.com/name/nm0972531/"
    },
    {
      "name": "Rüdiger Vogler",
      "url": "https://www.imdb.com/name/nm0901057/"
    }
  ],
  "director": [
    {
      "name": "Michel Hazanavicius",
      "url": "https://www.imdb.com/name/nm0371890/"
    }
  ],
  "creator": [
    {
      "name": "Jean Bruce",
      "url": "https://www.imdb.com/name/nm0115504/"
    },
    {
      "name": "Jean-François Halin",
      "url": "https://www.imdb.com/name/nm0355213/"
    },
    {
      "name": "Michel Hazanavicius",
      "url": "https://www.imdb.com/name/nm0371890/"
    }
  ]
}