{
  "type": "Movie",
  "name": "Restrepo",
  "url": "https://www.imdb.com/tt1559549/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjIwNDAxMTY4Ml5BMl5BanBnXkFtZTcwMTUyMTQ1Mw@@._V1_.jpg",
  "description": "A year with one platoon in the deadliest valley in Afghanistan.",
  "review": {
    "author": "estebangonzalez10",
    "dateCreated": "2011-02-19",
    "inLanguage": "English",
    "heading": "Restrepo !!!",
    "reviewBody": "¨My personal low point? - Rock Avalanche, I saw a lot of professional tough guys go weak in the knees.¨ Restrepo is one of the five pictures nominated for Best Documentary at the Oscars and it also won the Grand Jury Prize in the 2010 Sundance Film Festival. It&apos;s beautifully directed and filmed by Tim Hetherington and Sebastian Junger (writer of The Perfect Storm). The huge success of this film and what separates it from the hundreds of other war pictures is that Junger puts us right in the middle of the action without any political agenda. He simply decides to film these groups of soldiers who have been deployed to one of the most dangerous locations in Afghanistan and lets us experience their day to day lives without making any pro or anti war comments. We are allowed to see a small glimpse of what the American soldiers have to go through and how they live amongst the villagers. In a way Junger allows the soldiers being filmed to tell their own story. We experience what they are going through in this dangerous war zone and how they interact with the local people. The cinematography is actually quite astonishing and I really felt like I was there with the soldiers. Restrepo made me appreciate even more last year&apos;s Oscar winning picture: The Hurt Locker, because it showed me how real that film actually was. At one point one of the soldiers even claims that no rush is as high as being shot at in the middle of a war zone. War can be addictive and it actually is for some soldiers.\n\nThe camera silently follows an American platoon that is being deployed to one of the most dangerous war zones in Afghanistan known as the Korangal Valley for a period of 15 months during 2007. The film begins while the platoon is arriving at the base and some of the soldiers share their thoughts about beginning their service in such a dangerous zone. We follow these soldiers as they live in tents in the middle of a valley where danger is eminent. They have to experience gun fights almost every day, and at the same time they have to adapt to the environment. When they are not fighting, we see the soldiers digging for protection; we see them burning their own feces, and just goofing around while they wait for next gunfight to take place. A day without action is nonexistent in the Korangal Valley. It is during one of these gunfights that one of the soldiers is mortally wounded, his name was Restrepo and the rest of the soldiers decide to build a resistance camp named O.P. Restrepo on his behalf. Restrepo changed the entire mood of the soldiers and they were ready to have their revenge. At the same time that the soldiers have to fight off the Taliban they also try to improve their relations with the locals who have a difficult time accepting the Americans (especially after they kill one of their cows).\n\nThe movie isn&apos;t pro or anti war; it simply places the camera in the middle of the action and lets us experience what is going on. No one&apos;s opinion about War is going to change: those who favor Americans involvement in Afghanistan will still do so after watching this documentary and those who don&apos;t will still feel the same because the directors don&apos;t try to manipulate us into thinking the way they do. There aren&apos;t any personal opinions about politics or war; it&apos;s all about experiencing what these soldiers have to go through every day whether or not they actually understand what they are fighting for. Some of my favorite parts of the documentary were the scenes where the Captain meets with the local villagers and tries to make allies out of them and the Rock Avalanche operation. The Captain really doesn&apos;t have a clue of the way the villagers think and goes the wrong way about trying to convince them to help the Americans. The Rock Avalanche Operation was really intense and was the climatic point of the film. I really loved the interviews with the soldiers with the camera closing-up on their faces (The Good, The Bad, and The Ugly style). Restrepo is a really good and memorable documentary that will stay with you for days. It is only 90 minutes long so it is really worth your time.\n\nhttp://estebueno10.blogspot.com/",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 24340,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.4
  },
  "contentRating": "15",
  "genre": [
    "Documentary",
    "Biography",
    "History"
  ],
  "datePublished": "2010-08-06",
  "keywords": "american abroad,military uniform,hillside,camouflage uniform,helicopter",
  "duration": "PT1H33M",
  "actor": [
    {
      "name": "The Men of Battle Company 2nd of the 503rd Infantry Regiment 173rd Airborne Brigade Combat Team",
      "url": "https://www.imdb.com/name/nm4319742/"
    },
    {
      "name": "Juan &apos;Doc Restrepo",
      "url": "https://www.imdb.com/name/nm4318679/"
    },
    {
      "name": "Dan Kearney",
      "url": "https://www.imdb.com/name/nm4317669/"
    }
  ],
  "director": [
    {
      "name": "Tim Hetherington",
      "url": "https://www.imdb.com/name/nm1770672/"
    },
    {
      "name": "Sebastian Junger",
      "url": "https://www.imdb.com/name/nm0432631/"
    }
  ],
  "creator": []
}