{
  "type": "Movie",
  "name": "Milh Hadha al-Bahr",
  "url": "https://www.imdb.com/tt1090680/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjEwODc3MzMyM15BMl5BanBnXkFtZTcwNDE5MjM3Mw@@._V1_.jpg",
  "description": "A romantic drama about a working-class woman and her experiences traveling back home.",
  "review": {
    "author": "albertval-69560",
    "dateCreated": "2021-11-17",
    "inLanguage": "English",
    "heading": "DESPAIR IN A DIVIDED LAND",
    "reviewBody": "It&apos;s true. This movie lacks nuance. And it may be true that it delivers its message rather harshly and caustically. It may even be considered more as a propaganda rather than an introspective film about trampled rights to a homeland.\n\nBut if this story is based on Soraya Tahini&apos;s actual experience when she visited the West Bank, then the viewer must take notice and, at least, listen up.\n\nThis is her story and that of Emad whom she befriended in Ramallah. Who could deny her feelings when she enters her grandfather&apos;s home in Jaffa for the first time? Is she wrong to say out loud that it was stolen from them? For Emad, visiting his family&apos;s hometown near Hebron is gut-wrenching knowing that it was the scene of a massacre of Palestinian civilians during the war of &apos;48. In fact, the film pays tribute to the victims of that tragedy.\n\nI thought of how the film will end after that scene in ad Dawayima where Soraya and Emad had to leave as it has been transformed into a historical park.\n\nSuheir Hammad and Saleh Bakri bring us to those places that are important to the Palestinian identity and psyche. They succeed as actors in weaving a compelling narrative about what things are and what could be in this troubled land. They pose questions with no easy answers.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 1427,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "Unrated",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2008-10-15",
  "keywords": "male rear nudity,male nudity,beach,woman,palestine",
  "duration": "PT1H49M",
  "actor": [
    {
      "name": "Suheir Hammad",
      "url": "https://www.imdb.com/name/nm1730869/"
    },
    {
      "name": "Saleh Bakri",
      "url": "https://www.imdb.com/name/nm2759746/"
    },
    {
      "name": "Riyad Ideis",
      "url": "https://www.imdb.com/name/nm0406848/"
    }
  ],
  "director": [
    {
      "name": "Annemarie Jacir",
      "url": "https://www.imdb.com/name/nm1486975/"
    }
  ],
  "creator": [
    {
      "name": "Annemarie Jacir",
      "url": "https://www.imdb.com/name/nm1486975/"
    }
  ]
}