{
  "type": "Movie",
  "name": "Tangled",
  "url": "https://www.imdb.com/tt0398286/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTAxNDYxMjg0MjNeQTJeQWpwZ15BbWU3MDcyNTk2OTM@._V1_.jpg",
  "description": "The magically long-haired Rapunzel has spent her entire life in a tower, but now that a runaway thief has stumbled upon her, she is about to discover the world for the first time, and who she really is.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2011-01-30",
    "inLanguage": "English",
    "heading": "Disney&apos;s best film in a long time!",
    "reviewBody": "I am a huge Disney and animation fan, and was really interested in seeing Tangled. For me Disney have so many classics under their wing, Beauty and the Beast, The Lion King, Sleeping Beauty, Snow White, Bambi, Pinocchio, The Little Mermaid and Aladdin especially. For over a decade, the past Disney films ranged from very enjoyable(Emperor&apos;s New Groove) to truly disappointing(Chicken Little)- The Hunchback of Notre Dame and Tarzan were the last ones to truly blow me away- until now.\n\nWhile Tangled had me interested, I didn&apos;t like how the film was advertised. The trailer looked as though the film would be a Dreamworks knock-off, and I didn&apos;t think much of the title either. I needn&apos;t have worried, Tangled was wonderful and Disney&apos;s best film in a while(I know I said that about last year&apos;s Princess and the Frog, yes I actually liked that too, but after seeing Tangled I&apos;ve changed my mind). The film is so much better than its advertising suggested, it is not a knock-off of Dreamworks and more importantly it not only has the Disney magic but it has something for both kids and adults.\n\nWhat wowed me immediately about Tangled was the animation. It is simply gorgeous. The colours look beautiful, the backgrounds are stunning especially that surrounding Rapunzel&apos;s tower and the characters are very well modelled. The real revelations are with Rapunzel&apos;s hair, which is a masterstroke and also the floating lanterns, a scene of true beauty and very touching. Alan Menken&apos;s music was a surprise and in a good way. For me, this was his best score since The Hunchback of Notre Dame(that score is amazing), I was especially taken with the Kingdom Dance.\n\nThe songs are also not bad at all, they are not quite instant classics like Colours of the Wind, Beauty and the Beast, When You Wish Upon a Star, Heigh Ho, Part of Your World, Circle of Life, Hellfire, Under the Sea, Whole New World and Bells of Notre Dame are, but they are listenable with beautiful melodies and surprisingly decent lyrics. The best for me were the stunning I See the Light and the goosebump-inducing Mother Knows Best.\n\nThe writing is another strong asset. Tangled has some truly excellent writing, particularly with Flynn and Rapunzel, it is funny, witty and even touching. The storytelling is polished and is snappily paced, with the action sequences lively and the ending fitting well with the rest of the movie. When I saw the trailer I was expecting a story scattered with pop-culture references and almost laughter-free dialogue, but actually the storytelling does have a classic feel to it and some scenes like the aforementioned floating lanterns give the film its magic.\n\nI also loved Tangled&apos;s characters. Rapunzel is one sassy heroine and is also someone young girls in particular can relate to. Flynn is a charming, dashing and charismatic hero too, and his interaction with Rapunzel alone gives Tangled its spark. Mother Gothel is another strong character, in her character you can see shades of both Lady Tremaine and Frollo, and on top of that she is a very intriguing villainess. Even more surprising were the comic relief characters. There have been animated films/Disney films where the comedy either works like a glove(Emperor&apos;s New Groove), is either hit or miss(I say this with a heavy heart, Hunchback of Notre Dame) or doesn&apos;t work at all(Chicken Little). Here the comedy works perfectly, hilarious without being too over-the-top. Pascal is both hilarious and cute and Maximus the horse is a sheer delight in everything he does.\n\nThe voice acting also adds a lot to the film. Mandy Moore is a perfect choice for Rapunzel, she has a pleasant speaking voice and a beautiful singing voice. I loved the charisma Zachary Levi brings to Flynn, his voice is one of the main reasons why Flynn is as likable as he is, while Donna Murphy is perfect as Mother Gothel.\n\nIn conclusion, this was a wonderful film and I recommend it heartily for both kids and adults. For Disney fans too, I think you will be delighted, if you want humour, adventure, beautiful animation, good music, classic storytelling, witty scripting and likable characters, Tangled is a perfect match. 10/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 489260,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2011-01-28",
  "keywords": "rapunzel,female protagonist,based on fairy tale,strong female character,barefoot",
  "duration": "PT1H40M",
  "actor": [
    {
      "name": "Mandy Moore",
      "url": "https://www.imdb.com/name/nm0601553/"
    },
    {
      "name": "Zachary Levi",
      "url": "https://www.imdb.com/name/nm1157048/"
    },
    {
      "name": "Donna Murphy",
      "url": "https://www.imdb.com/name/nm0614220/"
    }
  ],
  "director": [
    {
      "name": "Nathan Greno",
      "url": "https://www.imdb.com/name/nm1977355/"
    },
    {
      "name": "Byron Howard",
      "url": "https://www.imdb.com/name/nm0397174/"
    }
  ],
  "creator": [
    {
      "name": "Dan Fogelman",
      "url": "https://www.imdb.com/name/nm1557594/"
    },
    {
      "name": "Jacob Grimm",
      "url": "https://www.imdb.com/name/nm0342278/"
    },
    {
      "name": "Wilhelm Grimm",
      "url": "https://www.imdb.com/name/nm0342303/"
    }
  ]
}