{
  "type": "Movie",
  "name": "The City of Your Final Destination",
  "url": "https://www.imdb.com/tt0896923/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTUwOTc0ODk2Ml5BMl5BanBnXkFtZTcwNjE5MDgyMw@@._V1_.jpg",
  "description": "Omar wants to write an authorized biography on a dead writer and travels to a farm in Uruguay to meet the trustees - the writer&apos;s brother, widow and cute mistress/mother of his daughter.",
  "review": {
    "author": "gradyharp",
    "dateCreated": "2010-08-25",
    "inLanguage": "English",
    "heading": "The Impact of Desire and Love",
    "reviewBody": "James Cameron&apos;s elegant, wistful novel THE CITY OF YOUR FINAL DESTINATION has been well transitioned to the screen by Ruth Prawer Jhabvala and director James Ivory: in so many ways this film brings a host of fond memories of all of the films made by the members of Merchant Ivory films. It has the same sense of grace of transporting one culture into another, of examining interpersonal relationships as they are tied to etiquette and tradition and family, and the chances we take in the name of self-fulfillment and love. It is a mood piece and a delectable offering for the brain. \n\nOmar Razaghi (Omar Metwally) is a postgraduate student and instructor at a Colorado College, living in a tenuous relationship with Deirdre (Alexandra Maria Lara), and delaying his desire to write his PhD thesis -a proposed biography of deceased novelist Jules Gund. He is unhappy with his life, frustrated that his thesis committee will not approve of his dissertation unless he has the family of Jules Gund&apos;s permission to write the biography. After a little nudge from a colleague he decides to travel to Uruguay - without Deirdre - to gain permission from the Gund family to proceed. Deirdre, hurt because Omar wants to go without her, insists that Omar travel to Uruguay: this may his only chance to step out of the life whose rut he is in and move on to higher means. \n\nOmar journeys to Uruguay where he meets the Gund &apos;family&apos; - Gund&apos;s gay brother, Adam (Anthony Hopkins) and his lover of 25 years Pete (Hiroyuki Sanada); former wife Caroline (Laura Linney); and Arden (Charlotte Gainsbourg), Gund&apos;s mistress and mother of Gund&apos;s daughter, Portia. Though greeted with hospitality it is clear that the family, as executors of Gund&apos;s estate, refuse to give Omar permission. Omar is invited to live with the Gund&apos;s until he can make arrangements to return to the US, but the visit is extended, allowing for changes to insert in the family unity as each one slowly agrees to allow Omar to write the biography. Omar has a fall, is recovered by Arden (Deirdre flies to Uruguay for support but senses the change in Omar&apos;s feelings with Arden), and during his recovery Omar awakens to what he really wants in life - love, beauty, and the freedom to express himself in all matters. \n\nIn the manner of fine story telling, there are excellent moments of passion, and comedy, and a fine dissection of family life in all its permutations. The cast is uniformly excellent, composed of such a stellar group of actors. This is a quiet adagio of a film, filled with charm, elegant cinematography by Javier Aguirresarobe, and fine music - both from the classics and from contemporary writing by Jorge Drexler. This film retains the &apos;Merchant Ivory&apos;: and that says enough! Grady Harp, August 10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 3221,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "PG-13",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2010-06-24",
  "keywords": "male male kiss,dead brother,suicide,death of parents in an airplane crash,reading a letter aloud",
  "duration": "PT1H57M",
  "actor": [
    {
      "name": "Omar Metwally",
      "url": "https://www.imdb.com/name/nm1272540/"
    },
    {
      "name": "Anthony Hopkins",
      "url": "https://www.imdb.com/name/nm0000164/"
    },
    {
      "name": "Charlotte Gainsbourg",
      "url": "https://www.imdb.com/name/nm0001250/"
    }
  ],
  "director": [
    {
      "name": "James Ivory",
      "url": "https://www.imdb.com/name/nm0412465/"
    }
  ],
  "creator": [
    {
      "name": "Ruth Prawer Jhabvala",
      "url": "https://www.imdb.com/name/nm0695609/"
    },
    {
      "name": "Peter Cameron",
      "url": "https://www.imdb.com/name/nm0131702/"
    }
  ]
}