{
  "type": "Movie",
  "name": "Unstoppable",
  "url": "https://www.imdb.com/tt0477080/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI4NDQwMDM0N15BMl5BanBnXkFtZTcwMzY1ODMwNA@@._V1_.jpg",
  "description": "With an unmanned, half-mile-long freight train barreling toward a city, a veteran engineer and a young conductor race against the clock to prevent a catastrophe.",
  "review": {
    "author": "nicolechan916",
    "dateCreated": "2016-06-30",
    "inLanguage": "English",
    "heading": "Exciting",
    "reviewBody": "Though this film has a pretty simple and straightforward story, it is still exciting to watch. It does well in establishing the normality of the lives of these railway workers and the rhythm that they work in. Scott does well in setting the tone of the film early on, and with the music accompaniment, the tension slowly rises. \n\nPine and Washington are good in their roles, and work well together. Perhaps it is because their characters do not get along well, which may be easier to portray. Anyway, their delivery and chemistry with each other fit the film. Dawson does well in roles with a sense of urgency to them. I vaguely remember her being an FBI agent somewhere else, and with this character, she is able to portray how intense a situation they&apos;re in. \n\nI especially liked the cinematography and editing in this movie. With a high speed train moving through various landscapes, the numerous wide angle and aerial shots give a good view of the surroundings. The quick jump cuts, and juxtapositions between the various characters on screen also helps to keep the audience well informed.\n\nOne thing that I felt was a bit forced, was the family angle. I guess being characters, the filmmakers felt that they needed to incorporate family values, so put that in there. I didn&apos;t care much for the drama of Pine&apos;s life though. I was intrigued a little at what may have happened, but Pine&apos;s character didn&apos;t really fit the drama. \n\nOverall, quite an exciting but simple film.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 206744,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Thriller"
  ],
  "datePublished": "2010-11-24",
  "keywords": "train,runaway train,train engineer,freight train,train movie",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Denzel Washington",
      "url": "https://www.imdb.com/name/nm0000243/"
    },
    {
      "name": "Chris Pine",
      "url": "https://www.imdb.com/name/nm1517976/"
    },
    {
      "name": "Rosario Dawson",
      "url": "https://www.imdb.com/name/nm0206257/"
    }
  ],
  "director": [
    {
      "name": "Tony Scott",
      "url": "https://www.imdb.com/name/nm0001716/"
    }
  ],
  "creator": [
    {
      "name": "Mark Bomback",
      "url": "https://www.imdb.com/name/nm0093560/"
    }
  ]
}