{
  "type": "Movie",
  "name": "When in Rome",
  "url": "https://www.imdb.com/tt1185416/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMmViZDQ0OGEtNDJlZS00ZmM0LTk2MTItY2NmNGI4NTliOTg1XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
  "description": "Beth is a young, ambitious New Yorker who is completely unlucky in love. However, on a whirlwind trip to Rome, she impulsively steals some coins from a reputed fountain of love, and is then aggressively pursued by a band of suitors.",
  "review": {
    "author": "prodbabies",
    "dateCreated": "2010-01-29",
    "inLanguage": "English",
    "heading": "When In Rome - Remember To Keep A Story",
    "reviewBody": "Well if you saw the trailers you know the premise, girl in Rome decides to pick up coins from a fountain, which invokes the original owner when the coin was tossed to fall in love with her....\n\nFirst, they missed the comedic opportunity to have ONE of those people be a girl, but whatever; I guess it is only men who toss coins in the fountain in hope of love.\n\nWhat was on the screen was fine. The actors all gave comedic performances up to that of previous RomCom formula films. The problem with the film is what is NOT there. This film seems to suffer from being over edited and cut down to 91 minutes. We get a short set-up to TRY and empathize with the leads and we get no (and I mean ZERO) background on the other men competing for love other than their career choice, before watching them behave silly. At the end we get a very brief explanation of from where each love stricken pursuer life was prior to being hoodwinked, but its too late and provides no fulfillment.\n\nThe movie plays out many jokes and gags that have no pay off since there was nothing behind them. There are a few moments where a punch-line obviously had some meaning in the relationships of the characters, but seems unfunny as the meat and plot behind the joke is missing.\n\nIn the end, we get a shell of a movie, it has a nice frosting but the cake has been stripped!! It seemed like if they had left, some of what was obviously cut, in the film it could have been really good. But the final product we get lacks anything memorable.\n\nSkip at the high priced theater, and wait for video.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 64382,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.5
  },
  "contentRating": "PG",
  "genre": [
    "Comedy",
    "Romance"
  ],
  "datePublished": "2010-06-25",
  "keywords": "rome italy,wading in a fountain,trevi fountain rome,wishing fountain,curator",
  "duration": "PT1H31M",
  "actor": [
    {
      "name": "Kristen Bell",
      "url": "https://www.imdb.com/name/nm0068338/"
    },
    {
      "name": "Josh Duhamel",
      "url": "https://www.imdb.com/name/nm0241049/"
    },
    {
      "name": "Anjelica Huston",
      "url": "https://www.imdb.com/name/nm0001378/"
    }
  ],
  "director": [
    {
      "name": "Mark Steven Johnson",
      "url": "https://www.imdb.com/name/nm0425756/"
    }
  ],
  "creator": [
    {
      "name": "David Diamond",
      "url": "https://www.imdb.com/name/nm0224606/"
    },
    {
      "name": "David Weissman",
      "url": "https://www.imdb.com/name/nm0919289/"
    }
  ]
}