

{
  "type": "Movie",
  "name": "Guta-yubalja-deul",
  "url": "https://www.imdb.com/tt0821462/",
  "poster": "https://m.media-amazon.com/images/M/MV5BM2Y4MWNlYjgtZWUzZi00MjU1LTkzMDMtMTllYTFkNjgzZDY1XkEyXkFqcGdeQXVyNTA2Mjk2MTk@._V1_.jpg",
  "description": "On a day trip through countryside, aspiring opera singer In-jeong flees to woods to escape advances of her lecherous professor and mentor, Yeong-sun.",
  "review": {
    "author": "zulus88",
    "dateCreated": "2011-04-10",
    "inLanguage": "English",
    "heading": "Unsurprising Korean drama.",
    "reviewBody": "One might think that soon a time will come for Asian cinema to reassess its trademark Extreme label. Or that a new approximation of this quality will emerge on the receiving it, critical end. A Bloody Aria is not yet at this stage, it applies violence with straightforward honesty and typical for the Korean cinema consideration of social themes. And it never really discusses implications that emerge. \\n\\nIt basks in social relevance that sadly remains restricted to its Korean context. And despite handling some more general themes- cyclical violence, bullying etc. it never unveils itself as a film with a broader appeal. Most likely then, it will connect with enthusiasts of the Korean cinema that will find some stimuli in observing how portrayal of youth degenerated since seminal Attack the Gas Station (Kim Sang-Jin, 1999). This particular film makes for a disturbing comparison of how the violence has escalated in Korea&apos;s national cinema, to accommodate both the expectations of the market and relevant changes in the society.\\n\\nTo equal extent A Bloody Aria can be dissected together with British Eden Lake (Watkins, 2008) or French They (Moreau, Palud, 2006). It emerges as a film less entertaining and more restrained but ultimately more wholeheartedly committed to the comment it makes. Tempo is interrupted by lengthy conversations that intentionally build up the threat but ultimately fail to do so. No sustained suspense ever emerges, consumed by the ambiguity of the film&apos;s villains. It collapses as a thriller as it struggles to maintain its, overriding genre schematics, devotion to keen observation of the intensifying power struggle. It consistently reminds the audience to look past the physical facades and our expectations build upon impeccable acting of the entire cast. \\n\\nUnfortunately, unlike many Korean efforts from the recent past Won Shin-yeon&apos;s film fails to captivate the audience with any particular sense of style. Mobile, quasi documentary camera is dull and where one would expect some visual flair it serves images that are unimpressive and (perhaps deliberately) annoyingly overexposed. Disconnection of imagery, themes and musical inclinations contained in the title are disappointing since more grounded sense of style could reward the audience for awkward pacing.\\n\\nVerdict: Korean Funny Games it isn&apos;t. Neither is it a particularly explicit example of Asian extreme. It&apos;s a slow burning amalgam of familiar social and cinematic motifs that manages however to radiate with some unique identity. Not as relevant outside of its national targets of critique it is still interesting to watch for Won Shin-yeon&apos;s own take on material recognizable from both Haneke and realist horror in the spirit of Deliverance.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 932,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "18",
  "genre": [
    "Action",
    "Drama",
    "Horror"
  ],
  "datePublished": "2008-10-24",
  "keywords": "professor,woods,womanizer,student,opera singer",
  "duration": "PT1H55M",
  "actor": [
    {
      "name": "Lee Byung-joon",
      "url": "https://www.imdb.com/name/nm2293535/"
    },
    {
      "name": "Oh Dal-su",
      "url": "https://www.imdb.com/name/nm1367681/"
    },
    {
      "name": "Kyung Ho Jung",
      "url": "https://www.imdb.com/name/nm1658947/"
    }
  ],
  "director": [
    {
      "name": "Shin-yeon Won",
      "url": "https://www.imdb.com/name/nm2008414/"
    },
    {
      "name": "Won Sin Yun",
      "url": "https://www.imdb.com/name/nm15633369/"
    }
  ],
  "creator": [
    {
      "name": "Shin-yeon Won",
      "url": "https://www.imdb.com/name/nm2008414/"
    },
    {
      "name": "Won Sin Yun",
      "url": "https://www.imdb.com/name/nm15633369/"
    }
  ]
}