

{
  "type": "Movie",
  "name": "Beer for My Horses",
  "url": "https://www.imdb.com/tt1178640/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjE0NzI3OTEwNl5BMl5BanBnXkFtZTcwNDA1OTg3MQ@@._V1_.jpg",
  "description": "Two best friends work together as deputies in a small town. The two defy the Sheriff and head off on an outrageous road trip to save the protagonist's girlfriend from drug lord kidnappers.",
  "review": {
    "author": "bronzesrv",
    "dateCreated": "2018-10-31",
    "inLanguage": "English",
    "heading": "Hilarious...",
    "reviewBody": "Hilarious... the movie plot should have been more like the extended video version, where Toby Keith was a cop and Willie Nelson was his father who was a retired cop and they bonded together to hunt down a serial killer. I was disappointed that this plot was not in the movie. I felt if it had been, the movie would have been much better and did better at the box office. This is what had a lot of people who was hooked on the video disappointed, me included. However the comedy was great! I'm one who loves to laugh. Yes it could have been better, but it wasn't the worst movie I've seen. Each character was very unique and have something obnoxious and funny about them. I thought it was pretty cool to have veterans in the movie like Ted Nugent, Tom Skerritt and Gina Gershon. They didn't do it because they needed money as one reviewer assumed! They did it because they thought it would be fun.! This movie has become one of my all-time favorites and I just watch it whenever I just need to de-stress and have a good laugh.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 1929,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.8
  },
  "contentRating": "12",
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "datePublished": "2008-08-08",
  "keywords": "bound and gagged, bumbling sidekick, woman bound and gagged, best friends, road trip",
  "duration": "PT1H26M",
  "actor": [
    {
      "name": "Toby Keith",
      "url": "https://www.imdb.com/name/nm0445313/"
    },
    {
      "name": "Rodney Carrington",
      "url": "https://www.imdb.com/name/nm1625306/"
    },
    {
      "name": "Claire Forlani",
      "url": "https://www.imdb.com/name/nm0001231/"
    }
  ],
  "director": [
    {
      "name": "Michael Salomon",
      "url": "https://www.imdb.com/name/nm0758900/"
    }
  ],
  "creator": [
    {
      "name": "Rodney Carrington",
      "url": "https://www.imdb.com/name/nm1625306/"
    },
    {
      "name": "Toby Keith",
      "url": "https://www.imdb.com/name/nm0445313/"
    }
  ]
}