

{
  "type": "Movie",
  "name": "Choke",
  "url": "https://www.imdb.com/tt1024715/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTMxMDI4MTE0Ml5BMl5BanBnXkFtZTcwNTg0NDI3MQ@@._V1_.jpg",
  "description": "A sex-addicted con-man pays for his mother&apos;s hospital bills by playing on the sympathies of those who rescue him from choking to death.",
  "review": {
    "author": "pyrocitor",
    "dateCreated": "2008-09-27",
    "inLanguage": "English",
    "heading": "Worth digesting slowly",
    "reviewBody": "Few authors have as instantly distinctive a style as Chuck Palahniuk: simply look for the most convoluted, scathingly hilarious, disturbingly filthy and twisted narratives which somehow prove revelatory of strikingly genuine nuggets of human nature, usually the ones we would rather keep hidden. Perhaps for this reason, with the exception of his enormous cult hit Fight Club, Palahniuk&apos;s work has seldom been adapted for the big screen, with movie executives likely preferring to work with plots which they can be sure their viewers will understand, and not result in heart attacks from either repulsion or outrage. As such, writer/director Clark Gregg&apos;s adaptation of Palahniuk&apos;s Choke is a daring move - after all, how often does one see the tale of a sardonic sex-addict playing on the sympathies of those who save him from choking to death in restaurants to pay for his mother&apos;s hospital bills gracing the marquees? And yet, as surprising as it may seem, for all of the caustically humorous overtones, at the heart of Choke lies a surprisingly tender and fascinatingly complex character study, brimming with humanity and pathos... and yes, loads of gratuitous sex on the side. \\n\\nThose expecting more along the lines of Fight Club&apos;s nihilistic social commentary and brutal violence may find themselves disappointed, as Choke&apos;s sordid portrait of a man so used to mindlessly numbing his pain coming to terms with his flaws and potential for good almost by accident proves a far more sympathetic look, albeit one with graphic and perverse sexual content. That being said, writer/director Gregg&apos;s screenplay is a razor sharp medley of slashing Palahniuk wit and biting one-liners as well as surprisingly poignant character revelations, blending an increasingly eclectic myriad of events into an impressively concise (the film runs only 89 minutes) yet still cohesive storyline. If a flaw is to be found, it lies in the film&apos;s ending, which flirts which but mercifully avoids succumbing to convention and provides what may be one plot twist too many, making the finale somewhat unnecessarily cluttered (and yet strangely fitting) but in such an impressively unique work, such minute concerns are easily forgiven. \\n\\nOne of the film&apos;s many blessings is the casting of the supremely talented Sam Rockwell as Victor Mancini, the sort of lead role he is far too often deprived of. It is a testament to Rockwell&apos;s immense skill and charisma that he manages not only to sympathize a character who ultimately sets out to make himself dislikeable but also evokes both hilarity and pathos in the least likely places, delivering one of the most remarkable performances in recent memory. Similarly, Angelica Huston is incendiary as Mancini&apos;s mother (in flashbacks shown to be an even less stable parent before her dementia) and her interactions with her son prove surprisingly poignant and emotionally wrenching. The tremendously likable Brad William Henke raises many a laugh as Mancini&apos;s similarly sex-addicted best friend, and Kelly Macdonald gives a quirky but charming performance as the doctor who may, despite Mancini&apos;s best efforts, end up being a love interest. Director Gregg has a hilarious supporting role as the earnest head of Victor&apos;s collonial historical interpreter site, and Jonah Bobo proves a rising talent to watch as Victor&apos;s childhood self.\\n\\nDarkly hilarious, sublimely subversive and yet hiding surprising pathos and heart, Choke proves one of the most offbeat films of the year, and is all the more entertaining for it. While the film is without question not for everyone, those willing to stomach the acerbic and often disturbing humour and hefty sexual content may discover one of the most darkly enjoyable movie experiences of quite some time. \\n\\n-9/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 33481,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "18",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2008-11-21",
  "keywords": "sex addict,casual sex,falling asleep during sex,sex scene,sex in a hospital",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Sam Rockwell",
      "url": "https://www.imdb.com/name/nm0005377/"
    },
    {
      "name": "Anjelica Huston",
      "url": "https://www.imdb.com/name/nm0001378/"
    },
    {
      "name": "Kelly Macdonald",
      "url": "https://www.imdb.com/name/nm0531808/"
    }
  ],
  "director": [
    {
      "name": "Clark Gregg",
      "url": "https://www.imdb.com/name/nm0163988/"
    }
  ],
  "creator": [
    {
      "name": "Clark Gregg",
      "url": "https://www.imdb.com/name/nm0163988/"
    },
    {
      "name": "Chuck Palahniuk",
      "url": "https://www.imdb.com/name/nm0657333/"
    }
  ]
}