

{
  "type": "Movie",
  "name": "College Road Trip",
  "url": "https://www.imdb.com/tt0997047/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc5NjM4Njg1NF5BMl5BanBnXkFtZTcwMDE2OTc1MQ@@._V1_.jpg",
  "description": "When an overachieving high school student decides to travel around the country to choose the perfect college, her overprotective cop father decides to accompany her to keep her on the straight and narrow.",
  "review": {
    "author": "Smells_Like_Cheese",
    "dateCreated": "2008-03-18",
    "inLanguage": "English",
    "heading": "With the exception of the Osmonds, the pig hooked on coffee beans, the wanna be dictator son, and some extremely cheesy jokes... it&apos;s an a-OK film",
    "reviewBody": "OK, this movie is in no possible way to be family movie of the year, I can&apos;t stand Marin Lawerence with a passion, I mean this guy has the most ridicules sense of humor and his movies usually equal bad. But my boyfriend wanted to see College Road Trip so badly, so it was his pick. We saw it tonite, I have to say that actually with several exceptions, this wasn&apos;t such a bad family film. As for me and my boyfriend alone to see it? No, uh uh, but I&apos;m judging this as what it is meant to be, a family film. I know that these Disney family films get a little old, the story is played over a million times, but I realized something, the story is safe, so naturally they&apos;ll play on it. So honestly, it&apos;s not that big of a deal, as for some of the jokes? Some were not that bad, some were cute, but some were just, oh, god, Donny Osmond.\\n\\nMelanie is what you would call the perfect daughter, perfect grades, good morals, great friends, and has just got an interview with Georgetown University for acceptance. The problem? Her over protective and controlling father, James doesn&apos;t want to let go of her, so he tells her that they&apos;ll go on a college road trip and in the mean time he&apos;ll try to convince her to go to a school closer to home. But along the way he learns that maybe it&apos;s time to think of what she wants and to trust her.\\n\\nCollege Road Trip isn&apos;t a horrific film, I wouldn&apos;t put this into the bottom 100 on IMDb, believe me, you could do so much worse when it comes to a Disney family film. I know a lot of people are giving this film a bad rep, but honestly, it&apos;s worth it for the kids. It&apos;s cute enough for the family, has a good message, and isn&apos;t all so bad. Honestly, if it were not for Donny Osmond coming into the film and scaring 10 years off my life, I would give it a higher rating, but I think my rating is generous enough. For the family, I recommend, for an adult, you might wanna avoid. I&apos;ll be having nightmares for a few days of Donny and his daughter singing.\\n\\n4/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 16635,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.3
  },
  "contentRating": "U",
  "genre": [
    "Adventure",
    "Comedy",
    "Drama"
  ],
  "datePublished": "2008-08-22",
  "keywords": "college entrance,slimehouse,road trip adventure,road trip comedy,satire comedy",
  "duration": "PT1H23M",
  "actor": [
    {
      "name": "Raven-Symon\\u00e9",
      "url": "https://www.imdb.com/name/nm0712368/"
    },
    {
      "name": "Martin Lawrence",
      "url": "https://www.imdb.com/name/nm0001454/"
    },
    {
      "name": "Kym Whitley",
      "url": "https://www.imdb.com/name/nm0005552/"
    }
  ],
  "director": [
    {
      "name": "Roger Kumble",
      "url": "https://www.imdb.com/name/nm0474955/"
    }
  ],
  "creator": [
    {
      "name": "Emi Mochizuki",
      "url": "https://www.imdb.com/name/nm0595088/"
    },
    {
      "name": "Carrie Lee Wilson",
      "url": "https://www.imdb.com/name/nm0933144/"
    },
    {
      "name": "Cinco Paul",
      "url": "https://www.imdb.com/name/nm0666791/"
    }
  ]
}