

{
  "type": "Movie",
  "name": "College",
  "url": "https://www.imdb.com/tt0844671/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc4Mjc1NzIxOF5BMl5BanBnXkFtZTcwMjEzMjc3MQ@@._V1_.jpg",
  "description": "A wild weekend is in store for three high school seniors who visit a local college campus as prospective freshmen.",
  "contentRating": "R",
  "genre": [
    "Comedy"
  ],
  "datePublished": "2008-08-29",
  "keywords": [
    "one word title",
    "horniness",
    "mooning",
    "exhibitionist",
    "female exhibitionist"
  ],
  "duration": "PT1H34M",
  "actor": [
    {
      "name": "Drake Bell",
      "url": "https://www.imdb.com/name/nm0068166/"
    },
    {
      "name": "Kevin Covais",
      "url": "https://www.imdb.com/name/nm2278177/"
    },
    {
      "name": "Andrew Lewis Caldwell",
      "url": "https://www.imdb.com/name/nm2255271/"
    }
  ],
  "director": [
    {
      "name": "Deb Hagan",
      "url": "https://www.imdb.com/name/nm1834176/"
    }
  ],
  "creator": [
    {
      "name": "Dan Callahan",
      "url": "https://www.imdb.com/name/nm0990439/"
    },
    {
      "name": "Adam Ellison",
      "url": "https://www.imdb.com/name/nm1337351/"
    }
  ],
  "review": {
    "author": "SnoopyStyle",
    "dateCreated": "2015-12-16",
    "inLanguage": "English",
    "heading": "college romp with weak leads",
    "reviewBody": "Kevin Brewer (Drake Bell) is going with bookish friend Morris Hooper for his scholarship meeting. His girlfriend Gina (Alona Tal) is going to Miami without him. She breaks up with him for being a dork. Fletcher tells the guys about a wild college weekend trip. Kevin decides to go partying with Morris and idiot best friend Carter Scott (Andrew Caldwell) at the University. He falls for college girl Kendall (Haley Bennett) and faces frat bully Teague (Nick Zano).\\n\\nA large part of my dislike hinges on Andrew Caldwell. He is the standard fat loudmouth best friend. The problem is that he overplays the annoying card. He&apos;s far too unlikeable. His early interaction with his friends is off-putting. I need to laugh at him. Instead, I&apos;m annoyed with him. Drake Bell is a dud. He&apos;s obviously trying grow out of his Nickelodeon TV show which I never saw. I don&apos;t blame him for trying but his acting is stiff. I like the endearing dorky third wheel Morris. On the other hand, Kenall is also a dud. Haley Bennett has always struck me as a high maintenance girl. She fits Gina much better and Alona Tal would have been a superior Kendall as a girl next door. This is not a particular special college party romp and the leads lack good charisma.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 12673,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.6
  }
}