

{
  "type": "Movie",
  "name": "Garden Party",
  "url": "https://www.imdb.com/tt0828393/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjAzNTE2MTU2Nl5BMl5BanBnXkFtZTcwOTU3NjU3MQ@@._V1_.jpg",
  "description": "April (age 15) is running from one bad situation into another, hoping to find an answer that doesn't involve nudity, and falls in with a group of confused kids chasing their dreams. The black widow in the web is the sexy, pot-deal...",
  "contentRating": "Not Rated",
  "genre": [
    "Drama"
  ],
  "datePublished": "2008-05-30",
  "keywords": "bare chested male, male masturbation, looking at oneself in a mirror, pornographer, party",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Erik Smith",
      "url": "https://www.imdb.com/name/nm1206090/"
    },
    {
      "name": "Tierra Abbott",
      "url": "https://www.imdb.com/name/nm1265068/"
    },
    {
      "name": "Vinessa Shaw",
      "url": "https://www.imdb.com/name/nm0005416/"
    }
  ],
  "director": [
    {
      "name": "Jason Freeland",
      "url": "https://www.imdb.com/name/nm0293253/"
    }
  ],
  "creator": [
    {
      "name": "Jason Freeland",
      "url": "https://www.imdb.com/name/nm0293253/"
    }
  ],
  "review": {
    "author": "jayraskin1",
    "dateCreated": "2011-09-10",
    "inLanguage": "English",
    "heading": "Nice, Feel Good, Laid Back Movie",
    "reviewBody": "People looking for action and thrills should watch another movie. This is for people looking for character driven movies which bring smiles, rather than laughs. Although obviously low budget, everything in the film was quite professional. All the acting was good and the camera-work was equal to any good television series. \n\nStandouts were Vinessa Shaw as real estate Sally St. Claire and Willa Holland as April. I haven't seen either before, but they both presented warm and delightful characters. Richard Gunn as Todd and Erik Smith as Sammy also showed themselves adept at light humor.\n\nI hope that Jason Freeland, the writer-director, gets a chance to do more stuff. He handles this material very well. While there's only a touch of nudity in the film, there is a nice subtle erotic vibe to the film with most scenes centering on some aspect of sexuality.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 3543,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.5
  }
}