

{
  "type": "Movie",
  "name": "Savage Grace",
  "url": "https://www.imdb.com/tt0379976/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTIyNjYwNjgwNF5BMl5BanBnXkFtZTcwMTEzNDk2MQ@@._V1_.jpg",
  "description": "A dramatization of the shocking Barbara Daly Baekeland murder case, which happened in a posh London flat on Friday 17 November 1972. The bloody crime caused a stir on both sides of the Atlantic and remains one of the most memorable events of the 1970s.",
  "review": {
    "author": "moutonbear25",
    "dateCreated": "2008-07-30",
    "inLanguage": "English",
    "heading": "That of a Mother",
    "reviewBody": "When I was growing up, my mother could be a little over involved in my life but she&apos;s got nothing on Barbara Baekeland (Julianne Moore). SAVAGE GRACE tells Barbara&apos;s story and that of her incalculable influence on the direction of her very tight family. Together, Barbara, Brooks (Stephen Dillane) and Tony (Barney Clark as a boy, Eddie Redmayne as an adult), exist in a tiny bubble where they can be seen by and perform for the rest of the world but ultimately exist solely for each other. Rich beyond their own comprehension, the Baekeland&apos;s exude an air of arrogance and thrive on the act of acting. And even though, as the years pass on, the friends, acquaintances and passersby will have run far away, the Baekeland&apos;s still have us.\\n\\nThe Baekeland&apos;s come from money. Well, at least Brooks does. His father was the inventor of Bakelite, a popular plastic. Barbara, a former model and almost famous actress, married into the fortune and it suited her just fine to do nothing but be seen. With no real drama to occupy their time, the Baekeland&apos;s must create their own and they become experts in the craft. And like the entirely selfish parents they are, they teach their young son, Tony, everything they know. First time feature filmmaker and brave soul, Tom Kalin, tells their revolting yet tragic story in a manner that neither glorifies nor condemns their demented ways. All the while though, he centers his attention on Tony so that we never forget who the real victim is. This makes it all the more deplorable when Tony abandons reason to embrace his family heritage.\\n\\nSAVAGE GRACE is not for all. Make no mistake, when I say that the Baekeland&apos;s ruin each other and bring about all of their own misfortune, I am not speaking lightly. This is a family that shares baths, beds and lovers. Kalin is mindful of his audience&apos;s likely discomfort but also never afraid to show that audience the dirty details. Besides, when all the debauchery becomes too much to handle, one can always look to Moore and bask in her brilliance. Moore is flippant one moment and affected the next. Her performance is so delicately balanced between calculated control and callous chaos that one never knows which way she&apos;ll turn and one is always shocked to find out. Both Dillane (who is practically unrecognizable) and Redmayne (who could so easily be related to Moore in reality with his pale, freckled skin) do more than simply hold their own. They complete the trio and it is a delight to watch them play off of each other, albeit a disturbing delight.\\n\\nKalin has not only crafted an engaging film but also a bizarre experience. If you can stomach this true story, then you will be treated to a frankness that is not common in American cinema. You will also get to spend time in dark places you may not be accustomed to. However, when you inevitably arrive safely on the other side, you will know the drastic differences in what it means to be fortunate.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 12004,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "15",
  "genre": [
    "Drama"
  ],
  "datePublished": "2008-07-11",
  "keywords": [
    "male nudity",
    "male frontal nudity",
    "based on true story",
    "male pubic hair",
    "penis"
  ],
  "duration": "PT1H37M",
  "actor": [
    {
      "name": "Julianne Moore",
      "url": "https://www.imdb.com/name/nm0000194/"
    },
    {
      "name": "Eddie Redmayne",
      "url": "https://www.imdb.com/name/nm1519666/"
    },
    {
      "name": "Stephen Dillane",
      "url": "https://www.imdb.com/name/nm0226820/"
    }
  ],
  "director": [
    {
      "name": "Tom Kalin",
      "url": "https://www.imdb.com/name/nm0435788/"
    }
  ],
  "creator": [
    {
      "name": "Howard A. Rodman",
      "url": "https://www.imdb.com/name/nm0734912/"
    },
    {
      "name": "Natalie Robins",
      "url": "https://www.imdb.com/name/nm1446195/"
    },
    {
      "name": "Steven M.L. Aronson",
      "url": "https://www.imdb.com/name/nm1444985/"
    }
  ]
}