

{
  "type": "Movie",
  "name": "Sex and Death 101",
  "url": "https://www.imdb.com/tt0497972/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTI2ODc0NzgxNF5BMl5BanBnXkFtZTcwNTU3NTg1MQ@@._V1_.jpg",
  "description": "A guy's life is turned around by an e-mail that includes the names of everyone he's had sex with--and ever will have sex with. His situation gets worse when he encounters a femme fatale (Ryder) who targets men guilty of sex crime.",
  "review": {
    "author": "hall895",
    "dateCreated": "2009-06-13",
    "inLanguage": "English",
    "heading": "Somehow it kind of works",
    "reviewBody": "This movie makes very little sense. The whole thing is exceedingly bizarre. But somehow the movie kind of works. Simon Baker turns in a fine performance in the leading man role and it his charm which more than anything else enables the movie to be considered at least a mild success.\\n\\nBaker plays successful executive Roderick Blank who is about to be married. And then something strange happens. He receives an anonymous e-mail which lists, in chronological order, the names of every woman he has ever slept with. Bizarre to be sure but not a crisis as long as his wife to be is the last name on the list. She's not. She's number 29. There are 101 names on the list. Roderick initially shrugs it off as some kind of practical joke being perpetrated by his friends. Then again how would his friends know the names, in order, of every woman he's ever slept with? When Roderick accidentally (yes, accidentally) has sex with woman number 30 on the list he realizes there's something going on here. Looks like that wedding's not going to happen after all. Apparently there's a higher power at work. What is that higher power you ask? Well you see there's this computer which apparently knows everything. And it occasionally spits out random pointless information...like lists of women that men will sleep with for example. This is all explained by the three men who work with the computer in a mysterious, futuristic-looking office. These men are named Alpha, Beta and Fred. Told you this movie was bizarre.\\n\\nAnyhow it's pretty apparent where the sex in the movie's title comes from. Yes a multitude of women come and go as Roderick crosses off names on his list. But what about the death part? Well that's where Winona Ryder comes in. She plays Death Nell, a shadowy figure lurking mostly in the background of the movie, who goes around seducing men and then putting them into comas. But only men who deserve it you see, sexual deviants of some kind. Death Nell becomes a feminist hero, Roderick goes on sleeping with all these different women and hey, do you think perhaps these two characters might be destined to meet? Well I certainly hope so or else this whole thing is going to be rather pointless.\\n\\nFor a supposed comedy this movie isn't particularly funny. No real belly laughs to be had here, maybe a mild chuckle or two. It seems that Patton Oswalt, in playing Fred, is set up to be the designated funny guy but he's really not that funny at all. There are a few good moments here and there but there are a lot of times where the movie drags and there's nothing funny or even interesting going on. The plot perks up a bit when after sleeping with all these random women Roderick actually ends up in a quasi-serious relationship with a doctor played by Leslie Bibb. But that relationship comes with complications. And we know that this woman is not the last woman on the list so inevitably it's back to the parade of women in Roderick's life. There are times where it seems the movie is close to falling apart completely but Baker, who really has to carry things pretty much by himself, manages to hold it together and in the end it's a relatively enjoyable movie. Baker is excellent, Ryder does OK with minimal screen time and there's also room for another somewhat familiar face as playing Roderick's lesbian secretary Trixie is Mindy Cohn. Yes that would be Natalie of Facts of Life fame. You take the good, you take the bad, you take them both and there you have...a reasonably decent movie. That's Sex and Death 101.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 11561,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama",
    "Fantasy"
  ],
  "datePublished": "2008-02-22",
  "keywords": "stripper,bachelor party,one breast exposed,scantily clad female,erotica",
  "duration": "PT1H57M",
  "actor": [
    {
      "name": "Robert Wisdom",
      "url": "https://www.imdb.com/name/nm0936298/"
    },
    {
      "name": "Tanc Sade",
      "url": "https://www.imdb.com/name/nm1625746/"
    },
    {
      "name": "Patton Oswalt",
      "url": "https://www.imdb.com/name/nm0652663/"
    }
  ],
  "director": [
    {
      "name": "Daniel Waters",
      "url": "https://www.imdb.com/name/nm0914058/"
    }
  ],
  "creator": [
    {
      "name": "Daniel Waters",
      "url": "https://www.imdb.com/name/nm0914058/"
    }
  ]
}