

{
  "type": "Movie",
  "name": "The Little Mermaid: Ariel's Beginning",
  "url": "https://www.imdb.com/tt0969647/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMWViYmRlNmEtM2Q3OS00N2Q5LTg3NTMtZDRlMWExODIxOTc5XkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_.jpg",
  "description": "In the kingdom of Atlantica where music is forbidden, the youngest daughter of King Triton, named Ariel, discovers her love of an underground music club and sets off to a daring adventure to bring restoration of music back to Atlantica.",
  "review": {
    "author": "Michael_Elliott",
    "dateCreated": "2018-09-26",
    "inLanguage": "English",
    "heading": "Decent Sequel",
    "reviewBody": "The Little Mermaid: Ariel's Beginning (2008)\n\n ** 1/2 (out of 4)\n\nThis prequel starts off with Ariel as a child and we get to see what happened to her mother, which leads her father King Triton to ban all music in Atlantica. We then flash-forward to Ariel as a teenager when she learns the power of music and wants to bring it back.\n\nThis third film in the series is certainly a major step up from the second one but then again the second movie was so poor that it wouldn't be that hard to be better. This film here was obviously done on a low-budget and there's no question that the animation is far off from the original movie but, then again, it's at least better than the second film.\n\nOne certainly shouldn't go into this movie expecting some sort of masterpiece but at the same time I thought it was mildly entertaining and worth watching. I thought the highlight of the picture were the characters, which were a lot of fun and that includes the rebellious Ariel. I found her to be quite fun throughout and we also got nice support from King Triton, Flounder and Sebastian. The story itself wasn't all that original but it too was at least entertaining.\n\nThe music wasn't the greatest thing from Disney but the sequences were at least fun. As you can tell, there's really nothing ground-breaking with THE LITTLE MERMAID: ARIEL'S BEGINNING but it's at least mildly entertaining and worth watching once.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 11212,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "G",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2008-08-25",
  "keywords": "prequel, mermaid, king, disney animated sequel, sebastian the crab character",
  "duration": "PT1H17M",
  "actor": [
    {
      "name": "Jodi Benson",
      "url": "https://www.imdb.com/name/nm0072533/"
    },
    {
      "name": "Samuel E. Wright",
      "url": "https://www.imdb.com/name/nm0942787/"
    },
    {
      "name": "Jim Cummings",
      "url": "https://www.imdb.com/name/nm0191906/"
    }
  ],
  "director": [
    {
      "name": "Peggy Holmes",
      "url": "https://www.imdb.com/name/nm0391996/"
    }
  ],
  "creator": [
    {
      "name": "Robert Reece",
      "url": "https://www.imdb.com/name/nm0715257/"
    },
    {
      "name": "Evan Spiliotopoulos",
      "url": "https://www.imdb.com/name/nm0818746/"
    },
    {
      "name": "Jule Selbo",
      "url": "https://www.imdb.com/name/nm0782964/"
    }
  ]
}