

{
  "type": "Movie",
  "name": "The Tracey Fragments",
  "url": "https://www.imdb.com/tt0801526/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTk5NDMzMzI0M15BMl5BanBnXkFtZTcwODYyMjU1MQ@@._V1_.jpg",
  "description": "15-year-old Tracey Berkowitz is naked under a shower curtain at the back of a bus, looking for her little brother Sonny, who thinks he's a dog.",
  "review": {
    "author": "TheGOLDENWALRUS",
    "dateCreated": "2008-07-12",
    "inLanguage": "English",
    "heading": "77 minutes is the perfect length for this experimental film",
    "reviewBody": "Tracey Fragments is a very experimental film. 95% of the film is shot with two or more screens. Sometimes it's even split up as much as 100 screens! Not often do you see a film where there is more art in the editing than anything else in the film. In fact, some of the split screens act as shattered glass which seemed to be the symbolic meaning of the film where a girl's life is pretty much shattered throughout the film.\\n\\nTracey Berkowitz (played by Ellen page) is a fifteen year old girl who thought it would be funny to hypnotize her brother into being a dog. She hates her parents and her school mates. She dreams of starting a rock band with the boy of her dreams, Billy Zero. Very independent, she decides to run away from home to look for her brother. there she has her day from hell.\\n\\nThe first thing I'd like to comment about the film is I thought the script lacked. Ellen Page made this movie watchable but I disliked some of the scenes. In fact, some parts were so ridiculous it almost made me laugh nervously as if they were trying to make the movie corny at times. With that said, I'd have to say that Bruce McDonald did a very good job capturing Tracey with the budget that he had. It's obvious that the film was shot with a hand-held camera but it fit very well with the dark behavior and life that Tracey endured throughout the movie. I also loved the score. I read on one of the message boards for this movie that some replied that they loved and hated this movie. I agree. Some parts were so beautifully captured while some seems completely lacked and didn't fit (once again, the lacking script). The movie is exhausting at times but the last thirty minutes began to pick up again and make the movie interesting.\\n\\nEllen Page is a versatile actress and I like her a lot more when she plays darker roles such as this movie and her best performance to date, Hard Candy. I did love Juno but I like these type of roles more. The most memorial seen in the movie is when she stares her mom down and points her finger in her face while screaming at her. It's almost freaky but so well done.\\n\\nIf you love Ellen Page, this movie and Mouth to Mouth need to be seen with an open mind. 77 minutes of this film could feel like two hours.\\n\\nMy verdict 6.25/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 7668,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6
  },
  "contentRating": "15",
  "genre": [
    "Drama"
  ],
  "datePublished": "2008-02-21",
  "keywords": "dysfunctional family,investigation,missing person investigation,missing persons case,bus",
  "duration": "PT1H17M",
  "actor": [
    {
      "name": "Elliot Page",
      "url": "https://www.imdb.com/name/nm0680983/"
    },
    {
      "name": "Zie Souwand",
      "url": "https://www.imdb.com/name/nm2299669/"
    },
    {
      "name": "Maxwell McCabe-Lokos",
      "url": "https://www.imdb.com/name/nm0199495/"
    }
  ],
  "director": [
    {
      "name": "Bruce McDonald",
      "url": "https://www.imdb.com/name/nm0567680/"
    }
  ],
  "creator": [
    {
      "name": "Maureen Medved",
      "url": "https://www.imdb.com/name/nm2267721/"
    }
  ]
}