

{
  "type": "Movie",
  "name": "Then She Found Me",
  "url": "https://www.imdb.com/tt0455805/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTk4ODYxNTYzOF5BMl5BanBnXkFtZTcwNjMwODg2MQ@@._V1_.jpg",
  "description": "April, 39, wants a baby but her husband leaves her. When her adoptive mother dies, she's contacted by her biological mother, a TV talk show host. April starts seeing the divorced dad of one of her students at school.",
  "review": {
    "author": "rajdoctor",
    "dateCreated": "2008-07-05",
    "inLanguage": "English",
    "heading": "Then She Found Me",
    "reviewBody": "I had like Helen Hunt a lot in - As Good as you get - where she won her best actress Oscar in 1997. So, when I heard that she is directing a movie, that interested me. I saw the trailers, and though they did not immediately attract me, I decided to give this movie a go.\n\nIn her late thirtees, schoolteacher April Epner (Helen Hunt) - seeking to be pregnant and be a biological mother - marries Benjamin (Matthew Broderick), but things do not work out her way and they saperate. April's step mother dies, and she gets traced by her biological mother Bernice (Bette Midler) after 38 years. After that, April meets Frank (Colin Firth) - father of two children; both fall in love. Soon she realizes that she is pregnant with the child of her ex-husband Benjamin. April's is undecisiveness between Benjamin and Frank. In meantime - she mis-carries the child, and after a small triffle with Frank, then she realizes adopting a child and being with Frank. That's how the movie ends.\n\nTen years have passed since Helen won the Oscar. The burden of Oscar always mounts on all those who have won it - they want to do it one more time, and with no strong scripts coming by - they venture into self produced or self directed movies - to showcase their talents - one more Oscar, one more feather of appreciation. Helen's movie as director is such an attempt.\n\nThe movie has a story line that is linear, and the characters are complex - but they are not exciting. All of them have acted well. Helen Hunt is a very sensitive actress and she acts brilliantly even with the twitch of her eyes or lips. Bette Midler always fills in the character that becomes her. Colin Firth has mastered the role of one of the other man in a triangle love story and always delivers good performance. Matthew's role is comparatively small.\n\nI could not understand the motivation of Helen's indecisiveness, and that looked foolish to me. Another thing that distracted me from her performance was her aneroxic physic - at times though she calls herself 39 (at her current age of 44 years) - she looks 49. Is becoming so thin something Hollywood actresses learn to do? If done with purpose, I think, they all look terrible. I think Helen could have taken another actress - and the movie would had been much better.\n\nThe love scenes and kisses are also felt as if 'breakers' in the flow of the movie. Nothing great about editing, cinematography or music - quite okay and normal.\n\nThe movie presents the complexities of middle aged women and their biggest fear of not getting pregnant before time. It also gives a message that 'adopting' a baby is always a good option.\n\nThe movie might be liked by women and those men like me - who can sit through a feminine story, trying to understand the other half and their emotions. I will go with (Stars 5.5 out of 10)",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 10204,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2008-09-19",
  "keywords": "biological clock, wanting a baby, jewish wedding, infidelity, sex in public",
  "duration": "PT1H40M",
  "actor": [
    {
      "name": "Helen Hunt",
      "url": "https://www.imdb.com/name/nm0000166/"
    },
    {
      "name": "Colin Firth",
      "url": "https://www.imdb.com/name/nm0000147/"
    },
    {
      "name": "Bette Midler",
      "url": "https://www.imdb.com/name/nm0000541/"
    }
  ],
  "director": [
    {
      "name": "Helen Hunt",
      "url": "https://www.imdb.com/name/nm0000166/"
    }
  ],
  "creator": [
    {
      "name": "Elinor Lipman",
      "url": "https://www.imdb.com/name/nm1949491/"
    },
    {
      "name": "Alice Arlen",
      "url": "https://www.imdb.com/name/nm0035146/"
    },
    {
      "name": "Victor Levin",
      "url": "https://www.imdb.com/name/nm0505741/"
    }
  ]
}