

{
  "type": "Movie",
  "name": "Heavy Metal 2000",
  "url": "https://www.imdb.com/tt0119273/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTMzMDM0MjI0NV5BMl5BanBnXkFtZTYwODE5MDc5._V1_.jpg",
  "description": "After surviving an invasion on her peaceful homeworld, a beautiful avenger must stop a powerful psychopath from gaining immortality and rescue her kidnapped sister.",
  "review": {
    "author": "kaijuboy",
    "dateCreated": "2000-12-23",
    "inLanguage": "English",
    "heading": "HM2K OK!",
    "reviewBody": "When watching HEAVY METAL 2000, you have to forget the first film. The original HEAVY METAL was ground-breaking in its day. After all, very few animators ever tried directing animation towards adults (only Ralph Bakshi comes to mind)in the U.S.. Add to this the fact that the original HEAVY METAL was unavailable for nearly 20 years and you have a true cult classic. It is unfair to compare them.\\n\\nOn its own, HEAVY METAL 2000 is ok, neither good or bad. The animation is average and the story has very little in the way of originality. The voice acting is good, but at times over-the-top. Julie Strain, however, does a very good job voice acting. The film is very predictable and none of the characters are interesting. The background art is excellent.\\n\\nThe music is provided by various heavy metal bands, but little of it fits in the film. The score to the film, however, is better than you would expect.\\n\\nThis film has very little nudity and essentially no sex. What nudity it has is pretty bland. Admit it, you picked up this film looking for illustrated nudity. Well, you won&apos;t find much.\\n\\nSince the original film, anime has made its presence known in the U.S.. Frankly, GHOST IN THE SHELL has more in common with HEAVY METAL (the magazine) than HEAVY METAL 2000 does.\\n\\nThe most serious problems with HEAVY METAL 2000 happened before the film was started. While I credit Kevin Eastman with getting this project going, I believe he lacked the experience to make a movie. If the film had the backing of an experienced producer, the film may have benefited. If Eastman ever considers another HEAVY METAL film, perhaps he should look to Japan for animators.\\n\\nI&apos;ve watched this film many times. Why?! Well for one thing, we just don&apos;t have very many animated films made in America that are directed to adults. There&apos;s a whole group of animation fans that are waiting for a HEAVY METAL film that rocks. Hopefully our wishes will be fulfilled.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 9239,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.4
  },
  "contentRating": "18",
  "genre": [
    "Animation",
    "Action",
    "Adventure"
  ],
  "datePublished": "2000-05-04",
  "keywords": "revenge,female warrior,brutality,adult animation,based on comic book",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Michael Ironside",
      "url": "https://www.imdb.com/name/nm0000461/"
    },
    {
      "name": "Julie Strain",
      "url": "https://www.imdb.com/name/nm0001781/"
    },
    {
      "name": "Billy Idol",
      "url": "https://www.imdb.com/name/nm0002150/"
    }
  ],
  "director": [
    {
      "name": "Michael Coldewey",
      "url": "https://www.imdb.com/name/nm0170402/"
    },
    {
      "name": "Michel Lemire",
      "url": "https://www.imdb.com/name/nm0501341/"
    }
  ],
  "creator": [
    {
      "name": "Kevin Eastman",
      "url": "https://www.imdb.com/name/nm0247653/"
    },
    {
      "name": "Simon Bisley",
      "url": "https://www.imdb.com/name/nm0084253/"
    },
    {
      "name": "Eric Talbot",
      "url": "https://www.imdb.com/name/nm0847905/"
    }
  ]
}