

{
  "type": "Movie",
  "name": "Nurse Betty",
  "url": "https://www.imdb.com/tt0171580/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYjU2OGVhYjgtYWE3Zi00MzM5LWEwYjgtYjQxNzkxNzhhZGFjXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
  "description": "Comedy about a widow&apos;s post-traumatic obsession with a soap star.",
  "review": {
    "author": "FlorisV",
    "dateCreated": "2003-08-29",
    "inLanguage": "English",
    "heading": "Unique, inconsistent but great",
    "reviewBody": "There&apos;s much to enjoy here if you like movies because of the actors. I was attracted to this film because of Morgan Freeman and Chris Rock who always deliver, but there&apos;s also great acting from the rest of the cast, most notably Zellweger but Kinnear is also perfectly casted as is the rest, no exceptions. All a joy to watch.\\n\\nAnd then there&apos;s the offbeat plot with a woman living in a fantasy of being a soap character that takes over her life and makes her forget that she was just a waitress in Kansas with a cheating husband who got killed in front of her eyes by hitmen. Sometimes I thought the movie was thrown way off balance with the sudden bloodshed but most of the time it was a very warm film. It was the wonderful, strange mixture between cold reality and movielike fantasy that made it interesting. It&apos;s good for a couple of dosed laughs but I would classify this as a tragic comedy with a relatively happy and satisfying ending, tho it may be cheap to some. Funny thing is, as life can be stranger than film, all in the movie could in theory happen! And the focus is still very much on human emotions so in that way the movie is still down to earth.\\n\\nBetter than I expected, this film rules, can&apos;t get enough of Morgan or Chris but really everybody did a great job making this film.\\n\\n 8 out of 10",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 36104,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "18",
  "genre": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "datePublished": "2000-09-01",
  "keywords": "soap opera,soap opera actor,fictional soap opera,soap opera star,police officer",
  "duration": "PT1H50M",
  "actor": [
    {
      "name": "Ren\\u00e9e Zellweger",
      "url": "https://www.imdb.com/name/nm0000250/"
    },
    {
      "name": "Morgan Freeman",
      "url": "https://www.imdb.com/name/nm0000151/"
    },
    {
      "name": "Chris Rock",
      "url": "https://www.imdb.com/name/nm0001674/"
    }
  ],
  "director": [
    {
      "name": "Neil LaBute",
      "url": "https://www.imdb.com/name/nm0001438/"
    }
  ],
  "creator": [
    {
      "name": "John C. Richards",
      "url": "https://www.imdb.com/name/nm0724167/"
    },
    {
      "name": "James Flamberg",
      "url": "https://www.imdb.com/name/nm0280963/"
    }
  ]
}