

{
  "type": "Movie",
  "name": "Bone Tomahawk",
  "url": "https://www.imdb.com/tt2494362/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMzQ0MzE4OTUzMF5BMl5BanBnXkFtZTgwODAyNzI3NjE@._V1_.jpg",
  "description": "In the dying days of the old west, an elderly sheriff and his posse set out to rescue their town's doctor from cannibalistic cave dwellers.",
  "review": {
    "author": "gogoschka-1",
    "dateCreated": "2015-10-24",
    "inLanguage": "English",
    "heading": "An almost classic Western with a fantastic cast, great dialog and gruesome horror elements",
    "reviewBody": "This film is a rather special genre-mix of classic Western themes and gory, insane B-movie horror elements. Films like the quite watchable The Burrowers (2008) and Dead Birds (2004) have mixed those ingredients before with some success, but while those two were undoubtedly B-movies, Bone Tomahawk never feels like your typical straight to VOD genre film.\\n\\nWhat really stands out right from the start is the writing: the precise dialog and never less than interesting characters are what really makes this film a winner in my book. The premise might not be very original - it's Western to the bone (pun intended) and very much in the tradition of great classics like The Searchers - but despite its dark themes, there is so much understated humour in Bone Tomahawk that I felt at times reminded of some of the characters in Jim Jarmusch's films. And Richard Jenkins' character, back-up deputy Chicory, is down-right hilarious. The acclaimed (and Oscar-nominated) actor clearly has a blast with his part, and the same can absolutely be said for the rest of the cast. This is a film that is willing to spend a very considerable part of its running time just building atmosphere and exploring the different characters, and the action/horror moments are actually few and far between. According to some recent interviews with the producers, the excellently written characters are also what drew A-list actors Kurt Russell and Patrick Wilson to the film, despite its micro-budget, and if Russell hadn't been so committed to playing the part of Sheriff Franklin Hunt, the film wouldn't have been made.\\n\\nIn spite of its tiny budget, this is a quality film that really should have had a wide theatrical release; everything from the A-list cast to the excellent cinematography, sound and production design practically scream for the big screen. A word to the wise, though; after some initial mayhem, the film moves along at a very considerate pace (and at over two hours it's a rather long film), so for those who seek entertainment heavy on action with non-stop shoot-outs, gory thrills and scares, look elsewhere: this is probably not the film for you (and perhaps also not the film that was promised in the trailers). But if you like old-school Westerns with great characters (played by great character actors), great atmosphere and deadpan humour, and you ALSO don't mind (very!) gory thrills, scares and some bloody shoot-outs along the way, I believe you will enjoy this film very much. I know I did: 7.5 stars out of 10.\\n\\nLesser-Known Masterpieces: http://www.imdb.com/list/ls070242495/\\n\\nFavorite Low-Budget And B-Movies: http://www.imdb.com/list/ls054808375/\\n\\nAll-Time Favorite Films: http://www.IMDb.com/list/mkjOKvqlSBs/",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 116456,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "18",
  "genre": [
    "Drama",
    "Horror",
    "Western"
  ],
  "datePublished": "2016-02-19",
  "keywords": "rescue,ambush,wilderness,native american,scalping",
  "duration": "PT2H12M",
  "actor": [
    {
      "name": "Kurt Russell",
      "url": "https://www.imdb.com/name/nm0000621/"
    },
    {
      "name": "Patrick Wilson",
      "url": "https://www.imdb.com/name/nm0933940/"
    },
    {
      "name": "Matthew Fox",
      "url": "https://www.imdb.com/name/nm0289142/"
    }
  ],
  "director": [
    {
      "name": "S. Craig Zahler",
      "url": "https://www.imdb.com/name/nm0951975/"
    }
  ],
  "creator": [
    {
      "name": "S. Craig Zahler",
      "url": "https://www.imdb.com/name/nm0951975/"
    }
  ]
}