

{
  "type": "Movie",
  "name": "Freaks of Nature",
  "url": "https://www.imdb.com/tt1817771/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjExMzY3NzI5N15BMl5BanBnXkFtZTgwMTg5MzYxNzE@._V1_.jpg",
  "description": "In the town of Dillford, humans, vampires and zombies were all living in peace - until the alien apocalypse arrived. Now three teenagers - one human, one vampire, and one zombie - have to team up to figure out how to get rid of the aliens and restore peace to their town.",
  "review": {
    "author": "trashgang",
    "dateCreated": "2016-10-03",
    "inLanguage": "English",
    "heading": "Great Effects and Great Acting by Josh Fadem",
    "reviewBody": "This really is a freak show with its flaws. I mean, sometimes it's funny especially with the zombies. Just look at the conversation at the end between Ned and his father. There are parts that are a bit boring with long conversations that don't really add anything and aren't funny. On the other hand, we do have gory parts when the vampires do come in.\\n\\nWas it a funny movie? For me, not really. It does have funny moments as I said but again, the gore adds towards the fun, just look how a tough guy is eaten by zombies. And look how vampires explode in full bloom when staked. \\n\\nThis flick does deliver on the part of the effects. The zombies all look stunning and the aliens look great as does their mothership. A big hooray for the effects. It sure is above mediocre overall and it's the acting of the zombie Ned by Josh Fadem that makes it worth seeing. \\n\\nLike the story, which is full of freaks and good and bad parts, I'm stuck with mixed emotions. Still, I will recommend it because it does have something for everyone out there, if you're a horror buff of course.\\n\\nGore 1.5/5 Nudity 0/5 Effects 3/5 Story 2.5/5 Comedy 2/5",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 13274,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Horror",
    "Sci-Fi"
  ],
  "datePublished": null,
  "keywords": "female rear nudity, bare chested male, vampire, apocalypse, zombie",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Nicholas Braun",
      "url": "https://www.imdb.com/name/nm1002609/"
    },
    {
      "name": "Mackenzie Davis",
      "url": "https://www.imdb.com/name/nm4496875/"
    },
    {
      "name": "Josh Fadem",
      "url": "https://www.imdb.com/name/nm1758915/"
    }
  ],
  "director": [
    {
      "name": "Robbie Pickering",
      "url": "https://www.imdb.com/name/nm0681852/"
    }
  ],
  "creator": [
    {
      "name": "Oren Uziel",
      "url": "https://www.imdb.com/name/nm3349927/"
    }
  ]
}