

{
  "type": "Movie",
  "name": "Jem and the Holograms",
  "url": "https://www.imdb.com/tt3614530/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjIxMDI1MTI2M15BMl5BanBnXkFtZTgwODYzODc2NTE@._V1_.jpg",
  "description": "As a small-town girl catapults from underground video sensation to global superstar, she and her three sisters begin a journey of discovering that some talents are too special to keep hidden.",
  "contentRating": "PG",
  "genre": [
    "Adventure",
    "Drama",
    "Family"
  ],
  "datePublished": "2016-02-12",
  "keywords": "sister sister relationship, record company, band, based on toy, based on cartoon",
  "duration": "PT1H58M",
  "rating": {
    "ratingCount": 8277,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.2
  },
  "review": {
    "author": "blades_n_stone",
    "dateCreated": "2015-10-26",
    "inLanguage": "English",
    "heading": "Not Jem. No holigrams.",
    "reviewBody": "Dear Hollywood. This is how to do it wrong. Take a much loved nostalgia item and childhood institution like Jem, Ignore the source material, alienate the true fan base, Fail to advertise to the tween girl fan base and fail to mention its a family movie suitable for moms and daughters. I hate this movie. Because it is not what it claims to be. Jem and the Holograms. This is Hanna Montana with a be yourself and love your friends final moral. \\n\\nAdvertised as a re imagining(under a different Title) and presented to moms and daughters as a good family movie it could have done well. It is a touching and well told story, The acting is good and the plot is OK. But It is Not Jem. It was not well advertised and Kids now Don&apos;t know or care who Jem was. This was a film for 30+ year olds who grew up with it. And had we been given what we remembered we would have rewarded the studio with our money. But it was made for 14 year olds who have seen the same thing before as Hanna Montana. \\n\\nSo ends the one shot we will get at a Jem movie. A badly presented/advertised fraud that was a good family movie and had its potential ignored.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 2
    }
  },
  "rating": {
    "ratingCount": 8277,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.2
  },
  "actor": [
    {
      "name": "Aubrey Shea",
      "url": "https://www.imdb.com/name/nm2874427/"
    },
    {
      "name": "Stefanie Scott",
      "url": "https://www.imdb.com/name/nm2640887/"
    },
    {
      "name": "Aurora Perrineau",
      "url": "https://www.imdb.com/name/nm4563780/"
    }
  ],
  "director": [
    {
      "name": "Jon M. Chu",
      "url": "https://www.imdb.com/name/nm0160840/"
    }
  ],
  "creator": [
    {
      "name": "Ryan Landels",
      "url": "https://www.imdb.com/name/nm1293285/"
    }
  ]
}