

{
  "type": "Movie",
  "name": "Paper Towns",
  "url": "https://www.imdb.com/tt3622592/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjE2ODQxODMwOF5BMl5BanBnXkFtZTgwNDY5NjY3NDE@._V1_.jpg",
  "description": "After an all-night adventure, Quentin's lifelong crush, Margo, disappears, leaving behind clues that Quentin and his friends follow on the journey of a lifetime.",
  "review": {
    "author": "stephendaxter",
    "dateCreated": "2015-10-06",
    "inLanguage": "English",
    "heading": "Fantastic first act but only downhill from there",
    "reviewBody": "Paper Towns is another coming-of-age story about Quentin and his neighbour Margo and how here mysterious disappearance sends Quentin on a journey to find her through clues she left behind for him. Now i love a good coming-of-age story, so when one is done right and is new and interesting it will probably be something i choose to watch more than once. Unfortunately this will not be one i am eager to re-watch but it is still a good, strong attempt at one of these films but it seems to get lost a few times along the way in terms of its storytelling. I'll start with the characters and performances, because i feel they were definitely the best parts of the film and added so much to making the film pretty enjoyable. Nat Wolff was great at playing Quentin, a shy awkward guy who had a signs of a lot of personality but needed the right people to bring it out. You really get to connect with his character as they made him come across as very real and not like a character per se. I may say that often but there are so many young actors really showing off their best stuff in these smaller personal films. Cara Delevingne was also great as Margo who was also quite odd and mysterious but was also very out there and confident at the same time, a great contrast to Nat's character. The rest of the supporting cast were also well acted, their distinct personalities were at times used for some cheap comedic relief but also had a greater purpose in adding to the complexity of our main character.\\n\\nThe first act of this film is really where the film gets to shine. You get the introduction to these characters (Quentin and Margo) and get to see their relationship and how it has changed and affected both these characters in the lead up to the events in the film. Watching them interact and bond was fascinating and charming at times and was a really good lead up into the events of the second act and understanding their actions. It was fun, light-hearted and was setting itself up for something great. All of the events so far had a fluid lead in to the second act which became more of a mysterious adventure whilst still trying to maintain that fun element somewhat unsuccessfully. The events of the first act are what get you through the very long second act that could have been cut down like 20 minutes. The second act was more focused on building up Quentin's character and having him face some tough and new decisions in his life. Although it was interesting and you do want to see where his character goes it was a noticeable step down from the fun light-hearted enjoyment in the beginning. There was this great interesting relationship set up and you are eager to find out how the film ties everything together, then you reach the third act and all of the storytelling falls apart. \\n\\nFor certain characters, their actions and reactions seem somewhat justified but for some others they just felt like another character entirely. There was nothing in the second act that really explained how or why these characters made such a drastic change in reasoning or personality. They try to explain it in the dying minutes but it was very rushed and didn't fit with the rest of the film. The problem was that there was no real progression from the events of the beginning to the events in the end for some characters and that led me to believe that the writers/directors knew how to approach certain sections but were completely lost for others. I believe, they knew how they wanted the film to begin and how to introduce these characters, and they also knew how they wanted it to end and what themes they wanted to explore. But what they didn't know was how to show that transition, and when a film has the beginning, and has the end it can be hard to fill in the guts of the film afterwards and show a distinct character progression. That's just my theory but whatever happened the storytelling was a bit of a mess. \\n\\nThat being said, it was still a good enjoyable film that tried too hard to be different or maybe not hard enough. It had great characters and performances, a fantastic first act, an interesting second act and a third act that didn't live up to what the rest of the film was building up to. Humour didn't really work that often but kept the film from becoming too dark, and there were signs of emotion but nothing that really affects you. In the end, it's enjoyable but there are better coming-of-age films out there (Boyhood / Me and Earl and the Dying Girl). - 6.3",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 107526,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.2
  },
  "contentRating": "12A",
  "genre": [
    "Adventure",
    "Comedy",
    "Drama"
  ],
  "datePublished": "2015-08-17",
  "keywords": "based on novel,travel,teenage girl,unrequited love,friendship",
  "duration": "PT1H49M",
  "actor": [
    {
      "name": "Nat Wolff",
      "url": "https://www.imdb.com/name/nm1822659/"
    },
    {
      "name": "Cara Delevingne",
      "url": "https://www.imdb.com/name/nm5353321/"
    },
    {
      "name": "Austin Abrams",
      "url": "https://www.imdb.com/name/nm3641002/"
    }
  ],
  "director": [
    {
      "name": "Jake Schreier",
      "url": "https://www.imdb.com/name/nm1500577/"
    }
  ],
  "creator": [
    {
      "name": "Scott Neustadter",
      "url": "https://www.imdb.com/name/nm2354099/"
    },
    {
      "name": "Michael H. Weber",
      "url": "https://www.imdb.com/name/nm2352210/"
    },
    {
      "name": "John Green",
      "url": "https://www.imdb.com/name/nm1981261/"
    }
  ]
}