

{
  "type": "Movie",
  "name": "Serena",
  "url": "https://www.imdb.com/tt1247690/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTExMDY2OTYxMTNeQTJeQWpwZ15BbWU4MDc2NDE5MTQx._V1_.jpg",
  "description": "In Depression-era North Carolina, the future of George Pemberton's timber empire becomes complicated when he marries Serena.",
  "review": {
    "author": "billygoat1071",
    "dateCreated": "2015-03-06",
    "inLanguage": "English",
    "heading": "Astounding Downfall",
    "reviewBody": "Whatever resulted Serena can be enigmatic. Visually, the movie has a lot of beautiful shots. There's also great talents among the cast. The story seems like it is meant for a powerful tragedy, but these assets however lead to a rather dreary, unfocused drama, that doesn't quite live up to its ambition. Even with the looks of a grand and dazzling piece of cinema, the film doesn't come close with that worth. And it's a truly frustrating thing to look at a movie with such strong potential become a strange mess.\\n\\nThe story is basically an old fashioned American drama about a man, who manages a timber industry, oppresses his ambition that leads to numerous unfortunate events. The core here is a love story in which its romance is often nonexistent, we hardly get to see how they fully develop their relationship. But there is still an interesting growth within these rich details. But the movie is too scattered with various subplots that each takes over the entirety. There is too many conflicts, like they are mostly separated into a whole new different story, unable to say a single or definite point. The third act becomes a weird flood of consequences that doesn't necessarily gain any deserving depth.\\n\\nThere is so much going on with the story, the film also manages to shift it into several tones. It goes to art-house calmness, a showy drama, and then even has a preposterous climax. The worst of it indeed never fits in to its stunning production values. The film seems to be too reliant on what it has. It has captivating cinematography, impressive production, and even the actors are just doing what they believe they can do to make this movie work. Jennifer Lawrence and Bradley Cooper are the main attraction here, while they try to bring something to the table, the movie remains to be dreary for not letting the two have an actual engaging moment together. The pacing is reasonably slow, but sometimes it becomes an obligation than another moment to thoughtfully breathe.\\n\\nSerena is a pretty strange film to encounter, one that has its best potentials fall apart into a surprisingly dull cinema. It's still fascinating to see what it has: great cast, striking images, richly defined context, and gripping drama (if only it has more time to actually develop them), but it really doesn't have an exact intention. And the story keeps on going, still failing to be actually engaging. This is an obvious lesson about creating cinematic drama, when things needed real definition on what's going on and who the characters are, than just throwing them away with stuff that could gloss over its half- baked narrative. Even the presence of the ever appealing Jennifer Lawrence and Bradley Cooper couldn't overlook the entire film's unimaginable flaws.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 30322,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.4
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "History",
    "Romance"
  ],
  "datePublished": "2014-10-24",
  "keywords": "timber camp,the future,axe accident,logging baron,timbering accident",
  "duration": "PT1H49M",
  "actor": [
    {
      "name": "Bradley Cooper",
      "url": "https://www.imdb.com/name/nm0177896/"
    },
    {
      "name": "Jennifer Lawrence",
      "url": "https://www.imdb.com/name/nm2225369/"
    },
    {
      "name": "Rhys Ifans",
      "url": "https://www.imdb.com/name/nm0406975/"
    }
  ],
  "director": [
    {
      "name": "Susanne Bier",
      "url": "https://www.imdb.com/name/nm0081540/"
    }
  ],
  "creator": [
    {
      "name": "Christopher Kyle",
      "url": "https://www.imdb.com/name/nm0477370/"
    },
    {
      "name": "Ron Rash",
      "url": "https://www.imdb.com/name/nm3047390/"
    }
  ]
}