

{
  "type": "Movie",
  "name": "Ted 2",
  "url": "https://www.imdb.com/tt2637276/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNTFiNzA0NWMtZmUxZS00ZmUxLTgxZmItZDIyMThjN2JhZGE3XkEyXkFqcGdeQXVyNjc5NjEzNA@@._V1_.jpg",
  "description": "Newlywed couple Ted and Tami-Lynn want to have a baby, but in order to qualify to be a parent, Ted will have to prove he's a person in a court of law.",
  "review": {
    "author": "kieranbattams",
    "dateCreated": "2015-07-09",
    "inLanguage": "English",
    "heading": "Raises way more questions about human rights than any Seth Macfarlane production should, and that's not a bad thing...",
    "reviewBody": "In 2012 when Seth Macfarlane's directorial debut was released, I, like many other people enjoyed it a lot. It was a basic film about a man and his senile teddy bear who would just smoke weed, swear a lot and hang out. That premise was enough to get us on board and it worked for a one off feature film. After the box office success it received a sequel was inevitable.. but how could a film with such a premise possibly do anything more to become a franchise? Well not only does Ted 2 ramp up the laughs, it also gives us a surprisingly strong plot and pulls it off well.\\n\\nThe basic premise is that Ted has married Tammi-Lynn from the first film, whereas John has divorced Lori. Following some marital problems, Ted decides to save his marriage with a baby, but in order to do this he has to prove that he is a person and not just property in the eyes of the law. Enter Sam L. Jackson (Amanda Seyfried) and yes as you would expect there are many references to the Hollywood star. I knew Mila Kunis was not coming back for this film and after her performance in the lacklustre 'A million ways to die in the West' i was not expecting Seyfried to be a good replacement, but she fits in with the cast very well. Just like the first film the chemistry between John (Mark Wahlberg) and Ted (Seth Macfarlane) is what makes the comedy work so well, you really believe you are watching two real life friends hang out, rather than Mark Wahlberg and a CGI teddy bear. The plot wasn't what made the first so enjoyable, it was their bond. Amanda Seyfried fits in with these two so well and as a trio they really mesh well together. She brings a lot of laughs to the table and I actually liked her character more than Mila Kunis'. \\n\\nWhilst the plot is very good and holds up, the third act takes a bit of a plunge and almost copies the last act of the first film completely. Giovanni Risbi reprises his role as Donny and does exactly what he did originally, just for a slightly different reason. The film could have done without this to focus more on the human elements, even though it was hilarious to see Ninja turtle Raphael dance to 'I think we're alone now'. It almost felt like filler to make a longer movie. The small road trip segment to me was great, we got spoofs of both Planes, Trains and Automobiles and a great Jurassic Park spoof in the space of a couple of minutes. In fact the pop culture references from Rocky to Flash Gordon (Sam J Jones returns) were pretty great. I also loved the courtroom scenes, and even Morgan Freeman in an extended cameo provided us with a very good look at what human rights are all about.\\n\\nWhat i wanted from this film was to laugh, which i did, a lot more than i expected to as well which is a bonus. Look out for a hysterical cameo from Liam Neeson. The 'is Ted a human' storyline felt like a bold and wonderful step forward and brings up way more questions about human rights than any Seth Macfarlane production should.. but not in a bad way at all. It focuses a lot less on the drugs and crude jokes, even though they are very much still there! But the way it was executed was just great. I wish the third act had stuck with it, but by the end if you are a fan of Seth Macfarlane's work such as Family Guy you will come out satisfied after plenty of laughs and a surprising amount of heart. Will we get a Ted 3? Most likely, but if it keeps up what Ted 2 did right then i just might be okay with that.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 231240,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "15",
  "genre": [
    "Comedy"
  ],
  "datePublished": "2015-07-08",
  "keywords": "lawyer,fight,scene after end credits,trial,talking teddy bear",
  "duration": "PT1H55M",
  "actor": [
    {
      "name": "Mark Wahlberg",
      "url": "https://www.imdb.com/name/nm0000242/"
    },
    {
      "name": "Seth MacFarlane",
      "url": "https://www.imdb.com/name/nm0532235/"
    },
    {
      "name": "Amanda Seyfried",
      "url": "https://www.imdb.com/name/nm1086543/"
    }
  ],
  "director": [
    {
      "name": "Seth MacFarlane",
      "url": "https://www.imdb.com/name/nm0532235/"
    }
  ],
  "creator": [
    {
      "name": "Seth MacFarlane",
      "url": "https://www.imdb.com/name/nm0532235/"
    },
    {
      "name": "Alec Sulkin",
      "url": "https://www.imdb.com/name/nm1273148/"
    },
    {
      "name": "Wellesley Wild",
      "url": "https://www.imdb.com/name/nm1273397/"
    }
  ]
}