

{
  "type": "Movie",
  "name": "Transformers: Revenge of the Fallen",
  "url": "https://www.imdb.com/tt1055369/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNjk4OTczOTk0NF5BMl5BanBnXkFtZTcwNjQ0NzMzMw@@._V1_.jpg",
  "description": "Sam Witwicky leaves the Autobots behind for a normal life. But when his mind is filled with cryptic symbols, the Decepticons target him and he is dragged back into the Transformers' war.",
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2009-06-19",
  "keywords": "evil robot, male soldier, weapons fire, helicopter gunship, helicopter crash",
  "duration": "PT2H29M",
  "actor": [
    {
      "name": "Shia LaBeouf",
      "url": "https://www.imdb.com/name/nm0479471/"
    },
    {
      "name": "Megan Fox",
      "url": "https://www.imdb.com/name/nm1083271/"
    },
    {
      "name": "Josh Duhamel",
      "url": "https://www.imdb.com/name/nm0241049/"
    }
  ],
  "director": [
    {
      "name": "Michael Bay",
      "url": "https://www.imdb.com/name/nm0000881/"
    }
  ],
  "creator": [
    {
      "name": "Ehren Kruger",
      "url": "https://www.imdb.com/name/nm0472567/"
    },
    {
      "name": "Roberto Orci",
      "url": "https://www.imdb.com/name/nm0649460/"
    },
    {
      "name": "Alex Kurtzman",
      "url": "https://www.imdb.com/name/nm0476064/"
    }
  ],
  "review": {
    "author": "maxglen",
    "dateCreated": "2020-08-18",
    "inLanguage": "English",
    "heading": "Amps up the action at the cost of almost everything else.",
    "reviewBody": "I'll start by saying this film has FANTASTIC action sequences, better than the first even. Problem is, everything that made the first film so decent is basically gone here. The story is extremely formulaic and not really gripping in any way. Useless scenes and subplots are sprinkled throughout, especially during the college portions of the film. Shia does a good job as Sam once again but the rest of the original cast are either sidelined or written so badly you don't really care about them anymore. Megan Fox is especially exploited in this film, similar to the first Transformers but much more sleazily. Speaking of sleaze, the edgy humour of the first has carried over but where in that film it was fun, it has been toned up to borderline vulgarity. This film also adds quite a few new characters, some are cool, most are annoying and a handful are blatantly offensive. I'd give this film a 4 but the action really is worth a couple points. It's more of the first film but better, it's just a shame it's in a less consistent package than the first movie. Strong 5 to a light 6 from me.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 426009,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6
  }
}