{
  "type": "Movie",
  "name": "A Good Person",
  "url": "https://www.imdb.com/tt14153080/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzBkZGYyM2QtNzgwYy00NmZjLTk2ZTItYzY3ZTdjY2M0YmQwXkEyXkFqcGdeQXVyMjkwOTAyMDU@._V1_.jpg",
  "description": "Follows Allison, whose life falls apart following her involvement in a fatal accident.",
  "review": {
    "author": "parksiet",
    "dateCreated": "2023-04-04",
    "inLanguage": "English",
    "heading": "A Good Movie",
    "reviewBody": "Florence Pugh is going to need to start bringing a chiropractor with her to set because A Good Person is yet another example of a film where Pugh&apos;s performance carries the entire film. In the case of Don&apos;t Worry Darling, she made an average film watchable, however, in the case of A Good Person, she takes a good, solid film and takes it to the next level. A Good Person is a great movie - it just so happens that its best element, its strongest strength is Pugh herself. Pugh&apos;s excellence in roles is becoming a trend, I can&apos;t remember a movie from her career where she wasn&apos;t the standout. She showcases time and time again why she is one of the best actresses working right now, and it is especially noticeable in this film. In moments where the script is lacking, or another actor might not be doing enough, Pugh&apos;s performance completely covers it up. Frankly, I am stunned by her skills as an actress, especially in how she can sell nearly any scene with ease. The movie on its own is good, but it is Pugh&apos;s complex and nuanced performance that makes it a great movie.\n\nA Good Person left me on the verge of tears for most of its runtime. Go in expecting yourself to cry at one point or another. I cried, I laughed, and then I cried again. It tells quite a moving story, working through themes of tragedy and addiction. The story overall is quite simple as it really is nothing we haven&apos;t seen before, but the movie finds its strength in its portrayal of its themes. It&apos;s a raw, honest, human story about two battered and bruised souls whose fates are intertwined trying to find some solace in their lives. Two good people who have been broken by their addictions, by life. The film hits you where it hurts while also reminding you what a gift it is to be alive and have other, good people in our lives, despite all the bad things. Now, let&apos;s be real. The subject matter has all been covered before, it&apos;s nothing revolutionary. We really have seen everything before, and perhaps in better ways. The movie is too long, it drags in some places and overall nears becoming a tonal mess in some places.\n\nDespite this, writer/director Zach Braff managed to truly craft an effective, emotional, and moving film. It purely is a good film. Part of the reason it doesn&apos;t become a rambling mess is that Pugh and Freeman are so damn good. Frankly, this movie is an excellent example of why casting matters. Without these two, I don&apos;t know that this movie would have been as good as it was. It probably would have been fine, but their presence 100% elevated the film in so many ways.\n\nA Good Person is a good movie. You know the type: the kind that you come out of just feeling good. It may not be the most refined or revolutionary film, but it is good. It works. It had everything I wanted from it plus some phenomenal performances. It reminds me of the tone of shows I am loving right now: Ted Lasso and Shrinking. Sure, this movie might be a little darker than those, but they still are all from the same vein. Mental health, grief, and addiction. This one takes less of a comedy-drama approach and more of a dramatic approach, but it sure does work. It&apos;s sad but so worth watching, if only for Florence Pugh&apos;s amazing performance!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 19174,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "15",
  "genre": [
    "Drama"
  ],
  "datePublished": "2023-03-24",
  "keywords": "life,father,mother,friendship,accident",
  "duration": "PT2H8M",
  "actor": [
    {
      "name": "Florence Pugh",
      "url": "https://www.imdb.com/name/nm6073955/"
    },
    {
      "name": "Morgan Freeman",
      "url": "https://www.imdb.com/name/nm0000151/"
    },
    {
      "name": "Celeste O&apos;Connor",
      "url": "https://www.imdb.com/name/nm9305936/"
    }
  ],
  "director": [
    {
      "name": "Zach Braff",
      "url": "https://www.imdb.com/name/nm0103785/"
    }
  ],
  "creator": [
    {
      "name": "Zach Braff",
      "url": "https://www.imdb.com/name/nm0103785/"
    }
  ]
}