{
  "type": "Movie",
  "name": "About My Father",
  "url": "https://www.imdb.com/tt8373206/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZTUwYmYwMzUtYmIyZS00OWM3LWE3MWEtM2NjYTk0NzhiM2NmXkEyXkFqcGdeQXVyNDAyNjg5MzY@._V1_.jpg",
  "description": "When Sebastian tells his old-school Italian immigrant father Salvo that he is going to propose to his all-American girlfriend, Salvo insists on crashing a weekend with her tony parents.",
  "review": {
    "author": "beverlyanne-30439",
    "dateCreated": "2023-06-05",
    "inLanguage": "English",
    "heading": "I Love You Sebastian, But....",
    "reviewBody": "I will preface my comments by saying that I&apos;m a huge fan of Sebastian Maniscalco. I think he&apos;s a brilliant comedian and I admire his devotion to his family.\n\nEver since I discovered him several years ago, seeing him in concert has been on my bucket list. I was thrilled to finally have my wish come true last year, when he performed in Toronto. It coincided with my 65th birthday and it was the perfect gift for this newly-minted senior!\n\nNow to About My Father. Sorry to say that it missed the mark in so many ways. First, Sebastian is way too old for the role. I had a hard time processing a 49-year-old man who had never married so eager to impress his in-laws. Not at all believable. The role would have been more suited to a much younger man in his 20s or 30s.\n\nLeslie Bibb, who played Sebastian&apos;s fiance was way too perky, to the point of being annoying. I just wanted to slap her.\n\nThere were some mildly humorous parts, but not nearly enough. I get that this film was an homage to Sebastian&apos;s father, but I quickly tired of the sappy sentimentality. The voice-over narrative throughout was distracting and boring.\n\nThe only saving grace was DiNiro&apos;s performance. He was perfectly cast as an Italian-American dad. He did have some good lines which made me giggle, but again these were few and far between.\n\nI admire Sebastian for attempting a feature film, but I think he should stick to stand-up or TV. I do wish him all the best in wherever his career takes him.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 11072,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "PG-13",
  "genre": [
    "Comedy"
  ],
  "datePublished": "2023-05-26",
  "keywords": "actor playing himself,three word title,father son relationship,hair dresser,cultural clash",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Robert De Niro",
      "url": "https://www.imdb.com/name/nm0000134/"
    },
    {
      "name": "Sebastian Maniscalco",
      "url": "https://www.imdb.com/name/nm1724319/"
    },
    {
      "name": "Leslie Bibb",
      "url": "https://www.imdb.com/name/nm0004753/"
    }
  ],
  "director": [
    {
      "name": "Laura Terruso",
      "url": "https://www.imdb.com/name/nm2884474/"
    }
  ],
  "creator": [
    {
      "name": "Austen Earl",
      "url": "https://www.imdb.com/name/nm1969639/"
    },
    {
      "name": "Sebastian Maniscalco",
      "url": "https://www.imdb.com/name/nm1724319/"
    }
  ]
}