{
  "type": "Movie",
  "name": "Craving",
  "url": "https://www.imdb.com/tt17069062/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjk4MmJjNTEtN2E5Ni00Mjg2LTk1MjEtZGNjMTk5MzliMDg0XkEyXkFqcGdeQXVyODc2MjA4Mg@@._V1_.jpg",
  "description": "A group of drug addicts are besieged by a group of mysterious figures inside a rural bar. As withdrawal starts to set in, a secret one of them is carrying threatens to destroy them all.",
  "review": {
    "author": "DanTheButler",
    "dateCreated": "2023-06-02",
    "inLanguage": "English",
    "heading": "Impressive gore and de-aging effects",
    "reviewBody": "Been following Horton&apos;s filmmaking channel and groups online for some time so naturally when he announced this movie just came out on Tubi, I quickly moved it to the front of my queue. (I secretly would&apos;ve like to have driven a couple hours to be at the Los Angeles premiere but it was on a weeknight)\n\nThe movie was about what I expected, though the trailer hints it&apos;s not perfect, I did want to like it more than I did. As with most indie films, you get some good stuff and other parts not so much.\n\nWhat I liked the most out of this movie was the campaign to push it, with excellent marketing materials and artwork. The film itself used de-aging technology for flashbacks that really helped a lot with the continuity of the characters; you didn&apos;t have to guess who was who. But if anything they were aged too much in the present since the flash backs are around 15 years ago and they look significantly younger (less than half their age).\n\nI&apos;m not a huge fan on gore, but I do appreciate it when it has purpose. There&apos;s a little too much here for my taste, but I&apos;m not a gorehound. Low budget horror lovers certainly get a pay off at the end of the movie, so stick around.\n\nAs for what didn&apos;t quite work for me, I noticed in the trailer the performances just did not seem all that convincing for the situation. It&apos;s another thing I expect from indie films, but every now and then you get a goody cast and this was not that. With so many cast members, several had some okay parts, but were mostly disconnected. The only standout to me was Bryant with Morman a very close second. I liked Caliber&apos;s vocal tone and Bourke&apos;s delivery most of the time.\n\nThe score was pretty decent, as was the mix but the sound design really needed some work. Gunshots sounded too generic and it was like they were only drag and dropped in the edit. It really took me out of the film and I really wanted those parts to have more of an impact.\n\nUnlike so many indies, I understand this is a film meant to make money. Rose being part of the cast is a no brainer for that. The script was okay though some of the best dialogue was in Gail&apos;s flashback. The Frenzy character was not likable at all and they almost had too much screen time, though it seemed like her part was intentionally done this way. I think if more of the cast had better performances and the sound design got the same treatment the practical effects did, the other minor issues are much easier to overlook.\n\nLooking forward to seeing improvements in this team&apos;s next project!",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 2685,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5
  },
  "contentRating": "Approved",
  "genre": [
    "Crime",
    "Horror",
    "Thriller"
  ],
  "datePublished": "2023-07-07",
  "keywords": "monster movie,monster,creature feature,drug money,heroin addict",
  "duration": "PT1H23M",
  "actor": [
    {
      "name": "Felissa Rose",
      "url": "https://www.imdb.com/name/nm0741378/"
    },
    {
      "name": "Al Gomez",
      "url": "https://www.imdb.com/name/nm0326969/"
    },
    {
      "name": "Holly Rockwell",
      "url": "https://www.imdb.com/name/nm5252261/"
    }
  ],
  "director": [
    {
      "name": "J. Horton",
      "url": "https://www.imdb.com/name/nm1862032/"
    }
  ],
  "creator": [
    {
      "name": "Gregory Blair",
      "url": "https://www.imdb.com/name/nm2489045/"
    },
    {
      "name": "J. Horton",
      "url": "https://www.imdb.com/name/nm1862032/"
    }
  ]
}