{
  "type": "Movie",
  "name": "Dalíland",
  "url": "https://www.imdb.com/tt8399658/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMmU5ZjhiZjQtMzRmMS00MWJkLWJjMjYtYjc4OWNlYWRkNmIxXkEyXkFqcGdeQXVyMTA2MDU0NjM5._V1_.jpg",
  "description": "In 1973, a young gallery assistant goes on a wild adventure behind the scenes as he helps the aging genius Salvador Dali prepare for a big show in New York.",
  "review": {
    "author": "nigel_cummings",
    "dateCreated": "2023-06-13",
    "inLanguage": "English",
    "heading": "A true depiction.",
    "reviewBody": "Events depicted in this film are real, this is not a sugar coated &apos;mummsy&apos; sentimental bio pic. Kingsley is Dali, Dali is Kingsley - a masterwork in observation of the legendary,tortured / mad / genius artist (delete as applicable) . Watch this and watch Dali at work and at play,, the great hedonist, the sad masturbator, the prodigious artist, a master of the photorealistic depiction of the seemingly mad, mad world that surrounded and stimulated his mind through his lifetime. A leader in surreal art a thoroughly likeable /unlikeable individual - like Marmite, you love him or hate him, but you can&apos;t fail not to notice Dali. And Ben Kingsley is superb in his depiction of him, , Sukowa too, as his muse Gala - both characters depicted, are so real, you almost want to be part of their bizarre swinging 60s/70s/80&apos;s coterie, they are vile and wonderful all at the same time.they depict the true meaning of what it takes to be an acolyte of Salvador Dali / Avida Dollars (Look it up) Its good to see Kingsley actually acting well for a change, I was in despair at viewing - the last ten or so of his films, have for me, been lamentable experiences - thank you Mr Kingsley for bringing Dali back to life and I hope reviving your career on an &apos;end note&apos; as a great actor.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 1828,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama"
  ],
  "datePublished": "2023-10-13",
  "keywords": "spain,male nudity,male rear nudity,female rear nudity,female frontal nudity",
  "duration": "PT1H37M",
  "actor": [
    {
      "name": "Ben Kingsley",
      "url": "https://www.imdb.com/name/nm0001426/"
    },
    {
      "name": "Barbara Sukowa",
      "url": "https://www.imdb.com/name/nm0837784/"
    },
    {
      "name": "Ezra Miller",
      "url": "https://www.imdb.com/name/nm3009232/"
    }
  ],
  "director": [
    {
      "name": "Mary Harron",
      "url": "https://www.imdb.com/name/nm0366004/"
    }
  ],
  "creator": [
    {
      "name": "John Walsh",
      "url": "https://www.imdb.com/name/nm0909699/"
    }
  ]
}