{
  "type": "Movie",
  "name": "Dicks: The Musical",
  "url": "https://www.imdb.com/tt7130916/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMWIzM2FhMzktYzJjYS00NWVjLWI0ZTQtZGExZTcxZTgwNmQ3XkEyXkFqcGdeQXVyMzAxOTk1MjA@._V1_.jpg",
  "description": "A pair of business rivals discover that they&apos;re identical twins and decide to swap places in an attempt to trick their divorced parents to get back together.",
  "review": {
    "author": "jmhoweth",
    "dateCreated": "2023-10-23",
    "inLanguage": "English",
    "heading": "Cinematic Crime",
    "reviewBody": "I had such high hopes for this movie walking into the theater; I was really rooting for this to be a success. I couldn&apos;t have been more predisposed to seeing all its best qualities. An hour and 26 minutes later, I regretted every one of my decisions to see this pure piece of garbage. What adds to the heartbreak is the inclusion of such exceptional performers like Megan Mullaly and Nathan Lane. Not even their talented genius could flog this DOA dumpster fire back to life. The writing lacked originality and wit, and saw fit to instead substitute tortured jokes that begged for a pity laugh. Each song became more and more forgettable. You could feel all six people in the auditorium begging for a swift ending to put us out of our misery. When the writing and the music aren&apos;t competing for the Gold Medal in the Film Failure Olympics, the bizarre, shoe-horned gags are hard at work making you cringe. A disjointed plot line about sewer monsters and a detached vagina pile onto this crime against cinema, which should be tried in The Hague. It would be less painful to watch the movie musical Cats.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 1
    }
  },
  "rating": {
    "ratingCount": 1836,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.5
  },
  "contentRating": "R",
  "genre": [
    "Comedy",
    "Musical"
  ],
  "datePublished": "2023-11-11",
  "keywords": "gay interest,incest,gay marriage,gay producer,male nudity",
  "duration": "PT1H26M",
  "actor": [
    {
      "name": "Josh Sharp",
      "url": "https://www.imdb.com/name/nm5652385/"
    },
    {
      "name": "Aaron Jackson",
      "url": "https://www.imdb.com/name/nm6994453/"
    },
    {
      "name": "Nathan Lane",
      "url": "https://www.imdb.com/name/nm0001447/"
    }
  ],
  "director": [
    {
      "name": "Larry Charles",
      "url": "https://www.imdb.com/name/nm0153078/"
    }
  ],
  "creator": [
    {
      "name": "Aaron Jackson",
      "url": "https://www.imdb.com/name/nm6994453/"
    },
    {
      "name": "Josh Sharp",
      "url": "https://www.imdb.com/name/nm5652385/"
    }
  ]
}