{
  "type": "Movie",
  "name": "Leave the World Behind",
  "url": "https://www.imdb.com/tt12747748/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTUzM2I3NDEtMjNhYi00NTQ0LThmZDItZTMyMzM2MjJmZGRjXkEyXkFqcGdeQXVyMTU3NDU4MDg2._V1_.jpg",
  "description": "A family&apos;s getaway to a luxurious rental home takes an ominous turn when a cyberattack knocks out their devices, and two strangers appear at their door.",
  "review": {
    "author": "durham100",
    "dateCreated": "2023-12-08",
    "inLanguage": "English",
    "heading": "If you&apos;ve read the book don&apos;t let that put you off...",
    "reviewBody": "The book was poorly written, pretentious and so bad it actually made me angry. The hype and fellow author reviews were totally undeserved and basically total falsehoods. It was a sound premise very poorly executed. Thankfully I paid 39p for it online, if I&apos;d paid the full cover price, I would have tracked the author down and demanded my money back. This movie however is very, very good. Mr Mass Email (not a typo) has had a HUGE hand in this - probably sat next to the books author and showed him how to construct a gripping tale with clever social commentary and even a somewhat open ending which is satisfying - admittedly that last thing is hard to do in a novel. The cast are outstanding, Julia Roberts is unlikeable - how hard is it for her to make that work? I love her, always have, but at times I was glaring at her! It is a slow burn but if you can immerse yourself in it, it is well worth it. The set pieces - some of which are from the book so kudos for that - are very well played. The overall feeling of menace and doom is constant, it is gripping, it is terrifying.\n\nYou&apos;re going to need to pay attention and think, judging by a lot of the reviews here a lot of people cannot do that and just want whoosh...aliens..bad guys...BANG!!\n\nIf you haven&apos;t read all the light you cannot see you will think the TV show is great but those of us who have read the book know it&apos;s fine, but falls well short of the written version. The opposite of this show is so true, a terrible book becomes a brilliant movie. Well done Sam.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 150672,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2023-12-08",
  "keywords": "emergency broadcast system,civilization collapse,unknown threat,no internet connection,no cell phone service",
  "duration": "PT2H18M",
  "actor": [
    {
      "name": "Julia Roberts",
      "url": "https://www.imdb.com/name/nm0000210/"
    },
    {
      "name": "Mahershala Ali",
      "url": "https://www.imdb.com/name/nm0991810/"
    },
    {
      "name": "Ethan Hawke",
      "url": "https://www.imdb.com/name/nm0000160/"
    }
  ],
  "director": [
    {
      "name": "Sam Esmail",
      "url": "https://www.imdb.com/name/nm1322753/"
    }
  ],
  "creator": [
    {
      "name": "Rumaan Alam",
      "url": "https://www.imdb.com/name/nm11753223/"
    },
    {
      "name": "Sam Esmail",
      "url": "https://www.imdb.com/name/nm1322753/"
    }
  ]
}