{
  "type": "Movie",
  "name": "Linoleum",
  "url": "https://www.imdb.com/tt13483866/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMDY4NmYxODMtMzNhMi00M2YxLTgwNDEtYjA2OTQ1YTEzYjYxXkEyXkFqcGdeQXVyMzQwMTY2Nzk@._V1_.jpg",
  "description": "When the host of a failing children&apos;s science show endeavors to achieve his childhood dream of becoming an astronaut by constructing a rocket ship in his garage, a series of bizarre events occur that cause him to question his own ...",
  "review": {
    "author": "henry8-3",
    "dateCreated": "2023-07-03",
    "inLanguage": "English",
    "heading": "Linoleum",
    "reviewBody": "Jim Gaffigan plays Cameron Edwin, a gentle man, and aspiring astronaut with a daughter and wife who is to soon divorce him. When the job he loves as a children&apos;s tv science program presenter is taken from him, he decides to do something special - with the help of his ailing father he sets out to build a rocket to take him into space. Strange little things start taking place which Cameron doesn&apos;t understand including an old woman&apos;s frequent appearance and the fact that the father of his daughter&apos;s new friend looks very much like Cameron.\n\nSweet natured, rather lovely film with a glowing, fatherly turn from Gaffigan. The events, whilst strange and often without motive, reason or real direction don&apos;t trouble the viewer and all in all it&apos;s an enjoyable, bewildering but pleasant journey. Where it will really get to you is in the clever and slightly heart wrenching climactic 15 minutes where everything that has occurred is explained - and it doesn&apos;t disappoint.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 3032,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "12",
  "genre": [
    "Comedy",
    "Drama",
    "Sci-Fi"
  ],
  "datePublished": "2023-06-24",
  "keywords": "astronaut,space sci fi,quirky comedy,dream",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "Jim Gaffigan",
      "url": "https://www.imdb.com/name/nm0300712/"
    },
    {
      "name": "Rhea Seehorn",
      "url": "https://www.imdb.com/name/nm0781533/"
    },
    {
      "name": "Katelyn Nacon",
      "url": "https://www.imdb.com/name/nm5393649/"
    }
  ],
  "director": [
    {
      "name": "Colin West",
      "url": "https://www.imdb.com/name/nm4518474/"
    }
  ],
  "creator": [
    {
      "name": "Colin West",
      "url": "https://www.imdb.com/name/nm4518474/"
    }
  ]
}