{
  "type": "Movie",
  "name": "Robots",
  "url": "https://www.imdb.com/tt0358082/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDYyNjY1NjY1M15BMl5BanBnXkFtZTcwNjk5MDczMw@@._V1_.jpg",
  "description": "In a robot world, a young idealistic inventor travels to the big city to join his inspiration&apos;s company, only to find himself opposing its sinister new management.",
  "review": {
    "author": "donricodelavega",
    "dateCreated": "2005-04-05",
    "inLanguage": "English",
    "heading": "Not a lot of feeling",
    "reviewBody": "I&apos;m an animator and I can appreciate the work that went into this film. Its visually interesting, but at the same time cluttered. So from a technical stand point it had its pros. Overall the story was mildly interesting. It started out really slow and I wasn&apos;t sure whether I would be able to get through the whole movie. But it did pick up a little bit as the movie went on. Now for the major negative points. \n\n\n* There are too many characters. The supporting cast is numerous and uninteresting. It comes off as if the art department designed a bunch of robots first then decided they didn&apos;t want to give up any of the designs.\n\n\n\n* The characters personalities are kind of flat. Even the main characters don&apos;t really invoke an emotional connection. The secondary characters are just robots that happen to talk once and a while.\n\n\n\n* I don&apos;t know what is with the trend to put in popular music into animated pictures but it just seems so off when you are watching in. When the story is progressing and then a bunch of characters break out into a dance routine set to a Britney Spears song its like someone suddenly turned on another TV in the room. And this kind of thing happens numerous times. Its even noticeable in the fight sequences and some others which appear to be designed to show funky and interesting animation rather than advance or even fit into the story. \n\n\nBottom line, Blue Sky Studios did a much better job on Ice Age. Just like PDI did a much better job on Shrek compared to Shark&apos;s Tale (Which was garbage). They just need to get some people involved who can trim the fat of the story and keep people who think they are directing a music video out of the editing room.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 159520,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2005-03-18",
  "keywords": "steampunk,robot,parents,male protagonist,title directed by male",
  "duration": "PT1H31M",
  "actor": [
    {
      "name": "Ewan McGregor",
      "url": "https://www.imdb.com/name/nm0000191/"
    },
    {
      "name": "Halle Berry",
      "url": "https://www.imdb.com/name/nm0000932/"
    },
    {
      "name": "Mel Brooks",
      "url": "https://www.imdb.com/name/nm0000316/"
    }
  ],
  "director": [
    {
      "name": "Chris Wedge",
      "url": "https://www.imdb.com/name/nm0917188/"
    },
    {
      "name": "Carlos Saldanha",
      "url": "https://www.imdb.com/name/nm0757858/"
    }
  ],
  "creator": [
    {
      "name": "David Lindsay-Abaire",
      "url": "https://www.imdb.com/name/nm1865755/"
    },
    {
      "name": "Lowell Ganz",
      "url": "https://www.imdb.com/name/nm0304665/"
    },
    {
      "name": "Babaloo Mandel",
      "url": "https://www.imdb.com/name/nm0541632/"
    }
  ]
}