{
  "type": "Movie",
  "name": "The Monkey King",
  "url": "https://www.imdb.com/tt8637498/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNWZhZjUxZGUtMzM1OC00MjdmLWIzZjUtZTUzODc2ZTI2YzQzXkEyXkFqcGdeQXVyMDc5ODIzMw@@._V1_.jpg",
  "description": "Inspired by an epic Chinese tale, translated into an action-packed comedy, a Monkey and his magical fighting Stick battle demons, dragons, gods and the greatest adversary of all - Monkey&apos;s ego.",
  "review": {
    "author": "IonicBreezeMachine",
    "dateCreated": "2023-08-18",
    "inLanguage": "English",
    "heading": "Solid animated adaptation of the opening of Journey to the West which works more often than it doesn&apos;t",
    "reviewBody": "Set in a world overseen by Budha (BD Wong) consisting of Heaven, Hell and the world between, a monkey is born from stone (Jimmy O. Yang adult, Dee Bradley Baker baby) who is endowed with extraordinary powers but is an outsider from the rest of the monkeys. The monkey hones his abilities and after vanquishing a demon using his a stick stolen from the Dragon King (Bowen Yang) he is given the title of Monkey King. Convinced he&apos;s meant for a place in Heaven, the Monkey King sets out to conquer 100 demons in the hopes Heaven will extend an invitation to him. Along the way Monkey King has many encounters including from a young girl named Lin (Jolie Haong-Rappaport).\n\nThe Monkey King is a 2023 animated film for Netflix co-produced by Reel FX Animation and Pearl Studio. The film is an adaptation of the 16th century Chinese novel Journey to the West (in part anyway) which is no stranger to adaptations with many Chinese or Hong Kong productions having been produced in the past 10 years alone as well as having served as inspiration for other stories such as Dragonball Z. While The Monkey King doesn&apos;t stray to far from prior adaptations, but it is an impressive animated effort in its own right that does adequate justice to the story.\n\nIn terms of the central character, the movie does a solid job of establishing The Monkey King as an arrogant character who while powerful is lacking in wisdom or humility and is brought to life quite effectively be Jimmy O. Yang&apos;s performance. The medium of animation works very well for this story with a strong sense of freedom of movement among the characters and fantastical environments. While the Monkey King is positioned as an arrogant prideful character, the movie does a solid job of keeping him in check from becoming too grating by counterbalancing him with his Stick weapon (who despite not talking is also a character) and Lin who work well against him. While the movie sticks pretty closely to its source material, it also does feel like it plays up some parts of silliness up a little more than it should. While I have no problem with Bowen Yang&apos;s performance as the Dragon King who&apos;s the primary antagonist, the movie follows a trend of European and Asian animated productions where the overplay the comedic sides of their villains at the expense of treating them as threats.\n\nThe Monkey King is a decent animated film that isn&apos;t especially ground breaking in its rendition of this story, but it&apos;s an agreeable experience with some engaging setpieces and performances and assuming the producers decide to continue this incarnation with a follow-up I&apos;d be interested.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 5695,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Action",
    "Adventure"
  ],
  "datePublished": "2023-08-18",
  "keywords": "animated,monkey,demon,enemy,chinese",
  "duration": "PT1H37M",
  "actor": [
    {
      "name": "Jimmy O. Yang",
      "url": "https://www.imdb.com/name/nm4497202/"
    },
    {
      "name": "Bowen Yang",
      "url": "https://www.imdb.com/name/nm6299248/"
    },
    {
      "name": "Jolie Hoang-Rappaport",
      "url": "https://www.imdb.com/name/nm10043239/"
    }
  ],
  "director": [
    {
      "name": "Anthony Stacchi",
      "url": "https://www.imdb.com/name/nm0820934/"
    }
  ],
  "creator": [
    {
      "name": "Steve Bencich",
      "url": "https://www.imdb.com/name/nm0070368/"
    },
    {
      "name": "Ron J. Friedman",
      "url": "https://www.imdb.com/name/nm1943855/"
    },
    {
      "name": "Rita Hsiao",
      "url": "https://www.imdb.com/name/nm0398763/"
    }
  ]
}