

{
  "type": "Movie",
  "name": "28 Days Later...",
  "url": "https://www.imdb.com/tt0289043/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYTFkM2ViMmQtZmI5NS00MjQ2LWEyN2EtMTI1ZmNlZDU3MTZjXkEyXkFqcGdeQXVyNjU0OTQ0OTY._V1_.jpg",
  "description": "Four weeks after a mysterious, incurable virus spreads throughout the UK, a handful of survivors try to find sanctuary.",
  "genre": [
    "Drama",
    "Horror",
    "Sci-Fi"
  ],
  "contentRating": "18",
  "datePublished": "2002-11-01",
  "duration": "PT1H53M",
  "keywords": [
    "virus",
    "military",
    "epidemic",
    "male full frontal nudity",
    "male frontal nudity"
  ],
  "rating": {
    "ratingCount": 441002,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.5
  },
  "review": {
    "author": "bob the moo",
    "dateCreated": "2002-10-30",
    "inLanguage": "English",
    "heading": "Flawed but thrilling British horror movie",
    "reviewBody": "In England a group of animal rights activists break into a research facility to free monkeys. However the monkeys are infected with a new developed virus called rage which is contagious by blood or bodily fluid - at the same time Jim lies in a coma. 28 days later Jim awakens from his state to find London deserted and populated only by a group of those infected by rage. Jim is rescued by Selena and her friend who tell him what has happened and start a search for other survivors and a quest to find the cure, promised by a military unit stationed in the north.\n\nI excitedly arrived at the preview for this looking forward to a tense British horror movie to make me jump with fear. I got pretty much what I wanted. The plot is simple and omits much detail but not to it&apos;s disservice. Details as to what the virus is or what it was created in the first place (by putting monkeys in front of TV&apos;s Clockwork Orange style?) but the detail is not important seconds into the film when we wake up with Jim. At this point his fear becomes ours and what is important to him is not the detail but the bigger picture of the infected and the chances of survival.\n\nThe plot is told in two parts. First the big picture in London and then the smaller battle north of Manchester. Both are well told but for different reasons. The bridging section of the journey north is good as it helps us know the characters better. Of course is it scary? Well, not scary but thrilling all the way. To me scary is things like Ringu - creepy stuff, but most will be freaked by 28 days later. The infected are not zombies in definition or in action - they move silently and fast and with pure blood lust. I was always more scared by zombie flicks than anything else becomes they keep coming - here they do the same but fast!\n\nThe direction is good for the most part. The opening scene in London just shows how badly Crowe did his bit in Vanilla Sky. Here it is clever and chilling to see much of London totally empty. The direction is better when it is fast cutting and handheld style. We see things like the characters would see them out of the corner of their eyes, a flicker, a shadow etc and it works to great effect. The only downside is that, at one or two points, the attacks were signalled by a preceding talking 5 minutes, but this is minor. The final rain soaked action is excellent - fast, gripping and paced. This film doesn&apos;t rely on gore or special effects (although it is there) instead it has genuine tension and fear.\n\nThe film is very British. It is very low-key and realistic. The survivors are not Mad Max style heroes but people clinging to life by a thread or setting up survivalist measures that simply don&apos;t work. The ending is not as good as I had hoped but it wasn&apos;t bad and it fitted with the tone of reality that Jim had realised when lying on his back in the woods towards the end. It&apos;s not without flaws but the film is a very good British horror film - Americans will wonder `where are all the teenager girls to scream&apos; or `why don&apos;t they all have guns&apos; or `why is there no real dah-dah music to tell us when something is going to happen&apos; but that is because this is a British film and not Hollywood.\n\nMost reviews have praised the `unknown&apos; cast. Well I agree the cast did very well - but unknown? Murphy certainly is not unknown (and won&apos;t be from now on) and he does Jim very well, from when the truth is first real to him, to his decision that he must learn to kill through to his transformation near the end. Harris is excellent again, I say again as she did well in miniseries `white teeth&apos;. Her accent is British and she plays a younger role but she is a good actress. Brendan Gleeson is good in a fatherly role but Eccleston seems clipped and at odds with his military role. In fact all the military guys were laddish caricatures and only just did the job - but I never believed in their characters as I did with the others.\n\nOverall I was glad to see this early. I really enjoyed it, the pace at times may have been uneven but to me that added to the tension - an attack could come at any time. The eventual small scale focus helped the tension and pace of the story. Thrilling, scary, tense and well written - even more surprising is that it&apos;s home grown!",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "actor": [
    {
      "name": "Cillian Murphy",
      "url": "https://www.imdb.com/name/nm0614165/"
    },
    {
      "name": "Naomie Harris",
      "url": "https://www.imdb.com/name/nm0365140/"
    },
    {
      "name": "Christopher Eccleston",
      "url": "https://www.imdb.com/name/nm0001172/"
    }
  ],
  "director": [
    {
      "name": "Danny Boyle",
      "url": "https://www.imdb.com/name/nm0000965/"
    }
  ],
  "creator": [
    {
      "name": "Alex Garland",
      "url": "https://www.imdb.com/name/nm0307497/"
    }
  ]
}