

{
  "type": "Movie",
  "name": "Leprechaun 5: In the Hood",
  "url": "https://www.imdb.com/tt0209095/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNGNkMzc4MDEtNTcxYi00YTk5LTkyOWQtZTA3ZGVmYWM3ZDliXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg",
  "description": "When three rappers want to get even with a pimp, they accidentally unleash a leprechaun who goes on a killing rampage in tha 'hood.",
  "review": {
    "author": "jaywolfenstien",
    "dateCreated": "2003-10-16",
    "inLanguage": "English",
    "heading": "What you'd expect from Green Lep #5.",
    "reviewBody": "Not the greatest in the series, not the worst either. Not the greatest series in the world, but not the worst either. The Leprechaun films have always been silly horror movies that never try to take themselves too seriously (In Las Vegas? In Space? In the Hood?); unfortunately, none of them have ever excelled at that . . . but they've always been watchable.\\n\\nLeprechaun in the Hood falls somewhere in the middle in terms of quality. Like the latest trends of just about any franchise, the film takes its audience for a bunch of a morons and feels the need to shove overused and no-longer-funny jokes down their throats. Some of these gags, granted, still manage to have a chuckle-value; most, like the fruit, could if it was handled better. Unfortunately, finesse is not part of Lep 5's vocabulary. No, instead let's throw the crap on the screen and wrap on the shoot ASAP. So, typically, the humor spills more out of sheer chance than talent. After all, if you throw 100 gags into a film one of them has to be funny . . . sooner or later.\\n\\nIt's not as bad as say Leprechaun 4 in terms of going overboard with the humor in a dramatic over-the-top fashion. We're still stuck with archtypes and a group of aspiring morons we'd rather see get killed than survive. Kill them, Warwick! Kill them all!\\n\\nAfter the 'safe' scene, things got too wacky for my taste in dark comedy. The plan to catch up with the Leprechaun was plain retarded even by modern sitcom standards. `Leprechauns for Dummies?' Old joke that's painfully not funny anymore.\\n\\nSo that leaves Warwick Davis, himself, who once again steals the show as the title character. He still remains charming in the role of the Leprechaun in his own sick and demented way. Something about the irony of dangerous demonic nature in a creature so small makes the Leprechaun films a guilty pleasure in a way that most Child's Play films are lacking. Not since the Gremlins has any Hollywood Creature had so much fun causing death and destruction. Most of the humor in this film that does work does so directly because of Davis' involvement.\\n\\nSo, at sequel number five, I think it's safe to say fans know what they're getting into with a rental and whether or not they'll find it enjoyable. Leprechaun still has enough moments to get my rental at least for one more film. Have a ball, my little green friend.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 8202,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.7
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Fantasy",
    "Horror"
  ],
  "datePublished": "2000-03-28",
  "keywords": "spoof,compton california,reference to jimi hendrix,reference to paul mccartney,home invasion",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Warwick Davis",
      "url": "https://www.imdb.com/name/nm0001116/"
    },
    {
      "name": "Ice-T",
      "url": "https://www.imdb.com/name/nm0001384/"
    },
    {
      "name": "Anthony Montgomery",
      "url": "https://www.imdb.com/name/nm0599719/"
    }
  ],
  "director": [
    {
      "name": "Rob Spera",
      "url": "https://www.imdb.com/name/nm0818237/"
    }
  ],
  "creator": [
    {
      "name": "Mark Jones",
      "url": "https://www.imdb.com/name/nm0428751/"
    },
    {
      "name": "William Wells",
      "url": "https://www.imdb.com/name/nm1113287/"
    },
    {
      "name": "Alan Reynolds",
      "url": "https://www.imdb.com/name/nm1113283/"
    }
  ]
}