

{
  "type": "Movie",
  "name": "The Tigger Movie",
  "url": "https://www.imdb.com/tt0220099/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTE5NDIyODU4M15BMl5BanBnXkFtZTYwODA5MzY2._V1_.jpg",
  "description": "Tigger goes looking through the hundred-acre-wood to find his family.",
  "review": {
    "author": "bob the moo",
    "dateCreated": "2003-12-28",
    "inLanguage": "English",
    "heading": "Not much to it but enjoyable",
    "reviewBody": "After causing more trouble than good with all his bouncing, Tigger realises that he is different from the rest of his friends and gets depressed. When overhearing about Owl's family tree, Tigger realises that he needs to find his family tree to be able to have people to bounce around with. He sets out to try and find his family's tree in the forest.\n\nHaving seen the pretty poor movie featuring Piglet I didn't hold out much hope for this film even if Tigger is one of the more fun characters of the series. However the plot is a little better than that film and the whole thing has a lot more energy to it. The basic plot is reasonable enough but it will be no surprise to anyone that lessons are there to be learned. The film moves along easy enough and is light enough to enjoy without being hard to watch.\n\nThe songs are OK and aren't overdone to the point that their averageness becomes a major drag. The animation is pretty basic though and this is matched by the voice work, which doesn't really do anything and actually sounds quite bland. The film isn't great though - it's just passable enough to watch. Kids should enjoy it but even for them it may be all a bit bland and 'nice' to compete with sharper cartoons. As for adults, it is unlikely that they will take much from it apart from having the kids distracted for an hour or so.\n\nOverall, fans of Pooh and all will probably enjoy this film, I liked it because it was undemanding and quite a pleasant little story. The animation is OK even if the voice work is poor and the humour of the film couldn't compete with the much sharper kids animations that are out there.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 20237,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2000-04-14",
  "keywords": "friendship,cartoon tiger,winnie the pooh,animal character name as title,half dressed cartoon animal",
  "duration": "PT1H17M",
  "actor": [
    {
      "name": "Jim Cummings",
      "url": "https://www.imdb.com/name/nm0191906/"
    },
    {
      "name": "Nikita Hopkins",
      "url": "https://www.imdb.com/name/nm0394251/"
    },
    {
      "name": "Ken Sansom",
      "url": "https://www.imdb.com/name/nm0763052/"
    }
  ],
  "director": [
    {
      "name": "Jun Falkenstein",
      "url": "https://www.imdb.com/name/nm0266255/"
    }
  ],
  "creator": [
    {
      "name": "Eddie Guzelian",
      "url": "https://www.imdb.com/name/nm0349966/"
    },
    {
      "name": "Jun Falkenstein",
      "url": "https://www.imdb.com/name/nm0266255/"
    },
    {
      "name": "A.A. Milne",
      "url": "https://www.imdb.com/name/nm0590316/"
    }
  ]
}