

{
  "type": "Movie",
  "name": "Urban Legends: Final Cut",
  "url": "https://www.imdb.com/tt0192731/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNjlkMmFjNTQtMWFjYy00ZTJjLWJhODMtM2EzODNhMTJiMGU2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
  "description": "A film school is the center of a fresh spate of killings based on urban legends.",
  "review": {
    "author": "MissCzarChasm",
    "dateCreated": "2001-11-25",
    "inLanguage": "English",
    "heading": "On the Same Level as the Orginal",
    "reviewBody": "Urban Legends: Final Cut starts off on the right note just like the original. It doesn't have horror classic written all over it like the first one did when it began but it still starts off above average. However just like the orignal once the film begins to progress it slowly turns into another crappy slasher film.\\n\\nThe premise uses the whole movie within a movie tie in that is quite frankly getting a bit tired. Our new heroine is trying to win the prestigious Hitchcock Award for her new film which is about a serial killer who kills his victims based on Urban Legends. however once murders begin to happen on the set it becomes much harder to seperate fact from fiction.\\n\\nWhat i Liked:\\n\\nThe heroine in this film is far more engaging than the one from the first film. She gives an honest performance and despite a tepid script she holds her own.\\n\\nVery interesting to see Joey...no i mean Joseph Lawrence in this film. I joked about him being in it when i first heard about it but he was actually kinda good. In fact i wish he could've been in it more because he provides some pretty funny moments in the film.\\n\\ni liked how it wasn't just a slasher film. During certain moments it played like a thriller and for at least the majority of the film the whodunit aspect is quite engaging.\\n\\ni liked the use of seperating fact from fiction. That was a bit interesting. The scene where thry begin to watch Amy's reel and the killer switches it to the death he filmed was pretty intense.\\n\\nWhat i didn't Like:\\n\\nWhere in the hell were the urban legend deaths. We got one and that was it. The one they has was pretty good but the film is called urban legend you would tihnk they would utilize that.\\n\\nThe last half of the film is even more ludicrious than the one in the first film. i found my self dumbfounded that they actually were allowed to produce the last half of this film. what a disappointed.\\n\\nYou can tell that we're running out of costumes for the killer to wear. The fencing mask and black apparel might seem frightening to some but all i kept thinking was the killer looks like a giant micro-phone.\\n\\nThe acting, with the exception of two people, is so painfully bad. My two year old brother could even act circles around these people.\\n\\nThis might not say much but at least this sequelis better than something like I Still Know What you did Last Summer. It barely sinks below the level of the original and i guess that says something. It's no film masterpiece but i tihnk fans of the first film may enjoy it.\\n\\n5/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 18864,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.4
  },
  "contentRating": "15",
  "genre": [
    "Horror",
    "Mystery"
  ],
  "datePublished": "2000-12-01",
  "keywords": "slasher,urban legend,film director,serial killer,film student",
  "duration": "PT1H37M",
  "actor": [
    {
      "name": "Jennifer Morrison",
      "url": "https://www.imdb.com/name/nm0607185/"
    },
    {
      "name": "Matthew Davis",
      "url": "https://www.imdb.com/name/nm0205127/"
    },
    {
      "name": "Hart Bochner",
      "url": "https://www.imdb.com/name/nm0000952/"
    }
  ],
  "director": [
    {
      "name": "John Ottman",
      "url": "https://www.imdb.com/name/nm0653211/"
    }
  ],
  "creator": [
    {
      "name": "Silvio Horta",
      "url": "https://www.imdb.com/name/nm0395531/"
    },
    {
      "name": "Paul Harris Boardman",
      "url": "https://www.imdb.com/name/nm0090199/"
    },
    {
      "name": "Scott Derrickson",
      "url": "https://www.imdb.com/name/nm0220600/"
    }
  ]
}