{
  "type": "Movie",
  "name": "Efter brylluppet",
  "url": "https://www.imdb.com/tt0457655/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZGI1NzBhZGEtNzM0OC00MjI1LTlkYzUtZjM0N2ExNmY3M2JhXkEyXkFqcGdeQXVyMTU3NDU4MDg2._V1_.jpg",
  "description": "A manager of an orphanage in India is sent to Copenhagen, Denmark, where he discovers a life-altering family secret.",
  "review": {
    "author": "come2whereimfrom",
    "dateCreated": "2007-04-12",
    "inLanguage": "English",
    "heading": "Brilliant Ocasr contender from last year.",
    "reviewBody": "I knew nothing about this film before going to see it except that it was Oscar nominated and starred Bond&apos;s &apos;Casino Royale&apos; foe Mads Mikkelsen. But I&apos;d heard good things and despite it being a day so sunny in April that you should really spend it in the park I ventured into the dark cinema. All I can say is that I am so, so glad I did as this has to be one of the best films I have seen this year. Jacob (Mikkelsen) runs an orphanage/school in India that due to funding will have to close if they don&apos;t do something quickly, cue a phone call from Denmark where a millionaire is looking to invest some money in a good cause and Jacob has no choice but to go home and try to win over the mystery funder. Cut to Copenhagen and the very rich living of Jorgen and his family, a self-made millionaire Jorgen is preparing for the Wedding of his daughter and as his family gather round the mansion we see that he has a pretty good life. Cut back to Jacob who after living in squalid conditions in India for so long is struggling to understand the swish hotel he&apos;s been booked in for his visit. When the two meet to discuss the investment Jacob is over enthusiastic but Jorgen is nonchalant and pre-occupied with the weekends approaching festivities, so much so he decides to conclude the deal on Monday and seeing as Jacob is here on his invitation with nothing to do all weekend he decides to ask him to attend the wedding. So far so seemingly normal. It is at this point that the film takes some dramatic turns and through a series of unexpected events, a few skeletons in closets, the past and emotive performances, becomes a really deep and moving piece of cinema. I don&apos;t want to spoil it by saying anymore about it except it&apos;s nothing short of brilliant. I haven&apos;t seen a film for ages that deals with such negative and positive issues with such compassion and integrity without being hammy or over the top. The direction is flawless, the music is fitting and the cinematography is almost dogma in style but with a certain crispness to it. The performances are outstanding and it&apos;s not hard to see why it was Oscar nominated and won countless awards. The way the script is superbly written it reminded of &apos;Secrets and Lies&apos; by Mike Leigh in the way it captures humans acting realistically in real situations. By the time the film starts to conclude the tissues were coming out to wipe away the tears of sadness and joy, which is a very powerful position to be in for any film, and the audience left the auditorium into bright sunshine glad like me that they&apos;d had chance to see this amazing piece of cinema.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 36495,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "15",
  "genre": [
    "Drama"
  ],
  "datePublished": "2007-03-09",
  "keywords": "twin brothers,real twins playing twins,ex boyfriend ex girlfriend relationship,co written by director,man and woman in a bathtub",
  "duration": "PT2H",
  "actor": [
    {
      "name": "Mads Mikkelsen",
      "url": "https://www.imdb.com/name/nm0586568/"
    },
    {
      "name": "Sidse Babett Knudsen",
      "url": "https://www.imdb.com/name/nm0461746/"
    },
    {
      "name": "Rolf Lassgård",
      "url": "https://www.imdb.com/name/nm0489858/"
    }
  ],
  "director": [
    {
      "name": "Susanne Bier",
      "url": "https://www.imdb.com/name/nm0081540/"
    }
  ],
  "creator": [
    {
      "name": "Susanne Bier",
      "url": "https://www.imdb.com/name/nm0081540/"
    },
    {
      "name": "Anders Thomas Jensen",
      "url": "https://www.imdb.com/name/nm0421314/"
    }
  ]
}