{
  "type": "Movie",
  "name": "Light of My Life",
  "url": "https://www.imdb.com/tt6063090/",
  "poster": "https://m.media-amazon.com/images/M/MV5BM2FmMGNiODgtNTAyMy00N2VlLWEyODEtNDViMmRkZDA5Nzc3XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
  "description": "A father and his child journey through the outskirts of society a decade after a pandemic has wiped out half the world&apos;s population. As the father struggles to protect his child from, their bond and the character of humanity are t...",
  "review": {
    "author": "n-kefala",
    "dateCreated": "2020-01-14",
    "inLanguage": "English",
    "heading": "A hymn for the woman",
    "reviewBody": "At the beginning of Light of My Life - Casey Affleck is directing and also signs the script - a father and his little daughter lie in a scene in the middle of the night, where he tells her a fairytale before bedtime. He confuses the myths with his imagination and creates his own story from the beginning. It starts by saying that this is the story of a female fox. The fox and her mate are having a great adventure as they board on the Noah&apos;s ark. As the tale continues, the male fox comes to the forefront. The little girl reacts to his father by reminding him that this is the story of the female fox and not the male one ...\n\nAnd that is how Affleck introduces us to his film, a post-apocalyptic drama, in which a pandemic disease has eradicated the female population on the planet, including the little girl&apos;s mother. Now, father and daughter are hiding in the woods, as the world is inhabited only by men, who pose a permanent threat to the girl, who dresses as a boy and behaves as one.\n\nA threat however that is not apparent from the beginning. The pace of the film is so slow that it eventually catches you in, while for the most part, the two main characters is the only ones that appear on screen. The movie displays an incredible sensitivity (almost feminine) and a great potential for Casey Affleck behind the camera, which with its minimalist mood and beautiful dialogues, creates suspense and anxiety even when nothing is happening.\n\nWhile the story is not pleasant and certainly does not claim originality laurels, it manages to be touching, realistically captures the moral complexity and weight of the father-daughter bond and at the same time their uncertain future and their striving for survival as literally all the world is against them. A key asset of the film is Anna Pniowsky&apos;s amazing performance that expresses harmoniously childlike innocence, curiosity, sensitivity, anger and empowerment.\n\nAs one can see at the end of the film, the tale was from the beginning about the story of the female fox: the hunted girl who must hide her true identity in order to survive and also for the humanity to survive. I don&apos;t know if Affleck was really one of the many perpetrators of the #metoo movement, but with his film he creates a hymn for the woman, the unbearable pain of her loss and her crucial role in the evolution of society.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 15041,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Sci-Fi",
    "Thriller"
  ],
  "datePublished": "2019-08-16",
  "keywords": "short haired girl,rifle,four word title,post apocalypse,flashback",
  "duration": "PT1H59M",
  "actor": [
    {
      "name": "Anna Pniowsky",
      "url": "https://www.imdb.com/name/nm6370548/"
    },
    {
      "name": "Casey Affleck",
      "url": "https://www.imdb.com/name/nm0000729/"
    },
    {
      "name": "Tom Bower",
      "url": "https://www.imdb.com/name/nm0101005/"
    }
  ],
  "director": [
    {
      "name": "Casey Affleck",
      "url": "https://www.imdb.com/name/nm0000729/"
    }
  ],
  "creator": [
    {
      "name": "Casey Affleck",
      "url": "https://www.imdb.com/name/nm0000729/"
    }
  ]
}