{
  "type": "Movie",
  "name": "Midway",
  "url": "https://www.imdb.com/tt6924650/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzA5Y2Q2YjktZDYwMi00NTdmLThlMjctMmY5NDgwOWRhZDUxXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
  "description": "The story of the Battle of Midway, told by the leaders and the sailors who fought it.",
  "review": {
    "author": "BA_Harrison",
    "dateCreated": "2019-11-08",
    "inLanguage": "English",
    "heading": "You sunk my battleship!",
    "reviewBody": "Midway is not just the name of the place where a historic WWII sea battle took place between the Americans and the Japanese, it&apos;s also the point in this film where I realised I didn&apos;t know what was going on. Director Roland Emmerich (Godzilla, Independence Day, 2012) is obviously no slouch when it comes to action scenes, bringing us some truly astonishing battle sequences that provide much bang for your buck, but he struggles to tell his complex historical story with any coherence.\n\nAs the movie cuts back and forth between the American and Japanese forces, with numerous ships, locations, characters, and much detailed wartime strategy to take in, it&apos;s easy to lose track of what&apos;s what and, more importantly, who is who, making it hard to feel anything when they meet their inevitable fate in a ball of flames and twisted metal (the most emotional part of the whole film comes right at the end when photos with captions show the real-life people who were instrumental in the battle).\n\nOf course, those who are watching, not for a history lesson or for heart-rending pathos, but for thrilling scenes of destruction and derring-do, are more than catered for with countless huge explosions, plenty of machine-gun fire and loads of impressive aerial combat. While most of this is realised through the use of CGI, it&apos;s well-handled and, for the most part, very convincing.\n\n5.5/10, rounded up to 6 for IMDb.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 93005,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Drama",
    "History"
  ],
  "datePublished": "2019-11-08",
  "keywords": "battle of midway,pacific ocean,u.s. navy,world war two,fighter plane",
  "duration": "PT2H18M",
  "actor": [
    {
      "name": "Ed Skrein",
      "url": "https://www.imdb.com/name/nm4534098/"
    },
    {
      "name": "Patrick Wilson",
      "url": "https://www.imdb.com/name/nm0933940/"
    },
    {
      "name": "Woody Harrelson",
      "url": "https://www.imdb.com/name/nm0000437/"
    }
  ],
  "director": [
    {
      "name": "Roland Emmerich",
      "url": "https://www.imdb.com/name/nm0000386/"
    }
  ],
  "creator": [
    {
      "name": "Wes Tooke",
      "url": "https://www.imdb.com/name/nm7873659/"
    }
  ]
}