{
  "type": "Movie",
  "name": "Waves",
  "url": "https://www.imdb.com/tt8652728/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMWE2OTdiY2MtM2ViNy00NmExLWIxZjYtYTVkNGJkNzgwYjVmXkEyXkFqcGdeQXVyNjgzMjQ0MTA@._V1_.jpg",
  "description": "Traces the journey of a suburban family - led by a well-intentioned but domineering father - as they navigate love, forgiveness, and coming together in the aftermath of a loss.",
  "review": {
    "author": "kjproulx",
    "dateCreated": "2019-09-13",
    "inLanguage": "English",
    "heading": "This Film Tore My Heart Out",
    "reviewBody": "I&apos;ve said this before, but I will also never be tired of saying it; A24 is easily the best studio out there today, in terms of releasing quality content. Their endless devotion to finding original and exciting projects has always been an admiration of mine. Each year, they seem to be building a bigger catalogue of movies. Waves is one of their latest films to be produced and will hit theatres this November. Here&apos;s why, even though it may be a tough pill to swallow at times, you should absolutely be seeking it out.\n\nI will start off and say that I&apos;m going to keep the premise very brief, because it&apos;s the type of film that consistently surprises its audience, becoming a completely different film by the end. For this reason alone, I&apos;ll simply say that Waves is a film about a relationship and a family who slowly falls apart in unexpected ways. I was incredibly invested in the set-up for this film and all of the characters in it, so when a certain moment occurs, I was floored. This movie moved me to tears in ways that I never thought it would.\n\nWritten and directed by Trey Edward Shultz (It Comes at Night, Krisha), he very carefully crafts this story in a way that feels true to life, while also having levity in times of crisis or grief. On top of the stellar writing and direction, the cinematography by Drew Daniels, who happens to have worked with this director for years, is out of this world. From the way the camera spins to tell a story or frames things perfectly for an aspect ratio change, I would be shocked if Daniels isn&apos;t talked about for his work here.\n\nIt goes without saying that Sterling K. Brown has deliver an amazing performance, and his work here is nothing short of that word. I believe he will be recognized for awards this coming season, but I would like to mention Taylor Russell as well. Playing sort of the backbone of this family, her character has a lot on her shoulders and there are a few scenes where she absolutely steals the show. Alexa Demie, Kelin Harrison Jr., and Renée Elise Goldsberry are all terrific as well, but there was just something I couldn&apos;t put my finger on when watching Waves unfold.\n\n135 minutes doesn&apos;t seem too long for a film in hindsight, but the way this story plays out will probably make some audiences impatient. There are a couple of instances when this movie feels like it ends, but there&apos;s still a lot left to explore. Looking back on this possible negative though, I feel that a rewatch may have me forgiving that aspect, and that has everything to do with the score. Even in the moments where a movie like this would seem to drag, Trent Reznor and Atticus Ross provide a pulse-pounding score that will keep you invested, even during the slow moments in this family&apos;s life.\n\nIn the end, for what Waves sets out to be, it&apos;s nearly perfect. The route this film takes toward the end will probably not sit well with some viewers, but that aspect is what impacted me the most and took the film from great to incredible. It can be quite upsetting and depressing at times, so if you&apos;re not into that, I would suggest looking for a different film. With that said, this is easily one of the best movies I&apos;ve seen in 2019 and I can&apos;t see myself changing my mind on that. This movie is a human drama that just goes for it and it tore a hole in my heart by the end. Waves is stellar.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 29389,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.5
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Romance",
    "Sport"
  ],
  "datePublished": "2020-01-17",
  "keywords": "african american,florida,manatee,family relationships,father daughter relationship",
  "duration": "PT2H15M",
  "actor": [
    {
      "name": "Taylor Russell",
      "url": "https://www.imdb.com/name/nm5347988/"
    },
    {
      "name": "Kelvin Harrison Jr.",
      "url": "https://www.imdb.com/name/nm5123156/"
    },
    {
      "name": "Alexa Demie",
      "url": "https://www.imdb.com/name/nm7051533/"
    }
  ],
  "director": [
    {
      "name": "Trey Edward Shults",
      "url": "https://www.imdb.com/name/nm4099092/"
    }
  ],
  "creator": [
    {
      "name": "Trey Edward Shults",
      "url": "https://www.imdb.com/name/nm4099092/"
    }
  ]
}