{
  "type": "Movie",
  "name": "Wonder Park",
  "url": "https://www.imdb.com/tt6428676/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjUzNTg4MzUyNF5BMl5BanBnXkFtZTgwOTk2OTY3NjM@._V1_.jpg",
  "description": "The imagination of a wildly creative girl comes alive in an amusement park.",
  "review": {
    "author": "rgkarim",
    "dateCreated": "2019-03-16",
    "inLanguage": "English",
    "heading": "Wonder Park or Blunder Park? Read On to Find Out",
    "reviewBody": "Fan of Roller coaster Tycoon, or Simulation coasters? Were you one of those people who had an imagination that could take you to anywhere you wanted to think of? Have you wanted to go to a place of wonder where girls didn&apos;t blow up to blueberries? Well tonight&apos;s movie attempts to bring all of this to you in a package that looks to people overwhelmingly cute. Robbie K back with his thought on yet another movie to hit the silver screen in hopes of not getting lost to the reruns of the theater. Let&apos;s get started!\n\nMovie: Wonder Park (2019)\n\nWriters: Josh Appelbaum (screenplay by), André Nemec(screenplay by) Stars: Sofia Mali, Jennifer Garner, Ken Hudson Campbell\n\n LIKES:\n\nCute Voice Work Special Effects Animation Energy Jokes Imagination Message\n\nSummary: Disney movies make it difficult to try to bring animated features out because of the not so big budget or army of animators/ideas. Nickelodeon is able to still work some charming magic into this piece though, managing once more to bring the cute factor into their film and get the feelings going. It&apos;s got some surprising emotional work, with voice acting and story coming together to sell the feelings lying deep in the fun, cute charm that the trailers show. Much like the opening scene of Up, Wonder Park has some surprisingly deep messages that will hopefully motivate the young and refresh the older generations on the importance of imagination and wonder. Sap fest aside though, the movie accomplishes the goal of still being fun, managing to inject the wonder of imagination in terms of visuals and adventures. Nickelodeon&apos;s team injects a lot of kid friendly energy into the mix, making an infectious, thrill seeking ride that is perfect for the intended audience. The smooth animation, with high paced speed keeps in time with the nature of the animals and imaginative girl, while the design manages to bring in the magic that theme parks and kids movies have. All the unlimited potential of a child&apos;s imagination is unleashed in this film and it is certain to bring you back into the world of pure imagination.\n\nDISLIKES:\n\nPredictable Too Simple Lacking Intense Suspense Short\n\nSummary: As we have talked about, animation movies require a story to be very dynamic, fun, and have a sense of adventure that takes us out of our world. While Wonder Park does semi-accomplish this, it doesn&apos;t quite do it as well as some of the other bigger studios have done. For one thing the movie is predictable, all the symbolism, mystery, and potential twists are easily discernible and lacking the finesse and mind-blowing moments that the sister studio is famous for. In addition, despite all the fun that Wonder Park did in helping you relive your childhood, it was a little too simplistic in the adventure department, not quite having the drive or dive that Pixar and DreamWorks is able to concoct. This means for me that there was not too many suspenseful parts in the mix, most of the chases reduced to quick bouts of falling, or lost in another joke. All the dark challenges and impasses are very diluted avenues, that act as symbolic psyche components of humans rather than true antagonists. Yet the main thing that is semi disappointing, is how short the movie is. Clocking in at just around 80 minutes, this film certainly moves fast, but not so much in the good way as the content feels a little lacking to be honest. Oh well, it got me out a little early, but the length may not be the most bang for your buck in terms of the expensive movie ticket price.\n\nThe VERDICT:\n\nWonder park is certainly an important illustration about the important components of life, including the importance of maintaining your imagination and wonder. It makes great use of the kid friendly energy, yet has a few things for adults to latch onto, especially those touching, pull at your heart string moments. Yet despite all the fun I had in this movie, the film still feels like a Nickelodeon tv special that could have been left to the network. It needed some more adventure, it needed more suspense for me, and more importantly it needed more of that magic they talked about. Wonder Park certainly has the makings for a fun merchandising series, it just needs a little more finesse to finish the deal. Worth a trip to the theater? Hmmm kind of, but this one is probably waiting for streaming for most.\n\nMy scores are:\n\nAnimation/Adventure/Comedy: 7.5 Movie Overall: 6.5",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 12607,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2019-04-08",
  "keywords": "no title at beginning,no opening credits,theme park,anthropomorphic bear,talking bear",
  "duration": "PT1H25M",
  "actor": [
    {
      "name": "Sofia Mali",
      "url": "https://www.imdb.com/name/nm6029853/"
    },
    {
      "name": "Jennifer Garner",
      "url": "https://www.imdb.com/name/nm0004950/"
    },
    {
      "name": "Ken Hudson Campbell",
      "url": "https://www.imdb.com/name/nm0132637/"
    }
  ],
  "director": [
    {
      "name": "Dylan Brown",
      "url": "https://www.imdb.com/name/nm0113477/"
    }
  ],
  "creator": [
    {
      "name": "Josh Appelbaum",
      "url": "https://www.imdb.com/name/nm0032227/"
    },
    {
      "name": "André Nemec",
      "url": "https://www.imdb.com/name/nm0625858/"
    },
    {
      "name": "Robert Gordon",
      "url": "https://www.imdb.com/name/nm0330565/"
    }
  ]
}