

{
  "type": "Movie",
  "name": "Deck the Halls",
  "url": "https://www.imdb.com/tt0790604/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTIzNjA4OTM0OV5BMl5BanBnXkFtZTcwMDgwODkzMQ@@._V1_.jpg",
  "description": "Two neighbors have it out after one of them decorates his house for the holidays so brightly that it can be seen from space.",
  "review": {
    "author": "brettchatz-1",
    "dateCreated": "2006-12-24",
    "inLanguage": "English",
    "heading": "Feuding neighbours provide light-hearted entertainment",
    "reviewBody": "Film Review: Deck the Halls Cast: Danny DeVito, Mathew Broderick, Kristin Davis and Kristin Chenoweth \\n\\nIt&apos;s the festive season and there&apos;s a new neighbour in town. Danny DeVito plays the part of Buddy Hall, a cunning family man desperately in need of settling down. It&apos;s not easy establishing a home in a new neighbourhood as the Hall family soon finds out, especially with a neighbour like Steve Finch, played by Mathew Broderick.\\n\\nFinch is a man set in his ways. His desire to control everything around him borders on obsessive-compulsive. At best he is anally retentive; at worst seriously unstable. As the self proclaimed chairman of the Town&apos;s Christmas celebrations, Finch feels completely threatened by the arrival of Hall.\\n\\nTheir families get along like a house on fire, but these two alpha males can&apos;t see eye to eye on anything. They become fiercely competitive and unwittingly puerile, as each tries to outdo the other. Buddy Hall gets a bizarre notion into his head about adorning his house with sufficient lighting so that it can be viewed from space. He is prepared to do this even if it means arousing the wrath of the Finch family.\\n\\nThis is a weird and wacky tale about Christmas cheer and reconciliation. Naturally there is that inevitable chemistry between DeVito and Broderick. From rivalry to cooperation, this is their story told in the true spirit of the festive season.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 33055,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5
  },
  "contentRating": "PG",
  "genre": [
    "Comedy",
    "Family"
  ],
  "datePublished": "2006-12-01",
  "keywords": "christmas,christmas display,annoyed neighbor,christmas lights,neighbor neighbor relationship",
  "duration": "PT1H33M",
  "actor": [
    {
      "name": "Matthew Broderick",
      "url": "https://www.imdb.com/name/nm0000111/"
    },
    {
      "name": "Danny DeVito",
      "url": "https://www.imdb.com/name/nm0000362/"
    },
    {
      "name": "Kristin Chenoweth",
      "url": "https://www.imdb.com/name/nm0155693/"
    }
  ],
  "director": [
    {
      "name": "John Whitesell",
      "url": "https://www.imdb.com/name/nm0925870/"
    }
  ],
  "creator": [
    {
      "name": "Matt Corman",
      "url": "https://www.imdb.com/name/nm1953304/"
    },
    {
      "name": "Chris Ord",
      "url": "https://www.imdb.com/name/nm1951118/"
    },
    {
      "name": "Don Rhymer",
      "url": "https://www.imdb.com/name/nm0722610/"
    }
  ]
}