

{
  "type": "Movie",
  "name": "Rocky Balboa",
  "url": "https://www.imdb.com/tt0479143/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNWIyNmQyNjctYmVmMS00MGI4LWIxMmUtNjA0ODYzOTA0Yjk0L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
  "description": null,
  "review": {
    "author": "BA_Harrison",
    "dateCreated": "2019-09-07",
    "inLanguage": "English",
    "heading": "Rocky's comeback movie.",
    "reviewBody": "It's tough growing old, but even though the body starts to crumble and the mind slowly fades, the fight should go on; this message, which will resonate with long-time fans of the series, is at the heart of Rocky Balboa, and makes for an emotional return for America's greatest fictional sporting hero.\\n\\nIn the years since returning to his old Philly stomping ground, Balboa (Sylvester Stallone) has lost his beloved wife Adrian to cancer, and settled into retirement from boxing, the heavyweight champ now running a restaurant called Adrian's. His son Robert (Milo Ventimiglia) has very little time for his old man, bitter that he has lived for so long in his father's shadow. Feeling lonely, Rocky befriends bar-woman Marie (Geraldine Hughes) and her son Steps (James Francis Kelly III), who support the ageing boxer when he decides that what he really wants to do is return to the ring.\\n\\nStallone returns to the directing chair for this sixth film in the long-running franchise, and he does a great job, carefully balancing the sentimentality with the action, never letting things get too schmaltzy or too cheesy. Rocky's fight to pick up the pieces and keep moving forward is inspirational, his kind nature is heart-warming, and his motivational speech to his son is frank yet touching. The final 'exhibition' match between Balboa and current heavyweight champion Mason 'The Line' Dixon (Antonio Tarver) proves that the film's star still has what it takes in the ring, the fight being just as hard-hitting and tense as those against his opponents in parts one to four (the less said about Tommy Gunn the better).\\n\\nWhile I could have done without all of the fancy visual touches during the closing fight (rapid cuts between full colour and black and white), Rocky V ably proves that comebacks are possible, even this late in the day.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 230309,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Drama",
    "Sport"
  ],
  "datePublished": "2007-01-19",
  "keywords": "retired boxer,sequel to best picture winner,computer simulation,rocky balboa character,adrian character",
  "duration": "PT1H42M",
  "actor": [
    {
      "name": "Sylvester Stallone",
      "url": "https://www.imdb.com/name/nm0000230/"
    },
    {
      "name": "Antonio Tarver",
      "url": "https://www.imdb.com/name/nm1620989/"
    },
    {
      "name": "Milo Ventimiglia",
      "url": "https://www.imdb.com/name/nm0893257/"
    }
  ],
  "director": [
    {
      "name": "Sylvester Stallone",
      "url": "https://www.imdb.com/name/nm0000230/"
    }
  ],
  "creator": [
    {
      "name": "Sylvester Stallone",
      "url": "https://www.imdb.com/name/nm0000230/"
    }
  ]
}