{
  "type": "Movie",
  "name": "Enola Holmes 2",
  "url": "https://www.imdb.com/tt14641788/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMDI1NWM1ZDItNDFhMi00YWRhLTg1YzItNTNhY2M2N2QzY2FkXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg",
  "description": "Now a detective-for-hire, Enola Holmes takes on her first official case to find a missing girl as the sparks of a dangerous conspiracy ignite a mystery that requires the help of friends - and Sherlock himself - to unravel.",
  "review": {
    "author": "Drawmort",
    "dateCreated": "2022-11-07",
    "inLanguage": "English",
    "heading": "Netflix did it again...",
    "reviewBody": "This sequel has more appeal in the stories that occur in the background, while its protagonist brags under the main spotlight about a superficial and repeated fable. Both the plots of Sherlock Holmes, like that of his mother, concern a more realistic and intriguing tone, with a real threat, above the pretensions of an insufferable teenager. Yes. My main problem with this film is its protagonist. Her acting is highly unconvincing. Her interactions with the audience as she breaks the fourth wall is one of the worst attempts at appearing likeable and charismatic I&apos;ve seen this year.\n\nThe film is quite decent and entertaining, at times it&apos;s funny and charming, it has a good message and a strong commitment to social justice, which is much appreciated, but the main role is a great repellant. To a lesser extent, so were the poor visual effects and to the more critical eye, the film&apos;s montage also feels sloppy. Continuity errors between shots and a rhythm that doesn&apos;t hold up to the story it&apos;s telling.\n\nNow, don&apos;t forget this is a Netflix production. Of course, there is an inexplicable but predictable gender and race change of one of the greatest characters in the Sherlock Holmes universe. In the end, the film gets too distracted trying to overly sympathize with an audience that just wants to have fun without seeing their favorite characters totally transfigured. Enough of that, Netflix!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 96323,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Crime"
  ],
  "datePublished": "2022-11-04",
  "keywords": "detective,runaway,fight,teenager,teenage girl",
  "duration": "PT2H9M",
  "actor": [
    {
      "name": "Millie Bobby Brown",
      "url": "https://www.imdb.com/name/nm5611121/"
    },
    {
      "name": "Henry Cavill",
      "url": "https://www.imdb.com/name/nm0147147/"
    },
    {
      "name": "David Thewlis",
      "url": "https://www.imdb.com/name/nm0000667/"
    }
  ],
  "director": [
    {
      "name": "Harry Bradbeer",
      "url": "https://www.imdb.com/name/nm0102873/"
    }
  ],
  "creator": [
    {
      "name": "Jack Thorne",
      "url": "https://www.imdb.com/name/nm2113666/"
    },
    {
      "name": "Harry Bradbeer",
      "url": "https://www.imdb.com/name/nm0102873/"
    },
    {
      "name": "Nancy Springer",
      "url": "https://www.imdb.com/name/nm9540892/"
    }
  ]
}