{
  "type": "Movie",
  "name": "Shattered",
  "url": "https://www.imdb.com/tt14923008/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMmY4M2MwMzAtYWI0ZC00NTA5LTg3MDUtZjkwZjA5NTk5NzQwXkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_.jpg",
  "description": "A rich divorcee Chris falls in love with a mysterious woman Sky where Chris, ex-wife and his child eventually gets trapped and a desperate fight for survival will most likely ensue.",
  "review": {
    "author": "Catocala",
    "dateCreated": "2022-10-13",
    "inLanguage": "English",
    "heading": "Terrible waste of time",
    "reviewBody": "I sincerely regret watching this movie. If you&apos;re reading this to see if you should watch it: don&apos;t. If you want to know why, then keep reading.\n\nApart from a cameo appearance by John Malkovic, the acting is laughably aweful. Especially the Misery-wannabe bad guy (Lily Krug) comes across as if someone randomly asked me to act one of the main parts. I can&apos;t act.\n\nCameron Monaghan acting feels detached, with little feeling. Given, his character is a rich hermit, but that does not excuse the lack of emotional expression. Aside from the actual script literally telling us who his character is supposed to be, his performance adds little more.\n\nThe overly dramatic acting is complemented by cliché and superficial scripts with a bonus of a ridiculous en incredulous plot. A rich guy who lives alone and avoids people like the plague - never explained why though - meets a stranger; a harmless, pretty girl. He takes her home and they become lovers. Unnecessary and unsexy sex scenes included. Even though we&apos;re supposed to believe they develop a deeper connection, aside from the sex scenes you get to see absolutely nothing to indicate any form of intimacy. The (supposed to be scary, but in fact) charicaturesque psycho side of Lily Krug is so bad that I actually feel bad for her. And John Malkovich must have wanted a paycheck, because even though he plays his part well, nothing could save this dumpster fire of a movie and anyone with half a braincell would have known that from the script alone.\n\nWithout spoilers: you can pretty much guess how the entire movie is going to go. The only thing that exceded my expectations is how dumb the plottwists were. My IQ dropped a point each minute of this already-too-long movie.\n\nIt is the kind of movie that makes you wonder how so many people came together and agreed making it was a good idea. How did this happen? The only thing that makes sense is that Lily Krug landed her first big role, so I understand why she said yes, but from the rest... I expected better.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 5114,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5
  },
  "contentRating": "18",
  "genre": [
    "Crime",
    "Drama",
    "Horror"
  ],
  "datePublished": "2022-05-16",
  "keywords": "snow,small town,mountain,sex scene,female nudity",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Cameron Monaghan",
      "url": "https://www.imdb.com/name/nm1185747/"
    },
    {
      "name": "Sasha Luss",
      "url": "https://www.imdb.com/name/nm7712734/"
    },
    {
      "name": "Ridley Asha Bateman",
      "url": "https://www.imdb.com/name/nm11633473/"
    }
  ],
  "director": [
    {
      "name": "Luis Prieto",
      "url": "https://www.imdb.com/name/nm1060986/"
    }
  ],
  "creator": [
    {
      "name": "David Loughery",
      "url": "https://www.imdb.com/name/nm0521739/"
    }
  ]
}