{
  "type": "Movie",
  "name": "A Haunting in Venice",
  "url": "https://www.imdb.com/tt22687790/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZTczZTViMDAtMmJkMS00OTQyLTkwMmItMjc3NzE1MDQ1MmIzXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
  "description": "In post-World War II Venice, Poirot, now retired and living in his own exile, reluctantly attends a seance. But when one of the guests is murdered, it is up to the former detective to once again uncover the killer.",
  "review": {
    "author": "henry8-3",
    "dateCreated": "2023-09-15",
    "inLanguage": "English",
    "heading": "A Haunting In Venice",
    "reviewBody": "Poirot (Kenneth Branagh) has retired and is living in Venice where he is visited by his old friend Ariadne Oliver (Tina Fey) who asks him to come to a seance held in a palatial Venetian house by top medium played by Michelle Yeoh who is seeking to speak with the spirit of a girl who apparently killed herself jumping from the building. Oliver wants Poirot to expose Yeoh as a fraud or start believing in the afterlife. He attends and there is a murder.\n\nBranagh&apos;s third go at a Poirot story and depending on your fondness for these things, potentially the best. It is very different from the previous 2 mysteries in that whilst the usual interviews and ripping up of alibis takes place, there is a very distinct supernatural element here, which may or may not be real. What Branagh does though is use this to create a much darker and decidedly well crafted spooky story (he should definitely make a straight ghost story) which is looking both for a murderer and proof that the ghostly bit is true or false. So whilst the gloss and usual extravagant beautifully dressed characters might be missing there is still a great mystery to enjoy. I hope he does another one.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 94558,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "12A",
  "genre": [
    "Crime",
    "Drama",
    "Horror"
  ],
  "datePublished": "2023-09-15",
  "keywords": "based on novel,seance,sequel,detective,murder",
  "duration": "PT1H43M",
  "actor": [
    {
      "name": "Kenneth Branagh",
      "url": "https://www.imdb.com/name/nm0000110/"
    },
    {
      "name": "Michelle Yeoh",
      "url": "https://www.imdb.com/name/nm0000706/"
    },
    {
      "name": "Jamie Dornan",
      "url": "https://www.imdb.com/name/nm1946193/"
    }
  ],
  "director": [
    {
      "name": "Kenneth Branagh",
      "url": "https://www.imdb.com/name/nm0000110/"
    }
  ],
  "creator": [
    {
      "name": "Michael Green",
      "url": "https://www.imdb.com/name/nm0338169/"
    },
    {
      "name": "Agatha Christie",
      "url": "https://www.imdb.com/name/nm0002005/"
    }
  ]
}