{
  "type": "Movie",
  "name": "Acidman",
  "url": "https://www.imdb.com/tt19757912/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMWUwNDFhNDctYTQxZS00Y2FmLWIyZjEtN2JjOWM4MzcxMmE4XkEyXkFqcGdeQXVyNDExMzMxNjE@._V1_.jpg",
  "description": "Maggie tracks down her estranged and reclusive father Lloyd; together they attempt to make first contact.",
  "review": {
    "author": "trinaboice",
    "dateCreated": "2023-10-27",
    "inLanguage": "English",
    "heading": "It&apos;s fascinating to watch the interplay between the two characters",
    "reviewBody": "IN A NUTSHELL: The story is about Maggie who tracks down her estranged and reclusive father. She discovers his world of UFO-hunting as she realizes the sobering effects of aging.\n\nThe gentle film was directed by Alex Lehmann with screenwriting help from Chris Dowling.\n\nTHINGS I LIKED: I&apos;ve been a fan of Thomas Haden Church for decades, ever since I first saw him in the cute TV show Wings. I loved seeing him in this. He did an outstanding job. Some film critics have been saying this is his best performance ever.\n\nI&apos;m always happy to see Dianna Agron get work in movies. Probably like you, I had never seen her in anything until the popular TV show GLEE. She&apos;s lovely and also gives us a good performance as she stretches her acting chops and shows us what she can do.\n\nGorgeous cinematography.\n\nIt&apos;s fascinating to watch the interplay between the two characters and how they realize how much they&apos;re truly alike.\n\nParent/child relationships can be complicated and take a completely new turn as the parent ages, resulting in a role reversal where the child needs to take care of the parent. This movie illustrates that extremely well. I could definitely relate to the sadness of those changes while watching all of my parents lose their memories and physical abilities in recent years. As you know, I&apos;ve had to say goodbye and bury 3 parents in the past 3 months. As expected, the movie&apos;s nuanced performances made me weep.\n\nThere are a few humorous moments, but nothing so funny that it makes you laugh out loud. Overall, it&apos;s a very reflective, slow, drama.\n\nThe song at the end was perfect.\n\nTHINGS I DIDN&apos;T LIKE: Some viewers might complain that the pacing is too slow. That&apos;s part of the journey. It illustrates well how slow life meanders from childhood to adulthood, yet also how relationships evolve.\n\nIf you&apos;re expecting to see aliens, you&apos;ll be disappointed.\n\nThe title of the film is a bit misleading. It makes it sound like a superhero movie or something!\n\nTIPS FOR PARENTS: Kids will be completely bored because the whole film is about two adults talking.\n\nProfanity, including F-bombs Guns A dog gets shot. We see blood.\n\nA man smokes marijuana and talks about a trip.\n\nPortrayal of death.\n\nTo see my full review, go to my YouTube channel called Movie Review Mom!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 594,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.4
  },
  "contentRating": null,
  "genre": [
    "Drama",
    "Sci-Fi"
  ],
  "datePublished": "2023-03-31",
  "keywords": "reference to sedona arizona,reference to arizona,father",
  "duration": "PT1H27M",
  "actor": [
    {
      "name": "Dianna Agron",
      "url": "https://www.imdb.com/name/nm1872698/"
    },
    {
      "name": "Thomas Haden Church",
      "url": "https://www.imdb.com/name/nm0002006/"
    },
    {
      "name": "Sameerah Luqmaan-Harris",
      "url": "https://www.imdb.com/name/nm4077007/"
    }
  ],
  "director": [
    {
      "name": "Alex Lehmann",
      "url": "https://www.imdb.com/name/nm1411972/"
    }
  ],
  "creator": [
    {
      "name": "Chris Dowling",
      "url": "https://www.imdb.com/name/nm0235822/"
    },
    {
      "name": "Alex Lehmann",
      "url": "https://www.imdb.com/name/nm1411972/"
    }
  ]
}