{
  "type": "Movie",
  "name": "Chicken Run: Dawn of the Nugget",
  "url": "https://www.imdb.com/tt8337264/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMzNhZTkyMWItMTAwZS00ZGJkLTlkMTctNjc5ZDdkMDNmMmE1XkEyXkFqcGdeQXVyMTA5ODEyNTc5._V1_.jpg",
  "description": "Having pulled off an escape from Tweedy&apos;s farm, Ginger has found a peaceful island sanctuary for the whole flock. But back on the mainland the whole of chicken-kind faces a new threat, and Ginger and her team decide to break in.",
  "review": {
    "author": "charles-limcw",
    "dateCreated": "2023-12-20",
    "inLanguage": "English",
    "heading": "Same Mistakes as Early Man",
    "reviewBody": "Looks like the creators didn&apos;t learn anything from the failure of Early Man (2018). A successful family animation needs to engage folks of any and all ages - the first Chicken Run did to a good extent. This one didn&apos;t. Ditto Early Man.\n\nAudiences want to see relatable settings, characters with soul, plots that are realistically challenging (not pointlessly ridiculous). So we end up with a colourful bland bright happy island commune ... overdone, unrelatable and boring. Then we get a silly super high tech robots and gadgets filled chicken farm/factory - huh? And football matches in prehistoric Early Man? Huh?\n\nFrom the short documentary on &apos;the making of&apos; its immediately clear the creators and team spent a massive 99% effort on the puppeting, the sets, the lighting, the movements, the look of things - which is fine, except, where&apos;s the effort on the story, the characters, the soul of the whole thing??\n\nThe director even laughed at how fun it was to give Ms Tweedy a glam look - but hello mister - did you ask yourself what the viewers want out of a once iconic scary evil character like her? A glam up look? Really?\n\nIt does seem all the people involved in this - many very competent in their area of specialty - was more focused on putting out their best on producing their area of specialty than making an animated movie that truly relates to the audience.\n\nFor instance so much technical deal and effort was made of Tweedy walking down glass steps - if the story and plotting was better it wouldn&apos;t have mattered if she was walking down milk carton cutouts with average lighting and a less smooth gait.\n\nDo please spend more thought and effort on plotting and characters and audience impact, and less on the visual razzle dazzle.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 16684,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2023-12-08",
  "keywords": "animal protagonist,mother daughter relationship,animal sanctuary,chicken,stop motion",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "Thandiwe Newton",
      "url": "https://www.imdb.com/name/nm0628601/"
    },
    {
      "name": "Zachary Levi",
      "url": "https://www.imdb.com/name/nm1157048/"
    },
    {
      "name": "Bella Ramsey",
      "url": "https://www.imdb.com/name/nm8165602/"
    }
  ],
  "director": [
    {
      "name": "Sam Fell",
      "url": "https://www.imdb.com/name/nm0271402/"
    }
  ],
  "creator": [
    {
      "name": "Karey Kirkpatrick",
      "url": "https://www.imdb.com/name/nm0456732/"
    },
    {
      "name": "John O&apos;Farrell",
      "url": "https://www.imdb.com/name/nm0640976/"
    },
    {
      "name": "Rachel Tunnard",
      "url": "https://www.imdb.com/name/nm2074041/"
    }
  ]
}