{
  "type": "Movie",
  "name": "Crater",
  "url": "https://www.imdb.com/tt5264838/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOGRiZGU0NzUtZTcyYy00MjU4LThiMWYtOTI1OTkyNGM5MTcwXkEyXkFqcGdeQXVyMTQzNTA5MzYz._V1_.jpg",
  "description": "After the death of his father, a boy growing up on a lunar mining colony takes a trip to explore a legendary crater, along with his four best friends, prior to permanently leaving the Moon and relocated to another planet.",
  "review": {
    "author": "flingebunt",
    "dateCreated": "2023-05-23",
    "inLanguage": "English",
    "heading": "Neat little kids SciFi movie",
    "reviewBody": "A group of kids steal a rover on the moon to travel to a crater where a secret is waiting for one of them. They will have adventures and face dangers on their way while learning more about the world they live on and the world that their parents or grandparents came from.\n\nThe beauty of this movie is it is about kids living in a future that is negative. They learned nothing about the Earth at school, they see no great future for them because their parents and then themselves will be forced into basically bonded labour contracts with unfair conditions that are almost impossible to escape.\n\nYet the movie ends on a hopeful note, even if they are no revolutionaries. Yes, a lot of the moon stuff and physics is all wrong, but the reality of the feelings and story are important. These are kids and the story is grounded at their level.\n\nNot sure why there are negative reviews. Maybe it is the adults watching what is a kids movies. Maybe it is parents upset that the movie is negative. Perhaps the pacing is too slow for modern kids. Not sure, but still should be better regarded than it is.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 3933,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": "9+",
  "genre": [
    "Adventure",
    "Drama",
    "Sci-Fi"
  ],
  "datePublished": "2023-05-12",
  "keywords": "death,space,coming of age,friend,father",
  "duration": "PT1H45M",
  "actor": [
    {
      "name": "Isaiah Russell-Bailey",
      "url": "https://www.imdb.com/name/nm9424018/"
    },
    {
      "name": "Mckenna Grace",
      "url": "https://www.imdb.com/name/nm5085683/"
    },
    {
      "name": "Billy Barratt",
      "url": "https://www.imdb.com/name/nm7811397/"
    }
  ],
  "director": [
    {
      "name": "Kyle Patrick Alvarez",
      "url": "https://www.imdb.com/name/nm1547859/"
    }
  ],
  "creator": [
    {
      "name": "John Griffin",
      "url": "https://www.imdb.com/name/nm7650310/"
    }
  ]
}