{
  "type": "Movie",
  "name": "Dark Harvest",
  "url": "https://www.imdb.com/tt9204328/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTk0ODg3N2EtMmE5NC00MTRiLWExMzAtMDgyNDFjYWZmM2ViXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_.jpg",
  "description": "In a small Midwestern town, a deadly annual ritual unfolds when the mythical nightmare, Sawtooth Jack, rises from the cornfields and challenges the town’s teenage boys in a bloody battle of survival.",
  "review": {
    "author": "IonicBreezeMachine",
    "dateCreated": "2023-10-14",
    "inLanguage": "English",
    "heading": "A fun take on folk horror that&apos;s rich in atmosphere and well-acted, even if it&apos;s very familiar and not overtly scary.",
    "reviewBody": "Set in the town of Bastion, Illinois, every Halloween an entity known as Sawtooth Jack (Dustin Ceithamer) with the head of a pumpkin and a heart of sweets comes from the cornfields with its ultimately end goal to reach the church in the center of town before midnight which will bring a blight upon the town. In the days leading up to his arrival, all the older teenage male citizens of the town are locked in their rooms and starved for several days until they take part in a run where they go about the streets of Bastion and hunt down Sawtooth Jack with the winner garnering wealth and prestige for one&apos;s family as well as a car and means to leave the town behind. Richie Shepherd (Casey Likes) decides to take part in the run despite it being against the rules as his older brother Jim (Britain Dalton) won last year with Ritchie now seen as a black sheep by the community including Officer Jerry Ricks (Luke Kirby) who enforces the rules of the run. As the run approaches, Ritchie teams with Kelly Haines (E&apos;myri Crutchfield) to take part in the run and uncovering the truth behind its origins.\n\nDark Harvest is an adaptation of the 2006 horror novel by Norman Partridge. The film was initially setup at New Regency under the direction of David Slade with Michael Gilio writing the adaptation until the project was put into turnaround and saw it wind up at MGM. While initially intended for a September 2021 release, the film was rescheduled and pulled from its release twice with the first time being due to the Covid-19 pandemic and the second time being without explanation. The movie&apos;s had a very quiet release with a one night only run at the Alamo Drafthouse followed by a digital release. As this will be the last film to be distributed under the MGM logo, it&apos;s most likely been a victim of the recent Amazon acquisition of MGM and is probably being burned off to fulfill contractual obligations hence why it hasn&apos;t been given a major push. Watching Dark Harvest, it really is a shame it&apos;s not getting its due because it&apos;s a solid small town folk horror that I really enjoyed.\n\nFrom the 1960s period and rural Illinois setting, Dark Harvest does a solid job of establishing that small town midwestern vibe you look for in a movie like this. The movie plays like a mixture of The Wicker Man, Pumpkinhead, and a seasoning of Stephen King&apos;s The Long Walk with a seasoning of The Purge and there&apos;s a lot of unapologetic bloody carnage that takes place in the hunt for Sawtooth Jack. Casey Likes and E&apos;myri Crutchfield do a solid job as first time feature leads and you do care about them as characters. Admittedly I was never scared by Dark Harvest and from the opening where Jim Shepherd drives off I had a pretty good idea of where the movie would be going from that point, but for the most part I was kept engaged with the story as Slade and Gilio keep the pacing tight and focused so it never felt like it was dragged out.\n\nIt&apos;s honestly a shame that Dark Harvest got lost in the shuffle during the Amazon/MGM merger because it&apos;s an entertaining small scale genre film that&apos;s well-made and solidly acted. While it&apos;s no genre breakout or anything I enjoyed it about as much or better than Scary Stories to Tell in the Dark adaptation from a few years ago and I do hope the film manages to find an audience.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 5522,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.5
  },
  "contentRating": "15",
  "genre": [
    "Fantasy",
    "Horror"
  ],
  "datePublished": "2023-10-13",
  "keywords": "cornfield,teenager,young,teenage boy,young boy",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Casey Likes",
      "url": "https://www.imdb.com/name/nm4607828/"
    },
    {
      "name": "Emyri Crutchfield",
      "url": "https://www.imdb.com/name/nm6957616/"
    },
    {
      "name": "Dustin Ceithamer",
      "url": "https://www.imdb.com/name/nm9222037/"
    }
  ],
  "director": [
    {
      "name": "David Slade",
      "url": "https://www.imdb.com/name/nm1720541/"
    }
  ],
  "creator": [
    {
      "name": "Michael Gilio",
      "url": "https://www.imdb.com/name/nm0318580/"
    },
    {
      "name": "Norman Partridge",
      "url": "https://www.imdb.com/name/nm1636638/"
    }
  ]
}