{
  "type": "Movie",
  "name": "Flora and Son",
  "url": "https://www.imdb.com/tt25471950/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZGUwODA1NGEtMzY4My00Y2FlLTg4NzMtMTNiNDQ1MGY2NDQyXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
  "description": "A single mom at war with her son is trying to find a hobby for him. One day, she rescues a guitar from a dumpster.",
  "review": {
    "author": "gortx",
    "dateCreated": "2023-10-17",
    "inLanguage": "English",
    "heading": "Sweet drama with humor and music",
    "reviewBody": "Irish Writer-Director John Carney specializes in music-based movies (ONCE, SING STREET), so it&apos;s no surprise that his latest, FLORA AND SON, has a similar theme.\n\nA foul-mouthed single mom, Flora (a sprightly Eve Hewson), lives in a tiny Dublin flat with her equally malcontent child, the troubled Max (Orén Kinlan). The boys father, Ian (Jack Reynor) is in and out of the family picture. Through happenstance, Flora comes to acquire an acoustic guitar and encourages her son to pick up the instrument, but he&apos;s far more interested in electronic music.\n\nInstead of chucking it, Flora begins taking online private lessons from a handsome overseas musician, Jeff (Joseph Gordon-Levitt at his most engaging). A good part of the movie is just Flora and Jeff exchanging online. Carney finds a way to open things up so that it&apos;s not all just laptop screen shots, fostering more immediacy, not to mention emphasizing their growing emotional bond.\n\nFLORA AND SON is well-acted and some of the original music plays well on screen. Carney&apos;s script is a bit bumpy at times as it tries to work out the various relationships. It has a sweet core to it, and a cheeky wit that makes it an enjoyable little tune.\n\nP. S. Listen carefully to the last line delivered as the movie fades out for one last laugh.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 10669,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Music",
    "Romance"
  ],
  "datePublished": "2023-09-29",
  "keywords": "reference to topanga canyon los angeles,pawnshop,bass guitar player,ireland,single mother",
  "duration": "PT1H37M",
  "actor": [
    {
      "name": "Eve Hewson",
      "url": "https://www.imdb.com/name/nm2016723/"
    },
    {
      "name": "Joseph Gordon-Levitt",
      "url": "https://www.imdb.com/name/nm0330687/"
    },
    {
      "name": "Orén Kinlan",
      "url": "https://www.imdb.com/name/nm10264055/"
    }
  ],
  "director": [
    {
      "name": "John Carney",
      "url": "https://www.imdb.com/name/nm0138809/"
    }
  ],
  "creator": [
    {
      "name": "John Carney",
      "url": "https://www.imdb.com/name/nm0138809/"
    }
  ]
}