{
  "type": "Movie",
  "name": "God Is a Bullet",
  "url": "https://www.imdb.com/tt14270702/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzhlYTg4ZmItMDBmYi00NTMzLTg3M2MtMGU2NDM0ODY1NDVkXkEyXkFqcGdeQXVyMDc5ODIzMw@@._V1_.jpg",
  "description": "Taking matters into his own hands, Detective Bob Hightower tries to infiltrate an evil cult to save his kidnapped daughter and avenge the murder of his wife.",
  "review": {
    "author": "Top_Dawg_Critic",
    "dateCreated": "2023-07-15",
    "inLanguage": "English",
    "heading": "This nonsense was originally 156 minutes? I saw the 120 min version, so thank God I dodged that Bullet!",
    "reviewBody": "What I saw was a great story ruined by amateur-hour filmmaking. Shockingly, Nick Cassavetes - the same guy who directed The Notebook, directed this mess. You&apos;re supposed to get better the more films you make, not worse. A fifth grade drama class could&apos;ve come up with a better production.\n\nThis was so poorly and lazily directed and written, it was riddled with plot and technical issues. It was tedious and exhausting without enough emotional depth, nuance or palpable suspense. It&apos;s a grimy, violent exploitation movie dressed up pretending it has something to say, yet fails to yield any visceral emotional impact. Even some of the dialogue was absolute nonsense, moronic and cringe, worthy of eyerolls.\n\nThere were so many filmmaking errors, they started off as hilarious, then became annoying. At about the midway part of the (two hour) film, the scenes where Case and Bob are in the pick-up, Case&apos;s nose cut and black eyes vanished for a couple of camera angles, then magically re-appeared. Then we&apos;re supposed to believe that Nikolaj&apos;s character got all these tattoos in one sitting, and they all healed with no redness or scars. It doesn&apos;t get any more lazy and amateur-hour filmmaking than that. Even the action scenes at the end where laughable and defied logic and reasoning. The filmmaking also lacked urgency, was bloated, boring for the most part, and poorly paced. I pity those that had to sit trough the longer version of this nonsense.\n\nAside from the outstanding performances, and decent cinematography and score, this was a huge misfire plagued by amateur-hour and lazy filmmaking. God Is a Bullet may be loaded, but it&apos;s only firing blanks. Too bad a better filmmaker wasn&apos;t hired to make this film, it had tons of promise with its based-on-true-events story.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 4749,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "contentRating": "18+",
  "genre": [
    "Action",
    "Crime",
    "Horror"
  ],
  "datePublished": "2023-06-23",
  "keywords": "profanity,female rear nudity,god in title,f word,police station",
  "duration": "PT2H36M",
  "actor": [
    {
      "name": "Maika Monroe",
      "url": "https://www.imdb.com/name/nm2140860/"
    },
    {
      "name": "Nikolaj Coster-Waldau",
      "url": "https://www.imdb.com/name/nm0182666/"
    },
    {
      "name": "Karl Glusman",
      "url": "https://www.imdb.com/name/nm3194762/"
    }
  ],
  "director": [
    {
      "name": "Nick Cassavetes",
      "url": "https://www.imdb.com/name/nm0001024/"
    }
  ],
  "creator": [
    {
      "name": "Boston Teran",
      "url": "https://www.imdb.com/name/nm2181517/"
    },
    {
      "name": "Nick Cassavetes",
      "url": "https://www.imdb.com/name/nm0001024/"
    }
  ]
}