{
  "type": "Movie",
  "name": "Jesus Revolution",
  "url": "https://www.imdb.com/tt10098448/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjQ4M2JiMTEtNDhiMi00OWM1LTkwMWEtODdjYTQxNWQyOTFiXkEyXkFqcGdeQXVyMjMxOTE0ODA@._V1_.jpg",
  "description": "The true story of a national spiritual awakening in the early 1970s and its origins within a community of teenage hippies in Southern California.",
  "review": {
    "author": "ThereelscoopwithKK",
    "dateCreated": "2023-03-01",
    "inLanguage": "English",
    "heading": "Soothing For the Soul and Beautiful",
    "reviewBody": "Even if religion isn&apos;t an important part of your life this movie is spectacular in many ways. It begins with two different storylines which connect together seamlessly. The aspect of it that it excels in the most is that it shows how groups of people who appear to be pushing in two different directions can both be genuinely searching for the same goals and the good life. The movie examines the pitfalls of nihilism and absolute relativism but also how being closed minded to possibilities and ideas can be limiting. All of these themes are displayed without the movie trying to force upon its audience any particular set of religious beliefs.\n\nNot only does the story have good pacing, it has just the right amount of humour, and the camera shots of the California coast are nostalgic and stunning. The acting is also quite good with Kelsey Grammer and Jonathan Roumie both delivering exceptional performances . The love story also feels reasonably organic and the soundtrack on its own is 10/10.\n\nThe only downside to it for me was that some scenes needed a bit more variety in their presentation. The latter half of the film seemed mostly filled with what I would call epic speech making and not so much natural dialogue. For those like myself who were fully engaged in the story this probably wouldn&apos;t be an issue, but for those not particularly enjoying themselves it could come across as rather corny and artificial.\n\nOverall, I am a huge fan of this movie. I think it has a wonderful message of hope and love while also encouraging order and structure. I&apos;d recommend it to anyone looking for a feel good movie that sends you away feeling optimistic.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 12761,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "12A",
  "genre": [
    "Drama"
  ],
  "datePublished": "2023-06-23",
  "keywords": "community,docudrama drama,jesus in title,christianity,counterculture",
  "duration": "PT2H",
  "actor": [
    {
      "name": "Joel Courtney",
      "url": "https://www.imdb.com/name/nm1525807/"
    },
    {
      "name": "Jonathan Roumie",
      "url": "https://www.imdb.com/name/nm0745751/"
    },
    {
      "name": "Kimberly Williams-Paisley",
      "url": "https://www.imdb.com/name/nm0931090/"
    }
  ],
  "director": [
    {
      "name": "Jon Erwin",
      "url": "https://www.imdb.com/name/nm2296528/"
    },
    {
      "name": "Brent McCorkle",
      "url": "https://www.imdb.com/name/nm3634546/"
    }
  ],
  "creator": [
    {
      "name": "Ellen Vaughn",
      "url": "https://www.imdb.com/name/nm3310472/"
    },
    {
      "name": "Greg Laurie",
      "url": "https://www.imdb.com/name/nm1960111/"
    },
    {
      "name": "Jon Gunn",
      "url": "https://www.imdb.com/name/nm0348197/"
    }
  ]
}