{
  "type": "Movie",
  "name": "Landscape with Invisible Hand",
  "url": "https://www.imdb.com/tt7645334/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzdmN2U5MmMtNDk5Mi00NzFmLWI5N2QtOWY5ODQwODk2NzYzXkEyXkFqcGdeQXVyODk2NDQ3MTA@._V1_.jpg",
  "description": "When an occupying alien species&apos; bureaucratic rule and advanced technology leaves most of Earth impoverished and unemployed, two teenagers hatch a risky plan to ensure their families&apos; futures.",
  "review": {
    "author": "ckand",
    "dateCreated": "2023-11-15",
    "inLanguage": "English",
    "heading": "An allegory for modern capitalism",
    "reviewBody": "The Vuvv represent all the worst aspects of modern, neo-liberal capitalism, imposing a world order in which one can only survive by being their direct servants, their paid mouthpieces (and they&apos;ll alter your message or art to make sure its acceptable), or by underbidding everyone else to sell one&apos;s labor, although that last option leaves you and yours only barely scraping by.\n\nUnions are obviously a thing of the past, and cultural imperialism is being implemented to assimilate humans into the Vuvv way. It&apos;s all straight out of the playbooks of the World Bank and the International Monetary Fund, Reason and The Economist, The Cato Institute and more think tanks than you could shake a stick at. Unfortunately for humanity, the Vuvv breath life into a theory and practice of neo-liberalism, whether it&apos;s called Reaganism, Thatcherism or Blairism, that is intellectually and empirically worn out, and can now only be implemented by fascists wearing a populist face.\n\nIn other words, Landscape with Invisible Hand stands in the grand tradition of Star Trek and The Twilight Zone, hiding themes and messages meant for today behind science fiction trappings. Overall, it&apos;s a good film, and a nice break from dystopian fiction in the style of A Quite Place, The Walking Dead and The Rest of Us.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 2385,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "R",
  "genre": [
    "Comedy",
    "Drama",
    "Sci-Fi"
  ],
  "datePublished": "2023-11-17",
  "keywords": "interracial relationship,alien,future,planet,exploration",
  "duration": "PT1H45M",
  "actor": [
    {
      "name": "Asante Blackk",
      "url": "https://www.imdb.com/name/nm10040186/"
    },
    {
      "name": "Tiffany Haddish",
      "url": "https://www.imdb.com/name/nm1840504/"
    },
    {
      "name": "Kylie Rogers",
      "url": "https://www.imdb.com/name/nm4814017/"
    }
  ],
  "director": [
    {
      "name": "Cory Finley",
      "url": "https://www.imdb.com/name/nm8083973/"
    }
  ],
  "creator": [
    {
      "name": "Cory Finley",
      "url": "https://www.imdb.com/name/nm8083973/"
    },
    {
      "name": "M.T. Anderson",
      "url": "https://www.imdb.com/name/nm2422917/"
    }
  ]
}