{
  "type": "Movie",
  "name": "Monica",
  "url": "https://www.imdb.com/tt6337816/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjAxMWI4MzEtNjA5MC00NjM5LWFmN2YtMWZiYzY3ZDZhM2EwXkEyXkFqcGdeQXVyMTU3NDU4MDg2._V1_.jpg",
  "description": "The intimate portrait of a woman who returns home to care for her dying mother. A delicate and nuanced story of a fractured family, the story explores universal themes of abandonment, aging, acceptance, and redemption.",
  "review": {
    "author": "rksharp",
    "dateCreated": "2023-05-25",
    "inLanguage": "English",
    "heading": "Captured Caregiving In An Estranged Family With Haunting Accuracy",
    "reviewBody": "This movie was so poignant to me that I&apos;m having a hard time putting my review into words. I feel like I can&apos;t possibly write my review well enough to give this movie the credit it deserves.\n\nHaving been a family caregiver several times, I was amazed at the accuracy with which the caregiving experience was captured, especially in an estranged family. Trace Lysette played the role of Monica so well that I could feel the sadness, reluctance and discomfort of returning home to an ill mother in a family who hadn&apos;t been accepting of her. I&apos;ve felt those feelings, so I was very aware of how well she was portraying them. I&apos;m also familiar with the forgiveness she brought to the loving care of her mother and how she extended that to the rest of the family, especially her nieces and nephews - familiar because of how well Trace played the role.\n\nI was also amazed by how well Patricia Clarkson played the role of. Eugenia. There were several scenes that brought me to tears, because they were so familiar in my own caregiver experience.\n\nIn addition to the excellent acting throughout the movie, I was really impressed with the work of the art department. The way the family home was presented was so reminiscent of an elderly family members home with so many memories displayed, reminisced about, and how the young children interacted in the home. One of the most powerful moments was when the abandoned swimming pool was shown and discussed. Caregivers always have more than they can handle and something/some things always end up getting neglected. That was portrayed so vividly and accurately that I found myself flashing back to encounters I had with neighbors and others who didn&apos;t understand that life and death issues were allowing that decay.\n\nI&apos;m going to be discreet in presenting this topic, because I don&apos;t want to introduce a spoiler, but one scene of Brody&apos;s play let me know that he might be facing the same thing Monica had faced that led to her estrangement from the family. Monica giving Brody the item that had long given her strength symbolized to me her giving the child her strength and ensuring that.just as the family had been healing while she was there, she would make sure that healing continued into the next generation so that Brody would never feel alone as she had felt alone.\n\nThis is so feeble of an attempt to describe this very powerful and impactful movie, but I hope it is good enough.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 1076,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "R",
  "genre": [
    "Drama"
  ],
  "datePublished": "2023-12-15",
  "keywords": "male frontal nudity,male nudity,transgender,transgender woman,female nudity",
  "duration": "PT1H46M",
  "actor": [
    {
      "name": "Trace Lysette",
      "url": "https://www.imdb.com/name/nm6006903/"
    },
    {
      "name": "Patricia Clarkson",
      "url": "https://www.imdb.com/name/nm0165101/"
    },
    {
      "name": "Emily Browning",
      "url": "https://www.imdb.com/name/nm0115161/"
    }
  ],
  "director": [
    {
      "name": "Andrea Pallaoro",
      "url": "https://www.imdb.com/name/nm1761524/"
    }
  ],
  "creator": [
    {
      "name": "Andrea Pallaoro",
      "url": "https://www.imdb.com/name/nm1761524/"
    },
    {
      "name": "Orlando Tirado",
      "url": "https://www.imdb.com/name/nm3239838/"
    }
  ]
}