{
  "type": "Movie",
  "name": "My Big Fat Greek Wedding 3",
  "url": "https://www.imdb.com/tt21103300/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMDcyZTJmNmEtYzAyMS00MWZmLWFhZmItMmM2MTFiMjQyOTgwXkEyXkFqcGdeQXVyMTM1NjM2ODg1._V1_.jpg",
  "description": "After the death of the family&apos;s patriarch, Toula attempts to locate her father&apos;s childhood friends in Greece for a family reunion.",
  "review": {
    "author": "AngelHonesty",
    "dateCreated": "2023-09-17",
    "inLanguage": "English",
    "heading": "Massive Disappointment",
    "reviewBody": "I had a hard time sitting through the entire movie. It was that bad. Almost cringe worthy. I loved the original, it&apos;s one of my favorites. So after watching part three I was greatly let down.\n\nEven though it&apos;s the original cast there was no heart in the film. Everyone felt like strangers. There was no connection. They tried to make it funny but it felt forced and scripted. The music did not help either, it was out of place. Everything about the movie felt empty. The lines really didn&apos;t help.\n\nFor being in the home country there wasn&apos;t enough drama or loudness. And I think that was because there wasn&apos;t enough people. Having a dead town did not help. The plot was thin and there really wasn&apos;t much to the movie. The one wedding that they did have, I didn&apos;t feel much for the couple, didn&apos;t really know them or care about them. I honestly thought for a moment there they were going to have a lesbian couple with the vibes they were giving off, but that turned out to be nothing. Which again was confusing.\n\nThey had the wrong actress for the daughter. She felt like a complete stranger. Nothing about her was likeable or relatable. And the drama of her love life feels so empty. And almost confusing. To the point where I am asking what is this?",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 7169,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.2
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2023-09-08",
  "keywords": "sequel,third part,greece,family relationships,non binary",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Nia Vardalos",
      "url": "https://www.imdb.com/name/nm0889522/"
    },
    {
      "name": "John Corbett",
      "url": "https://www.imdb.com/name/nm0179173/"
    },
    {
      "name": "Louis Mandylor",
      "url": "https://www.imdb.com/name/nm0541909/"
    }
  ],
  "director": [
    {
      "name": "Nia Vardalos",
      "url": "https://www.imdb.com/name/nm0889522/"
    }
  ],
  "creator": [
    {
      "name": "Nia Vardalos",
      "url": "https://www.imdb.com/name/nm0889522/"
    }
  ]
}