{
  "type": "Movie",
  "name": "Outlaw Johnny Black",
  "url": "https://www.imdb.com/tt8667828/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNjhkZjFjNDEtNGU5ZC00Njg1LThjNWEtZGU1ZTkxZjJlODE4XkEyXkFqcGdeQXVyMTAxNzQ1NzI@._V1_.jpg",
  "description": "Hell bent on avenging the death of his father, Johnny Black vows to gun down Brett Clayton and becomes a wanted man in the process while posing as a preacher in a small mining town that&apos;s been taken over by a notorious Land Baron.",
  "review": {
    "author": "nicolasroop",
    "dateCreated": "2023-09-18",
    "inLanguage": "English",
    "heading": "Unfortunately, Michael Jai White&apos;s charm was not enough to pull it off",
    "reviewBody": "Here is a movie that I struggled with. Michael Jai White is a talented actor and martial artist. One thing he is not is a talented writer or director, and it shows with this new film.\n\nOn one hand, you have some incredibly funny jokes that even had my small viewing audience busting a gut. Michael Jai White has a great sense of timing when it comes to his delivery and it works in the films favor.\n\nOn the other hand, the story is bloated, with about 2 storylines too many. It really bogged the film down and helped contribute to that extremely excessive runtime. Halfway through, I was hoping for the ending, but there was still over an hour of the film left to watch. I, at times, similarly with Black Dynamite. Although that production had much more going on than this film did, but still knew when to cut it and when to let it roll.\n\nAs far as his directing talents go, I was vastly more impressed in the first half of the film than I was for the last. It was almost like he gave up on trying to do anything artistic behind the camera and the film just became a strict point and shoot type of production.\n\nThe movie is also very racist toward native americans. The lack of respect shown to the culture is jarring, even when presented in a comedic format such as this. The only joke I could get behind was all of the native americans were played by anybody who was not actually native american and this was to parody that fact from the old spaghetti westerns. Very clever, Mr. White. But other than that, it was very racist and not very funny.\n\nOverall, I enjoyed the film in parts. However, it was too long and feature some pretty relaxed racism towards native americans that I&apos;m sure didn&apos;t connect in the way that Mr. White had intended. A pity because with some editing and a few tweaks to the screenplay, this could&apos;ve been comedic gold. I really hope Black Dynamite 2 doesn&apos;t turn out like this one did.\n\n2 outlaws out of 5.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 901,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "contentRating": "12",
  "genre": [
    "Action",
    "Comedy",
    "Western"
  ],
  "datePublished": "2023-09-15",
  "keywords": "wild west,blaxploitation,1970s,cowboys and indians,epic action",
  "duration": "PT2H17M",
  "actor": [
    {
      "name": "Michael Jai White",
      "url": "https://www.imdb.com/name/nm0925220/"
    },
    {
      "name": "Anika Noni Rose",
      "url": "https://www.imdb.com/name/nm0741242/"
    },
    {
      "name": "Erica Ash",
      "url": "https://www.imdb.com/name/nm1404359/"
    }
  ],
  "director": [
    {
      "name": "Michael Jai White",
      "url": "https://www.imdb.com/name/nm0925220/"
    }
  ],
  "creator": [
    {
      "name": "Byron Minns",
      "url": "https://www.imdb.com/name/nm0591528/"
    },
    {
      "name": "Michael Jai White",
      "url": "https://www.imdb.com/name/nm0925220/"
    }
  ]
}