{
  "type": "Movie",
  "name": "Poor Things",
  "url": "https://www.imdb.com/tt14230458/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjJmNmQ1MTAtYTRlNi00YjZlLTg4NmQtZjk1Yzk2MTdmYTA1XkEyXkFqcGdeQXVyMTMzOTQyOTk1._V1_.jpg",
  "description": "The incredible tale about the fantastical evolution of Bella Baxter; a young woman brought back to life by the brilliant and unorthodox scientist, Dr. Godwin Baxter.",
  "review": {
    "author": "kjproulx",
    "dateCreated": "2024-01-06",
    "inLanguage": "English",
    "heading": "The Weirdest Masterpiece I&apos;ve Seen in Many Years",
    "reviewBody": "For the reason that I&apos;m completely unsure who this film is aimed at (aside from film lovers like myself), I will not be recommending this one, but I&apos;ll also state that this is one of my favourite films in years. If that intrigues you, then maybe Poor Things is your cup of tea. Yorgos Lanthimos is a director with a clear vision that I deeply admire. I don&apos;t love all of his work, but the worst I can say about any of his films is that I appreciate them. Well, Poor Things just jumped to the top of my list of favourite Lanthimos pictures. This is a pure work of art, in the weirdest, most bizarre way possible. I&apos;m still trying to wrap my head around the brilliance of Poor Things. Let&apos;s dive right in.\n\nThe film begins as Dr. Godwin Baxter (Willem Dafoe) finds the dead body of a pregnant woman. After taking her corpse to his lab, he makes an incision and removes the baby from her body. He then takes out the woman&apos;s brain and replaces it with her baby&apos;s brain. Then, much like in the style of Frankenstein, he reanimates the body and she comes to life. He refers to her as Bella (Emma Stone) and refuses to let her leave home. Much like an infant, Bella learns to walk, speak, and also learns every detail of her body. Upon meeting Duncan Wedderburn (Mark Ruffalo), the two of them form a connection and flock away to roam the world together and get very intimate. That&apos;s the jist of what sets this film in motion, so if that already turns you off, I would recommend not watching it.\n\nIf you&apos;re still intrigued, well then this film is a masterpiece. This story is told in a very unique style. As they visit real places in the world, it&apos;s done in an incredibly artistic and surreal way. This film is aware that the premise is impossible, so it makes the visuals and details match the absurdity and I couldn&apos;t get enough of it. The production designers, art directors, set decorator, costume designer, and the makeup department all deserve endless praise for their work here. They brought Lanthimos&apos; vision to life in stunning fashion. The look of this film blew me away, on top of me already loving the wackiness of the story.\n\nHonestly, all I want to do is gush about this film. The camerawork, the score, every performance, and even the incredibly worded dialogue all just made this a remarkable achievement. Emma Stone deserves an Oscar for her performance here too. I haven&apos;t seen such an odd performance done this well and this committed in quite some time. She&apos;s a true revelation here and her chemistry with Mark Ruffalo was hilarious. He also deserves all of the recognition he&apos;s receiving for this.\n\nPoor Things is a very rare kind of filmmaking that doesn&apos;t come around very often. Yes, it&apos;s weird beyond what words could ever describe and I even watched a couple of people walk out of my screening, but I just can&apos;t feel that way. The craft onscreen is undeniable and I could only dream of ever being able to make a film this masterful. In every conceivable way, I believe this is my favourite film of 2023. If you&apos;re someone who is up for watching anything and willing to give anything a shot, I seriously can&apos;t recommend this film enough. I&apos;m currently adding it to my list of favourites, ever.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 20417,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 8.5
  },
  "contentRating": "R",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2024-01-12",
  "keywords": "scientist,female full frontal nudity,female topless nudity,female masturbation,doctor",
  "duration": "PT2H21M",
  "actor": [
    {
      "name": "Emma Stone",
      "url": "https://www.imdb.com/name/nm1297015/"
    },
    {
      "name": "Mark Ruffalo",
      "url": "https://www.imdb.com/name/nm0749263/"
    },
    {
      "name": "Willem Dafoe",
      "url": "https://www.imdb.com/name/nm0000353/"
    }
  ],
  "director": [
    {
      "name": "Yorgos Lanthimos",
      "url": "https://www.imdb.com/name/nm0487166/"
    }
  ],
  "creator": [
    {
      "name": "Tony McNamara",
      "url": "https://www.imdb.com/name/nm1110111/"
    },
    {
      "name": "Alasdair Gray",
      "url": "https://www.imdb.com/name/nm1206865/"
    }
  ]
}