{
  "type": "Movie",
  "name": "Priscilla",
  "url": "https://www.imdb.com/tt22041854/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOTQyZTBiMjAtZTNjZi00ZjU0LWFkMTQtMDE3Nzc1MjVmMTM4XkEyXkFqcGdeQXVyMTM1NjM2ODg1._V1_.jpg",
  "description": "When teenage Priscilla Beaulieu meets Elvis Presley, the man who is already a meteoric rock-and-roll superstar becomes someone entirely unexpected in private moments: a thrilling crush, an ally in loneliness, a vulnerable best fri...",
  "review": {
    "author": "elicopperman",
    "dateCreated": "2023-11-14",
    "inLanguage": "English",
    "heading": "The Disturbing Reality behind the King&apos;s Wife",
    "reviewBody": "Before Elvis Presley&apos;s daughter Lisa Marie passed away earlier this year, she was quite contemptuous over Sofia Coppola&apos;s portrayal of her parents in her biographical feature Priscilla. Based on Priscilla Presley&apos;s 1985 memoir Elvis and Me, the film has nonetheless garnered mostly positive reviews and even earned Cailee Spaeny the Volpi Cup for Best Actress at the 2023 Venice Film Festival. Given that Priscilla herself was an executive producer on this project, it&apos;s best to look at this project at a more earnest portrayal of Elvis and Priscilla instead of it being romanticized or sugar coated.\n\nNow as this film depicts the courtship between a then 14 year old Priscilla and a then 24 year old Elvis, the biggest takeaway from this feature is that it&apos;s supposed to comment more on the idea of love being difficult to obtain as the wife of a global superstar. While it does depict a taboo romantic subject in mind, it becomes far more toxic when Elvis proves to be far more manipulative and abusive than his rockstar persona claims otherwise. Cailee Spaeny and Jacob Elordi share quite a conflicting bond as their depictions show a more disturbing underbelly to what the public thought of the Presleys otherwise. Coppola makes sure to emphasize the unfortunate implications behind their relationship without directly endorsing it, especially as we can see how much the spousal torment and jadedness behind the life of fame creates more misery in Priscilla than to the people worried for her like her parents and socialites. Behind all the rock & roll, glamour and pizazz lies a hollow marriage where one is no longer illusioned to much of anything, be it romance or appreciation for the music.\n\nThat being said, outside of the disturbing implications behind Priscilla and Elvis&apos; courtship, there really isn&apos;t much else to take away from the movie. By putting so much of Priscilla&apos;s perspective into the limelight, the portrayal of her husband isn&apos;t interesting enough to dissect beyond him being a fake charming guy who more so likes the idea of a soul mate instead of actually being with one consistently. It doesn&apos;t help that the film rushes certain plot points just to get to Presley&apos;s life of prestige, such as Priscilla&apos;s time with her rightfully concerned family, her trouble focusing in school and even the implied drug addictions she and her husband faced. Despite that latter key point playing a big role in Elvis&apos; abusive behavior, it isn&apos;t explored enough to leave much of a dramatic impact. In fact, for a film that tries to incorporate themes of domestic abuse, it feels surprisingly lacking in showing much of that tension. Also, once the film ends, it feels as if it missed the opportunity to go more into Priscilla&apos;s life after leaving Elvis for good, almost as if it felt it didn&apos;t need to tell more when it should have.\n\nOutside of those qualities, the filmmaking is competent enough yet never rises above decently well crafted in depicting the era of subject. The cultural aesthetic of the late 50s and early to mid 60s feels more tact on for the sake of the time period, as outside of some of the road shows and projects Elvis is apart of, only the costuming sticks out the most, and yet the film hardly does much with them to make much of an impression. If anything, the pop cultural influence from this era feels more like an accompaniment to the story than really playing much of a role beyond the media playing up Elvis&apos; life as more than it really is. Also, the lack of much of a background score surprisingly doesn&apos;t work as most of the scenes play out with an awkward tension that would have benefited from more than just what&apos;s on the soundtrack. Speaking of which, for some reason there are all kinds of retro and contemporary rock and jazz songs except from the king himself. Perhaps given the involvement of Priscilla Presley and her ex-husband&apos;s enterprises, this comes off as understandable yet confusing.\n\nSo while made with earnest intentions and captivating performances, Priscilla is a decent enough biopic that falls flat in exploring more about its subject matter beyond superficial love and all the glitz and glamour that comes with it. I would recommend this on the grounds that it&apos;s more interesting than it is thought provoking, though definitely take that for what it&apos;s worth given how much influence was done by the target at hand. Besides, even if the king is no longer looked at the same way he was then, projects like these are good reminders to not look up to everyone you admire, let alone fall for.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 15267,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama",
    "Music"
  ],
  "datePublished": "2024-01-01",
  "keywords": "based on memoir,career,1960s,timeframe 1960s,20th century",
  "duration": "PT1H53M",
  "actor": [
    {
      "name": "Cailee Spaeny",
      "url": "https://www.imdb.com/name/nm8314228/"
    },
    {
      "name": "Jacob Elordi",
      "url": "https://www.imdb.com/name/nm8624059/"
    },
    {
      "name": "Ari Cohen",
      "url": "https://www.imdb.com/name/nm0169218/"
    }
  ],
  "director": [
    {
      "name": "Sofia Coppola",
      "url": "https://www.imdb.com/name/nm0001068/"
    }
  ],
  "creator": [
    {
      "name": "Priscilla Presley",
      "url": "https://www.imdb.com/name/nm0001636/"
    },
    {
      "name": "Sandra Harmon",
      "url": "https://www.imdb.com/name/nm0363559/"
    },
    {
      "name": "Sofia Coppola",
      "url": "https://www.imdb.com/name/nm0001068/"
    }
  ]
}