{
  "type": "Movie",
  "name": "Strays",
  "url": "https://www.imdb.com/tt15153532/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc2Y2Y0YzgtN2UwMS00YTMyLThiN2UtNWYzMDY5ZmQ5ODk5XkEyXkFqcGdeQXVyMTAxNDE3MTE5._V1_.jpg",
  "description": "An abandoned dog teams up with other strays to get revenge on his former owner.",
  "review": {
    "author": "AfricanBro",
    "dateCreated": "2023-08-17",
    "inLanguage": "English",
    "heading": "The devil in the sky",
    "reviewBody": "Really surprised I went to watch this because it&apos;s not my type of movie but the R rating was soo appealing and I&apos;m glad I went because it was a blast. Reminded me of Ted, the movie defied expectations. If you had come across teaser photos or muted clips, you might assume it&apos;s aimed at kids, but it&apos;s far from it.\n\nIf you&apos;re a dog lover, the emotional aspect will undoubtedly resonate with you more. Personally, I lean towards cats but dogs are fine, I guess. That didn&apos;t detract from how much I loved the movie&apos;s humor. It was undoubtedly its strong suit and what won me over. Despite its comedic focus, the film carried a meaningful message and theme that prevented it from being a mere laugh-fest. It blended everything in so well. I can already see the &apos;the best love is the hardest&apos; message might hit home for some; definitely take that friend you know in a toxic relationship to watch this with at the cinema lol.\n\nThe plot, while not groundbreaking, wasn&apos;t a drawback for me, considering it&apos;s unrealistic to expect a talking dog movie to revolutionize storytelling. Initially, I felt Hunter&apos;s voice casting was slightly off, but got accustomed to it pretty quickly. I couldn&apos;t help but imagine Jamie Foxx&apos;s Bug as Samuel L. Jackson, although Foxx was still outstanding. Nice to see a mini-reunion between Josh Gad and Isla Fisher after Wolf Like Me, which I still think I&apos;m the only one who loved it.\n\nSoundtrack was cool. Again, this was funny, there&apos;s a few jokes too that can go unnoticed because they&apos;re not as prominent as the rest too. I loved the lighter-shade humans line. The cameos were pretty decent too, especially the couch. With a runtime of just over an hour and a half, the pacing was spot on, avoiding any unnecessary plot filler or rushed sequences. The film&apos;s message was relatable and skillfully written, making it clear that it wasn&apos;t merely about dogs. And random thought, did that kid really let a stray dog lick him all over the mouth?\n\nAnyway, I&apos;d definitely recommend, especially if you loved movies like Ted. It&apos;s not what it seems and is definitely a good laugh. And don&apos;t forget to stick around for the mid-credit scene; even though Google said there were no post-credit scenes, it&apos;s definitely worth the wait.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 23302,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "15",
  "genre": [
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2023-08-18",
  "keywords": "dog,revenge,swearing,dog penis,crude humor comedy",
  "duration": "PT1H33M",
  "actor": [
    {
      "name": "Will Ferrell",
      "url": "https://www.imdb.com/name/nm0002071/"
    },
    {
      "name": "Jamie Foxx",
      "url": "https://www.imdb.com/name/nm0004937/"
    },
    {
      "name": "Isla Fisher",
      "url": "https://www.imdb.com/name/nm0279545/"
    }
  ],
  "director": [
    {
      "name": "Josh Greenbaum",
      "url": "https://www.imdb.com/name/nm2307949/"
    }
  ],
  "creator": [
    {
      "name": "Dan Perrault",
      "url": "https://www.imdb.com/name/nm4285995/"
    }
  ]
}