{
  "type": "Movie",
  "name": "The Drop",
  "url": "https://www.imdb.com/tt1600196/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNTQ1Yzk4OTYtNWViMi00MjU0LWJmZDUtOTMzNzMyYmFmMzRjXkEyXkFqcGdeQXVyNTc0Njg2Mzg@._V1_.jpg",
  "description": "Bob Saginowski finds himself at the center of a robbery gone awry and entwined in an investigation that digs deeply into the neighborhood&apos;s past where friends, families, and foes all work together to make a living--no matter the c...",
  "review": {
    "author": "billygoat1071",
    "dateCreated": "2014-11-15",
    "inLanguage": "English",
    "heading": "Smaller Side of Crime",
    "reviewBody": "The Drop appears as a crime thriller, taking its audience to a gritty life of gangsters hiding their dirty money in drop bars, but this is mostly a drama about a lone bartender thinking on living a different path apart from his cousin&apos;s. It also involves a subplot of a man trying to retain his already faded glory. But there is a deadlier conflict lurking in the dark. There isn&apos;t much remarkably grand to be found in this story, but telling the details of the characters&apos; past and waiting for the impending danger behind their backs instantly makes it compelling. It benefits by being low-key, but still far from classic. In any way this is still one fine basic crime drama.\n\nThis is a story where you find no heroes. Bob is basically not the kind of person anyone would fear. In spite of his reserve and kinder personality towards people, you may not know that he is still a tough fellow since he&apos;s been adapted into this mess. Things get lighter when he adopts a dog, meets a new friend and starts a relationship, thinking that his life would change for a bit. Once the real threat appears into this small side of his world, we expect him to protect them from harm, but this is not one of those glossy heroic deeds that lead to some action set piece. The thrills are simply calm and with that calmness, you can sense more of the danger coming after himself and his loved ones. If there is one thing we&apos;ve learn about gangsters in great crime movies then that is how unpredictable they are at killing. That is how often the movie displays its suspense.\n\nThe story relies to many backstories within its main characters and we could easily comprehend those on their conversations and their lifestyle. The cast helps making these characters engaging, with Tom Hardy layering coldness above Bob&apos;s remaining humanity. The late James Gandolfini does beyond brooding, you can feel the character&apos;s despair from his old days. Anything else, the actor did what he does best. Noomi Rapace makes for a likable backup for Hardy. And Matthias Schoenaerts is effectively threatening. These performances just live up to the depth of what&apos;s written for these characters.\n\nThe Drop is plain simple, that the only value it provides to its audience is some entertaining cluster with the stars like Hardy, Gandolfini, and Rapace, and some grounded tension. This won&apos;t end up being one of the greats since it doesn&apos;t actually satisfy in whatever happens in the end, but this is already an interesting study of a corrupt lifestyle at the streets of Brooklyn, with people hiding their own dirty secrets and facing some uncertain consequences. That alone could bring a fine recommendation to this movie.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 160495,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7
  },
  "contentRating": "15",
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "datePublished": "2014-11-14",
  "keywords": "catholic,cadillac,chechen,disposing of a dead body,pet dog",
  "duration": "PT1H46M",
  "actor": [
    {
      "name": "Tom Hardy",
      "url": "https://www.imdb.com/name/nm0362766/"
    },
    {
      "name": "Noomi Rapace",
      "url": "https://www.imdb.com/name/nm0636426/"
    },
    {
      "name": "James Gandolfini",
      "url": "https://www.imdb.com/name/nm0001254/"
    }
  ],
  "director": [
    {
      "name": "Michaël R. Roskam",
      "url": "https://www.imdb.com/name/nm1742427/"
    }
  ],
  "creator": [
    {
      "name": "Dennis Lehane",
      "url": "https://www.imdb.com/name/nm1212331/"
    }
  ]
}