{
  "type": "Movie",
  "name": "The Color Purple",
  "url": "https://www.imdb.com/tt1200263/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYjBkNGE0NGYtYmU5Ny00NjRiLTk5MmYtMWU4NzYxMDE4YWY4XkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_.jpg",
  "description": "A woman faces many hardships in her life, but ultimately finds extraordinary strength and hope in the unbreakable bonds of sisterhood.",
  "review": {
    "author": "lquinlan-17636",
    "dateCreated": "2023-12-29",
    "inLanguage": "English",
    "heading": "Loved the original, this one not so much",
    "reviewBody": "Ok so I thought long & hard about my viewing of The Color Purple last night. I feel it&apos;s a bit sacrilegious to say it wasn&apos;t my favorite movie. Honestly, I was a little disappointed. I will tell you why, spoiler free!\n\nFirst the good- the acting, cinematography & production were stellar! Costume & set design were top notch & the vocal performances were great. I LOVE Danielle Brooks and honestly wished she was on screen more (more into that later). Fantasia&apos;s acting performance was great, as was the rest of the cast. Colman Domingo, who played Mister, was good too.\n\nNow the bad... ok, so this is a musical, which isn&apos;t an issue but I feel that part of the story was lost/glossed over, especially Celie&apos;s & Sophia&apos;s strife, for the sake of song & dance. I never read the book, nor saw the Broadway production so I can&apos;t only compare it to the Spielberg 80&apos;s production, which (I may add) is one of my favorite movies. I feel a hard time connecting with the characters and their story seemed to have gotten diminished. I think another 30 minutes could have easily been added to the movie to help with character development instead of displaying year stamps to show the passing of time. It felt too play-like in some parts too.\n\nCelie had a messed up life (putting it mildly to avoid spoilers) which you kinda felt it but not really. Her story felt very rushed with a quick conclusion that felt a bit weak to me. Same with Sophia. Danielle Brooks is very comfortable in the Sophia role & played her so well, that her lack of screen time was felt. She dominated the scenes she was in but felt her character was thrown in a dark hole to just pop up every now & then to remind you she existed. Taraji P. Henson was good as Shug Avery but even she felt toned down, especially her relationship with the pastor, played by David Alan Grier.\n\nI don&apos;t know... I love these characters. This movie felt like the abbreviated version of the story. I&apos;m sure anyone who has never seen the original (or hasn&apos;t seen it in a long time) would really enjoy this. This movie will most likely be nominated for a bunch of awards. The Spielberg 80&apos;s production was nominated for 11 Academy Awards & woefully won none. The movie was robbed that year and should have won at least one. Whoopi Goldberg&apos;s (she should have won), Oprah&apos;s, & Danny Glover&apos;s performances are a hard act to follow but those that filled their shoes did a wonderful job.\n\nThe best way for me to describe the story was to compare it to episodic tv where a problem arose & was quickly solved within the 30 minute episode. Granted, the movie is much longer but there were a lot of problems. It seriously felt rushed. It lacks heart. I ball my eyes out at the end of Spielberg&apos;s version, but not this one.\n\nDanielle Brooks is someone to keep your eye on (loved her in Orange is the New Black as Tastee). I will be rooting for her!\n\nSo, that&apos;s how I felt. If anything, the movie made me want to read Alice Walker&apos;s book even more. It&apos;s good & I will recommend it to people who I think the original may be a bit too much for them to handle, but I really will push the original film to get a better dramatic tellling of The Color Purple.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 3874,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "12A",
  "genre": [
    "Drama",
    "Musical"
  ],
  "datePublished": "2024-01-26",
  "keywords": "african american,boy,friend,friendship,remake",
  "duration": "PT2H21M",
  "actor": [
    {
      "name": "Fantasia Barrino",
      "url": "https://www.imdb.com/name/nm1568881/"
    },
    {
      "name": "Taraji P. Henson",
      "url": "https://www.imdb.com/name/nm0378245/"
    },
    {
      "name": "Danielle Brooks",
      "url": "https://www.imdb.com/name/nm5335029/"
    }
  ],
  "director": [
    {
      "name": "Blitz Bazawule",
      "url": "https://www.imdb.com/name/nm7577540/"
    }
  ],
  "creator": [
    {
      "name": "Marcus Gardley",
      "url": "https://www.imdb.com/name/nm5926700/"
    },
    {
      "name": "Alice Walker",
      "url": "https://www.imdb.com/name/nm0907504/"
    },
    {
      "name": "Marsha Norman",
      "url": "https://www.imdb.com/name/nm0635568/"
    }
  ]
}