{
  "type": "Movie",
  "name": "The Artifice Girl",
  "url": "https://www.imdb.com/tt20859464/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzE1MWRkODQtNzdjZC00ODEyLWJkNDMtYzFiZjljNDIwNzRkXkEyXkFqcGdeQXVyMzQwMTY2Nzk@._V1_.jpg",
  "description": "A team of special agents discovers a revolutionary new computer program to bait and trap online predators. After teaming up with the program&apos;s troubled developer, they soon find that the AI is rapidly advancing beyond its original...",
  "review": {
    "author": "jtindahouse",
    "dateCreated": "2023-05-08",
    "inLanguage": "English",
    "heading": "Smart, thought-provoking and will have you hanging on every word",
    "reviewBody": "I haven&apos;t always enjoyed Artificial Intelligence films in the past. I guess a part of me always thought it was more of a problem future generations would have to concern themselves with. It has kind of snuck up on us (me at least) in the past few years just how close this sort of thing really is. And for partly that reason I think I enjoyed this film a whole lot more. It also helped that it was a very well made film.\n\nHaving a child actor as the centrepiece (or at least a significant piece) in your film is a risky proposition. It does help on this occasion that the child in question is being asked to act very un-child-like. Either way though I thought Tatum Matthews was excellent in her role. She wasn&apos;t just passable, she was captivating every time she was on screen.\n\nThis film does so much with so little. An entire 40 minute introduction scene to set up the film, simply with people sitting around a table talking - and it was riveting. I was hanging on every word. The dialogue in this movie is terrific from start to finish.\n\nThis is a very thought-provoking film. I&apos;d be shocked if people watched this and didn&apos;t come away with some heavy things to think about. I thoroughly enjoyed this one from start to finish and would highly recommend it. 9/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 8499,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "15",
  "genre": [
    "Mystery",
    "Sci-Fi",
    "Thriller"
  ],
  "datePublished": "2023-04-27",
  "keywords": "questioning,windowless office,pedophile,decoy,programming",
  "duration": "PT1H33M",
  "actor": [
    {
      "name": "Tatum Matthews",
      "url": "https://www.imdb.com/name/nm10104152/"
    },
    {
      "name": "Lance Henriksen",
      "url": "https://www.imdb.com/name/nm0000448/"
    },
    {
      "name": "Sinda Nichols",
      "url": "https://www.imdb.com/name/nm1382907/"
    }
  ],
  "director": [
    {
      "name": "Franklin Ritch",
      "url": "https://www.imdb.com/name/nm6135474/"
    }
  ],
  "creator": [
    {
      "name": "Franklin Ritch",
      "url": "https://www.imdb.com/name/nm6135474/"
    }
  ]
}