{
  "type": "Movie",
  "name": "There&apos;s Something Wrong with the Children",
  "url": "https://www.imdb.com/tt16127696/",
  "poster": "https://m.media-amazon.com/images/M/MV5BODc5ZDRkYmEtYTcyNy00ZjFmLWE0OWEtMzNmYmZjMzhkODBiXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_.jpg",
  "description": "A family takes a weekend trip with longtime friends and their two young children, but, they suspect something supernatural when the kids behave strangely after disappearing into the woods overnight.",
  "review": {
    "author": "Howling_at_the_Moon_Reviews",
    "dateCreated": "2023-08-18",
    "inLanguage": "English",
    "heading": "Do you think there&apos;s a semblance of a plot at the bottom of that hole?",
    "reviewBody": "Horror movies in general lack a lot these days. Whether it be a sense of originality, good acting, or genuine spook factor... but it&apos;s been a while since I&apos;ve encountered a movie that lacks this...\n\nThere is almost no semblance of a story here. Sure, they gave us a vague background on the characters and it gives us spooky snippets here and there, but... what exactly was the story? What was the plot here? As previously stated, you guessed it... there wasn&apos;t one. It kind of blows my mind that this could fully go into production and distributed with such a lack of storytelling. It felt super lazy like someone came up with a proof of concept but had no will or desire to elaborate on anything.\n\nNow, with that being said, it was still a generally entertaining movie. I was intrigued throughout, it just didn&apos;t bring me anywhere. I think that said partial success mostly has to do with the acting. I thought the ensemble of the four adults did an excellent job and provided down to earth and relatable performances in a way that I feel like I haven&apos;t seen much of. They have a group argument moment at one point and it was *chefs kiss*.\n\nAt the end of the day they just wasted some solid potential with lazy storytelling, landing the movie at solidly mediocre. Also a side note, idk what they were doing with the score/sound design... but it wasn&apos;t successful... 4.5 rounding up to a 5. As far as the recommendation goes, I&apos;m indifferent.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 6282,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5
  },
  "contentRating": "15",
  "genre": [
    "Horror",
    "Mystery"
  ],
  "datePublished": "2023-07-23",
  "keywords": "evil force,tunnel,disappeared in the woods,young children,drinking beer",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Alisha Wainwright",
      "url": "https://www.imdb.com/name/nm5131141/"
    },
    {
      "name": "Amanda Crew",
      "url": "https://www.imdb.com/name/nm1468739/"
    },
    {
      "name": "Carlos Santos",
      "url": "https://www.imdb.com/name/nm1972614/"
    }
  ],
  "director": [
    {
      "name": "Roxanne Benjamin",
      "url": "https://www.imdb.com/name/nm1671066/"
    }
  ],
  "creator": [
    {
      "name": "T.J. Cimfel",
      "url": "https://www.imdb.com/name/nm4620383/"
    },
    {
      "name": "David White",
      "url": "https://www.imdb.com/name/nm5020816/"
    }
  ]
}