{
  "type": "Movie",
  "name": "Wonka",
  "url": "https://www.imdb.com/tt6166392/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjdkYzQ4ZGUtMGM2NC00YWJhLWIyZTYtNWIyZDVjYWE1MzNiXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
  "description": "With dreams of opening a shop in a city renowned for its chocolate, a young and poor Willy Wonka discovers that the industry is run by a cartel of greedy chocolatiers.",
  "review": {
    "author": "masonsaul",
    "dateCreated": "2023-12-09",
    "inLanguage": "English",
    "heading": "The best version of a cynical idea",
    "reviewBody": "On paper, Wonka is a cynical cash grab of an idea but in the hands of the extremely talented duo of Paul King and Simon Farnaby it becomes another heartwarming story of a kind person who just wants to make the world a better place. Even if it feels its run time more than King and Faranby&apos;s previous work it still remains thoroughly entertaining and emotionally investing.\n\nTimothée Chalamet lacks the darker edge with this interpretation of Willy Wonka and that really doesn&apos;t matter considering what the film is going for. His Wonka is innocent to a fault, morally pure with a high level of quirk that Chalamet is able to communicate in his enunciation and movement. It&apos;s a nice change of pace compared to his usual roles.\n\nThe supporting cast is full of comedians who take it in turns stealing scenes. Hugh Grant&apos;s Oompa Loompa is an uncanny highlight who takes a while to appear and is absolutely worth the wait. Paterson Joseph excels at playing a full on pantomime villain complimented by Matt Lucas and Matthew Baynton to make for a delightfully evil trio.\n\nPaul King&apos;s direction brings the expected whimsy with a nice level of energy to the musical numbers. The songs by Neil Hannon are generally fine, suitably entertaining in the moment without staying power so it successfully goes back to Pure Imagination a few times, with Joby Talbot&apos;s score happily sprinkling it in throughout.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 57534,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.3
  },
  "contentRating": "PG",
  "genre": [
    "Adventure",
    "Comedy",
    "Family"
  ],
  "datePublished": "2023-12-08",
  "keywords": "prequel,origin story,willy wonka character,genius,greed",
  "duration": "PT1H56M",
  "actor": [
    {
      "name": "Timothée Chalamet",
      "url": "https://www.imdb.com/name/nm3154303/"
    },
    {
      "name": "Gustave Die",
      "url": "https://www.imdb.com/name/nm15067637/"
    },
    {
      "name": "Murray McArthur",
      "url": "https://www.imdb.com/name/nm0564133/"
    }
  ],
  "director": [
    {
      "name": "Paul King",
      "url": "https://www.imdb.com/name/nm1653753/"
    }
  ],
  "creator": [
    {
      "name": "Simon Farnaby",
      "url": "https://www.imdb.com/name/nm1375030/"
    },
    {
      "name": "Paul King",
      "url": "https://www.imdb.com/name/nm1653753/"
    },
    {
      "name": "Roald Dahl",
      "url": "https://www.imdb.com/name/nm0001094/"
    }
  ]
}