{
  "type": "Movie",
  "name": "Allagash",
  "url": "https://www.imdb.com/tt9248110/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMDc0NmM3ZDUtOWZhOS00MmJmLThiZTAtODcwZTI0NjJhM2IxXkEyXkFqcGdeQXVyNDExMzMxNjE@._V1_.jpg",
  "description": "A retired veteran hunting in Northern Maine stumbles across a dead woman and a large sum of money.",
  "review": {
    "author": "omendata",
    "dateCreated": "2020-09-06",
    "inLanguage": "English",
    "heading": "Much Better Than Expected...",
    "reviewBody": "After seeing previous recent Berenger films I was beginning to think he had lost a bit of his Platoon sparkle but after watching this I can still say there is life in the old dog yet.\n\nThe film is your basic casino heist and search for for the cash in the winter mountains of Allagash but what makes this rise above the usual drivel is Berengers performance. Now either he is old , weak and frail in reality or he portrayed the role with perfection. You almost feel every step he takes, every wheeze that comes out of his mouth as he slowly and lugubriously makes his way through the carnage and you really feel for the character, I was egging him on; you just want the pace to move faster but it does not and that is its strength not its weakness as some other reviewers have pointed out. It feels like you the viewer are walking through molasses with him and that is a great achievement for any actor. The movie may be too slow for a lot of the crash, bang, wallop brigade but stick with it as it pulls no punches.\n\nStir in some zero mercy / zero compromise action which is rather unexpected in these days of political correctness and the despatch of the bad guys is carried off with Platoon-like viciousness which adds to the movies allure, it does not have the usual Hollywood happy ending which is always a bonus and gives the viewer a deft little twist at the end which I always like to see.\n\nIt is not going to win any oscars but it does prove that Berenger is still a force to be reckoned with and it gets a solid 6.5/10 from me as I thoroughly enjoyed it and so should you if you stick with it to the end.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 2756,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.2
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Thriller"
  ],
  "datePublished": "2020-10-16",
  "keywords": "triggerman,bagman",
  "duration": "PT1H29M",
  "actor": [
    {
      "name": "Tom Berenger",
      "url": "https://www.imdb.com/name/nm0000297/"
    },
    {
      "name": "Kristen Hager",
      "url": "https://www.imdb.com/name/nm1982266/"
    },
    {
      "name": "Paul Ben-Victor",
      "url": "https://www.imdb.com/name/nm0070115/"
    }
  ],
  "director": [
    {
      "name": "John Barr",
      "url": "https://www.imdb.com/name/nm0056527/"
    }
  ],
  "creator": [
    {
      "name": "John Barr",
      "url": "https://www.imdb.com/name/nm0056527/"
    },
    {
      "name": "Alan Petherick",
      "url": "https://www.imdb.com/name/nm0677491/"
    }
  ]
}