{
  "type": "Movie",
  "name": "I&apos;m Thinking of Ending Things",
  "url": "https://www.imdb.com/tt7939766/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNWMyZTA1MTItMzFhOS00NGY5LWJlZDMtMzczZmRjOThkMmViXkEyXkFqcGdeQXVyMjUxMTY3ODM@._V1_.jpg",
  "description": "Full of misgivings, a young woman travels with her new boyfriend to his parents&apos; secluded farm. Upon arriving, she comes to question everything she thought she knew about him, and herself.",
  "review": {
    "author": "siderite",
    "dateCreated": "2021-02-19",
    "inLanguage": "English",
    "heading": "It&apos;s better you know what this film is about before you watch it. Charlie Kaufman does it again.",
    "reviewBody": "Usually I recommend people to not watch or read reviews, just enjoy the film in their own way. This one, though, is better if you are well prepared for it. It&apos;s a two hour fifteen minute film that requires another twenty minutes for the obligatory YouTube video that explains what you&apos;ve just seen. Foundflix has a nice Explained for it, but watch or read whatever. Because you need to understand you are going to sit through the slow, oh so slow, dissolution of a man&apos;s mind, complete with heavy references to books and films and musicals, awkward scenes that make you want to skip forward, long internal monologues, the whole thing. It is also worth mentioning that this film is based of a book, one that is not written by Kaufman, but right up his alley. You might want to check that out before attempting to see the film.\n\nOnce you know you are going to see that, you won&apos;t feel cheated when finally starting to watch the movie and realizing it will not entertain you at all. Maybe it will make you ponder the nature of reality and inner life, maybe it will make you grab a gun and kill yourself or your parents, maybe it will make you write a dissertation on it, so other people get what you got or at least friends will honor you for surviving through it, but relaxing entertainment or any sort of pleasure that is not purely intellectual you will not get.\n\nThere are no twists at the end, the basic premise is made clear rather soon and from that moment you will wait for the film to end. There is no hero journey, no big reveal of information that will guide you through life, no story. The only beautiful thing in the movie is Jessie Buckley. So get into your Dostoyevski reading mood or whatever and only then attempt a viewing. Just trying on a whim and then complaining about it won&apos;t cut it. You have to work to see this film. Only when you&apos;re prepared to do that work will I recommend it to you.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 97923,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Thriller"
  ],
  "datePublished": "2020-09-04",
  "keywords": "winter,dementia,road trip,snow,crying woman",
  "duration": "PT2H14M",
  "actor": [
    {
      "name": "Jesse Plemons",
      "url": "https://www.imdb.com/name/nm0687146/"
    },
    {
      "name": "Jessie Buckley",
      "url": "https://www.imdb.com/name/nm2976580/"
    },
    {
      "name": "Toni Collette",
      "url": "https://www.imdb.com/name/nm0001057/"
    }
  ],
  "director": [
    {
      "name": "Charlie Kaufman",
      "url": "https://www.imdb.com/name/nm0442109/"
    }
  ],
  "creator": [
    {
      "name": "Charlie Kaufman",
      "url": "https://www.imdb.com/name/nm0442109/"
    },
    {
      "name": "Iain Reid",
      "url": "https://www.imdb.com/name/nm2914363/"
    }
  ]
}