{
  "type": "Movie",
  "name": "Shirley",
  "url": "https://www.imdb.com/tt8430598/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOGU5YzRmMDctODIxZi00OGEzLWE4ZDYtOTRlMTNiZjlhMDA5XkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_.jpg",
  "description": null,
  "review": {
    "author": "ozjosh03",
    "dateCreated": "2020-07-05",
    "inLanguage": "English",
    "heading": "How NOT to make a bio-pic",
    "reviewBody": "I really don&apos;t get it. Director Josephine Decker supposedly wants her film to illuminate the life and work of author Shirley Jackson. The actors spent time researching and immersing themselves in the lives of Shirley and of Stanley Hyman. But the film&apos;s story is only ever vaguely representative of their lives and personalities. Huge liberties have been taken. To give just one example, this Shirley and Stanley are childless, and seemingly tortured about it, whereas the real Shirley and Stanley had four children. In the end, one can only wonder what the point of this film is. It&apos;s no kind of tribute and it neither illuminates, nor explores Jackson&apos;s life and work when there&apos;s only a passing resemblance to the known facts. Decker actually seems more interested in spinning a story about the creative process, and how all-consuming, twisted and destructive it can be. That&apos;s all very well. But Decker&apos;s notions have little to nothing to do with Jackson. So why not just admit that her story is fictional? Pretending that it is some kind of biography, however loosely based on facts, just seems dishonest and ultimately exploitative. Ethical issues aside, it also has to be said that Decker&apos;s exploration of her Shirley&apos;s creative process involves long stretches of extreme tedium, some seriously contrived dramatic scenarios and a great deal of shameless scenery-chewing, albeit by a couple of very fine actors. Given that the melodrama revolves around an academic, his frumpy wife and their young house guests (and attendant sexual tensions) there are whole scenes that play like an uncomfortable homage / parody of Who&apos;s Afraid of Virginia Woolf? If only it were even half as amusing and engaging.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 13003,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama",
    "Horror"
  ],
  "datePublished": "2020-10-30",
  "keywords": "drunkenness,adultery,marriage,baby,sexism",
  "duration": "PT1H47M",
  "actor": [
    {
      "name": "Elisabeth Moss",
      "url": "https://www.imdb.com/name/nm0005253/"
    },
    {
      "name": "Odessa Young",
      "url": "https://www.imdb.com/name/nm3747611/"
    },
    {
      "name": "Michael Stuhlbarg",
      "url": "https://www.imdb.com/name/nm0836121/"
    }
  ],
  "director": [
    {
      "name": "Josephine Decker",
      "url": "https://www.imdb.com/name/nm2528451/"
    }
  ],
  "creator": [
    {
      "name": "Sarah Gubbins",
      "url": "https://www.imdb.com/name/nm6311892/"
    },
    {
      "name": "Susan Scarf Merrell",
      "url": "https://www.imdb.com/name/nm4957990/"
    }
  ]
}