{
  "type": "Movie",
  "name": "Sound of Metal",
  "url": "https://www.imdb.com/tt5363618/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNjcyYjg0M2ItMzMyZS00NmM1LTlhZDMtN2MxN2RhNWY4YTkwXkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_.jpg",
  "description": "A heavy metal drummer&apos;s life is turned upside down when he begins to lose his hearing and he must confront a future filled with silence.",
  "review": {
    "author": "lucasnochez",
    "dateCreated": "2020-02-27",
    "inLanguage": "English",
    "heading": "Film Review: The Sound of Metal",
    "reviewBody": "The sound of trees, the sound of distant traffic, the sound of coffee dripping into a pot, Darius Marder&apos;s directorial debut Sound of Metal is a study on the sounds of humanity, beauty and growth.\n\nThe film opens with a punk rock performance featuring only two musicians; the scene is loud and energetic with handheld camera movements capturing a woman vocalist and a man on the drums, resting behind them like a gunner sits before a 50 caliber turret. Darius Marder, being the writer of the 2012 punk masterpiece The Place Beyond The Pines, feels like a director with punk-rock origins in his veins, and a keen sense of sobering humanity within every frame. To be frank, I don&apos;t think anyone other than Tyler Durden himself or Ryan Gosling could have helmed the leading role of this picture to the degree that the spectacular Riz Ahmed has. He turns the story of Ruben Stone, a drummer going deaf, into something eerily real and relatable.\n\nAs we get to know Ruben better, we learn that his partner on the stage is also his partner in crime and sweetheart Lou or Lulu (Olivia Cooke). Together, the two stir up astounding emotions and recall of our own young love and the stories that proceed it.\n\nBut this is Reuben&apos;s story, and with each passing moment, his hearings fleeting disappearance becomes the main antagonist of the picture. Despite the brief takes of Rueben and Lulu&apos;s hardships, which include faint hints of suicide, nothing is as hard as the reality of his own inevitable deafness. Yet, no matter how sad or trouble both of these protagonist&apos;s life before the start of the film may be, I found it interesting and impressive that the director choose not to touch too much upon their backstories, and allowed these little nuances to add to a film telling a very clear and present, almost magnetic story about people in the now, present at this very moment.\n\nWhile the film centres on the relationship between the two punk rock lovers, Sound of Metal begins unearthing the trails and tribulations of how a broke and passionate couple deal with such traumatic and realistic health scares.\n\nWhile Reuben&apos;s deafness worsens and his health rapidly begins to decline, his options are quite simple; either deal with his deafness and adapt his life to it, or perform an implant procedure that could resurrect his hearing, the latter, costing upwards of eighty thousand dollars.\n\nReminiscent of the first time I ever saw 127 Hours, the film&apos;s sound is as crucial a characters as Rueben or Lulu. Vibrations throughout the film really gives the audience a sense of Rueben&apos;s sonic displeasure and fleeting health-this fact alone gives worth to seeing Sound of Metal in a theatre. It is no surprise that the sound mixing and sound editing of the film is top notch, easily being comparable to Damien Chazelle&apos;s debut feature film Whiplash.\n\nUsing very clever filming techniques, including cutting back and forth between regular dialogue and muffled ambience from Ruben&apos;s perspective, Marder&apos;s directorial choices seem very confident and seasoned, providing audiences with a cinematic movie-going experience. Truly heartbreaking and constantly upsetting, the film is as resilient as Rueben&apos;s will to continue being a musician. Avoiding the advice of his doctors to omit loud noises, Ruben stubbornly ignores all caution, quickly and almost abruptly by showcasing a medium shot of him on stage, mid-show, raging on a drum solo; sweating with passion and the brass villain known as Rueben&apos;s drum symbolls.\n\nThere are scenes of real heart in Sound of Metal. Rueben&apos;s confession to Lulu being one of them, but also, the whole process of recovery is truly a humanistic milestone and cinematic feast of human endurance and love. Communicating via notepads, words and writing, Lulu and Rueben begin a journey together that they both know could depart their love for something that has made them closer, and ultimately, who they are as people. Bleak, brazen and loud as heck, Sound of Metal is also an optimistic energy rush of a film.\n\nWhile Sound of Metal is, first and foremost, a love story, the story of love becomes unclear whether its towards that of Lulu, or the will to be a performer; a love of entertaining, a longing of drumming. Much like Whiplash, and Miles Teller&apos;s finale scene in the film, the film is doused in the constant condensation of the dum set and Reuben&apos;s tattooed body. This is a strong ode to the love of music, a love letter to the loud and obnoxious sounds of rock and roll and hard core metal.\n\nJoining Ahmed and Cooke in this passion project, is the ultra-talented Paul Raci, a confidant to Rueben and Lulu seeing to recovering his health. Raci&apos;s Joe provides the film with an outsiders look into the love and strong will Rueben has towards his craft and the people who trusts the most.\n\nMarder&apos;s debut feature is truly a wonder to behold. Showing confidence in every frame, Marder&apos;s camera is placed frequently behind his protagonist&apos;s shoulders, constantly heightening his profile and Rueben&apos;s silhouette during his performances. This unseen method of capturing live music, along with his decision to capture their performances with the use of the documentary style shaky cam, adds a sense of uncertainty to the character and to the narrative as a whole.\n\nYet, as loud and vibrated Sound of Metal really is, there is a sense of tranquility to it. Clarity and intense scenes plagued in silence are some of the most captivating and devastatingly powerful, throughout. The quiet stillness that Rueben adapts as the film progresses, not only adds to the evolution of the character, but also the progression of the narrative and strength in Abraham Marder and Darius Marder&apos;s script.\n\nSound of Metal is a rapturous, soulful, wildfire of a film that isn&apos;t easy to tame, or ease, or really forget at all. A truly transitional, transcendent and soul-searching cinematic experience, that will devastate you, crush you and echo throughout your memory, well after the credits begin to roll. Metallic, brilliant and raw, Sound of Metal along with Ahmed&apos;s sobering as an ice-bath performance is a kinetic and electrifying cinematic movie-going experience. Spellbinding, atmospheric and alluring, Sound of Metal is a triumph in art.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 146233,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Music"
  ],
  "datePublished": "2021-04-12",
  "keywords": "drug addict,deaf community,musician,anger,hearing loss",
  "duration": "PT2H",
  "actor": [
    {
      "name": "Riz Ahmed",
      "url": "https://www.imdb.com/name/nm1981893/"
    },
    {
      "name": "Olivia Cooke",
      "url": "https://www.imdb.com/name/nm4972453/"
    },
    {
      "name": "Paul Raci",
      "url": "https://www.imdb.com/name/nm0705152/"
    }
  ],
  "director": [
    {
      "name": "Darius Marder",
      "url": "https://www.imdb.com/name/nm2942187/"
    }
  ],
  "creator": [
    {
      "name": "Darius Marder",
      "url": "https://www.imdb.com/name/nm2942187/"
    },
    {
      "name": "Abraham Marder",
      "url": "https://www.imdb.com/name/nm3473150/"
    },
    {
      "name": "Derek Cianfrance",
      "url": "https://www.imdb.com/name/nm0161834/"
    }
  ]
}