{
  "type": "Movie",
  "name": "A Good Day to Die Hard",
  "url": "https://www.imdb.com/tt1606378/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTcwNzgyNzUzOV5BMl5BanBnXkFtZTcwMzAwOTA5OA@@._V1_.jpg",
  "description": "John McClane travels to Russia to help out his seemingly wayward son, Jack, only to discover that Jack is a CIA operative working undercover, causing the father and son to team up against underworld forces.",
  "review": {
    "author": "andrewsmith1-609-479980",
    "dateCreated": "2013-02-15",
    "inLanguage": "English",
    "heading": "Here&apos;s why it&apos;s just so bad ....",
    "reviewBody": "As a fan of the Die Hard series I feel the need to warn others - Don&apos;t waste 97 minutes of your life on this movie! Yes, it really is that bad. \n\nHere&apos;s a concise summary of why it&apos;s just so bad: \n\n1) John McClane&apos;s role is really as a side-kick. Why do this to the big man .... why? \n\n2) The movie lacks a bad guy. Does the movie have people that are bad - of course, but it lacks that McClane v Super-villain factor. \n\n3) There&apos;s very little of the Die Hard humour we&apos;ve all grown to love. \n\n4) The movie parodies the Hans Gruber death sequence - never - never do this. \n\n5) Jai Courtney is terrible. It&apos;s hard to discern if it&apos;s the role he&apos;s been asked to play or him, but either way he come across as a spoiled brat pretending to be Jason Bourne. \n\n6) There&apos;s hardly any script - it&apos;s as if the script were sandwiched in post production to fit around the bangs and crashes. \n\n7) It&apos;s not in the USA. This sounds trivial but it&apos;s not - the film just doesn&apos;t work outside of its tried and tested environment. \n\n8) The car chase scene - oh my. If you do choose to watch the movie after reading this the good news is that yes, it does eventually end - although it may not feel this way. \n\nSo in summary, go plant a tree, play football, go for a walk, in fact - do anything but for the love of all that you hold dear - don&apos;t waste your life on this.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 2
    }
  },
  "rating": {
    "ratingCount": 213862,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.2
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Thriller"
  ],
  "datePublished": "2013-02-14",
  "keywords": "traffic jam,car accident,american abroad,explosion,two man army",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Bruce Willis",
      "url": "https://www.imdb.com/name/nm0000246/"
    },
    {
      "name": "Jai Courtney",
      "url": "https://www.imdb.com/name/nm2541974/"
    },
    {
      "name": "Sebastian Koch",
      "url": "https://www.imdb.com/name/nm0462407/"
    }
  ],
  "director": [
    {
      "name": "John Moore",
      "url": "https://www.imdb.com/name/nm0601382/"
    }
  ],
  "creator": [
    {
      "name": "Skip Woods",
      "url": "https://www.imdb.com/name/nm0940790/"
    },
    {
      "name": "Roderick Thorp",
      "url": "https://www.imdb.com/name/nm0861636/"
    }
  ]
}