{
  "type": "Movie",
  "name": "A Jazzman&apos;s Blues",
  "url": "https://www.imdb.com/tt14307536/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjczOGRjMDctZWVlMS00NWE3LTkxMGEtNmVjYjYyYjdkNDA5XkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_.jpg",
  "description": "Follows an investigation into an unsolved murder unveiling a story full of forbidden love, deceit and a secret.",
  "review": {
    "author": "loddya",
    "dateCreated": "2022-10-01",
    "inLanguage": "English",
    "heading": "Nice watch!!",
    "reviewBody": "I am always skeptical about TP movies but this one was far better than the other ones in my opinion. Even though there were a few cons why I did not give this movie a 10, It is still an enjoyable watch.\n\nHere are the reasons why I did not give it a 10.\n\nCons: Movie ended with missing parts that could&apos;ve sent the movie to another level. The father&apos;s hate, where does it come from? If Bayou is someone else&apos;s son who is he?\n\nThe grandfather, yes we get it, he is depraved rapist. Why didn&apos;t Bayou do anything about it? And why is Leanne&apos;s mother so detached and evil? Couldn&apos;t they show us some dialogues between her and Leanne that made her this way?\n\nWhy is Leanne so selfish? As if she did not know that they could kill Bayou.\n\nWhy is Bayou&apos;s brother like that? Did something happened to him that turned him into an addict?\n\nLastly Why is Bayou so dumb? You know your brother hates you, you go and trust him around you while you are enjoying stardom. Why go back to the place that you know pretty well that they will kill you. Why couldn&apos;t he send someone down there and bring his mom to Chicago to live with him?\n\nWhat type of life is he proposing to Leanne and his white son (which the skin tone is completely confusing btw).\n\nWho is the old woman at the beginning of the movie? What happened to Bayou&apos;s people at the aftermath?\n\nNice try from Tyler Perry tho.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 4138,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Mystery",
    "Romance"
  ],
  "datePublished": "2022-09-23",
  "keywords": "love,story,murder,secret,1930s",
  "duration": "PT2H7M",
  "actor": [
    {
      "name": "Joshua Boone",
      "url": "https://www.imdb.com/name/nm5264241/"
    },
    {
      "name": "Amirah Vann",
      "url": "https://www.imdb.com/name/nm2722066/"
    },
    {
      "name": "Solea Pfeiffer",
      "url": "https://www.imdb.com/name/nm8446021/"
    }
  ],
  "director": [
    {
      "name": "Tyler Perry",
      "url": "https://www.imdb.com/name/nm1347153/"
    }
  ],
  "creator": [
    {
      "name": "Tyler Perry",
      "url": "https://www.imdb.com/name/nm1347153/"
    }
  ]
}