{
  "type": "Movie",
  "name": "Ambulance",
  "url": "https://www.imdb.com/tt4998632/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYjUyN2VlZGEtNGEyZC00YjViLTgwYmQtZDJiM2FlOTU3Mjg2XkEyXkFqcGdeQXVyMjMxOTE0ODA@._V1_.jpg",
  "description": "Two robbers steal an ambulance after their heist goes awry.",
  "review": {
    "author": "CinemaClown",
    "dateCreated": "2022-05-03",
    "inLanguage": "English",
    "heading": "More Exhausting Than Exhilarating",
    "reviewBody": "Stylishly directed, jam-packed with chases and keeping the fun aspect alive for the most part if not all the way, Ambulance moves into top gear relatively quick and never takes the foot off the pedal once it gets going but the road it takes to reach its destination ends up being longer than what the gas in the tank can handle, thus resulting in a ride that&apos;s running on fumes way before the end is in sight.\n\nDirected by Michael Bay, the premise is simple, setup is quick & thrills are endless even if much of the narrative elements seem underdeveloped. Bay utilises his usual unabashed over-the-top approach that provide his standard blockbuster fares an explosive, extravagant flavour and he amplifies the nonstop action some more with kinetic camerawork, chaotic vibe, frenetic editing and wicked character interplay.\n\nThe energy & passion is evident in execution and the use of drones to film the chase sequences is undoubtedly inspiring but this would&apos;ve been an even better action-thriller if it was trimmed to a tight & tense 90 mins ride. Jake Gyllenhaal, Yahya Abdul-Mateen II & Eiza González remain in sync with the craziness on display. And while the interest & momentum isn&apos;t lost, one does start to feel its 136 mins runtime in the remaining half.\n\nOverall, Ambulance is amusing, entertaining & preposterous in all the ways a Michael Bay film is expected to be but it is also a whole lot of fast fun & furious frivolity that manages to get plenty of mileage out of its barebone premise. The lack of restraint isn&apos;t an issue since it is one of the fine qualities of a Bayhem production but its overlong length does leave you feeling more exhausted than exhilarated in the end. In short, a gleeful & enjoyable delight.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 91794,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Crime",
    "Drama"
  ],
  "datePublished": "2022-03-25",
  "keywords": "ambulance,heist gone wrong,los angeles california,doctor,money",
  "duration": "PT2H16M",
  "actor": [
    {
      "name": "Jake Gyllenhaal",
      "url": "https://www.imdb.com/name/nm0350453/"
    },
    {
      "name": "Yahya Abdul-Mateen II",
      "url": "https://www.imdb.com/name/nm5584344/"
    },
    {
      "name": "Eiza González",
      "url": "https://www.imdb.com/name/nm2555462/"
    }
  ],
  "director": [
    {
      "name": "Michael Bay",
      "url": "https://www.imdb.com/name/nm0000881/"
    }
  ],
  "creator": [
    {
      "name": "Chris Fedak",
      "url": "https://www.imdb.com/name/nm1776338/"
    },
    {
      "name": "Laurits Munch-Petersen",
      "url": "https://www.imdb.com/name/nm0612664/"
    },
    {
      "name": "Lars Andreas Pedersen",
      "url": "https://www.imdb.com/name/nm1099296/"
    }
  ]
}