{
  "type": "Movie",
  "name": "Call Jane",
  "url": "https://www.imdb.com/tt7461272/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYzY4ZWQ5NzgtMTM0Yy00NWI5LTliYWUtNGQ1MTNkYmQwZDllXkEyXkFqcGdeQXVyMTQzNTA5MzYz._V1_.jpg",
  "description": "A married woman with an unwanted pregnancy lives in a time in America when she can&apos;t get a legal abortion and works with a group of suburban women to find help.",
  "review": {
    "author": "AfricanBro",
    "dateCreated": "2022-11-01",
    "inLanguage": "English",
    "heading": "You&apos;re not alone, call Jane",
    "reviewBody": "Couldn&apos;t really tell what it&apos;s going to be about at the start; takes time to reveal itself and in the process I started to lose interest in it. You do get it&apos;s the 60&apos;s with the dialogue and scenery, the ideologies too; but it the movie doesn&apos;t really focus on convincing you of the era and instead on telling you the story instead.\n\nIt&apos;s pretty slow paced and I wasn&apos;t really sucked into it for the first half, opening act is promising then quickly starts to get dull at times and just felt like it was lagging to get to the point to address what the movie was going to actually be about. It took time to actually start. About an hour or so in it starts to find it&apos;s groove and turns a little more upbeat. It was very believable with great acting throughout which made it touching, though I don&apos;t know if that makes up for the lack of zeal it has. Once the point is made though it feels like they were adding unnecessary points to develop plot which it didn&apos;t really need to get to the end of the story. I think the movie could&apos;ve had a much shorter run time and still gotten the same level of emotion and notion across. For the most part the great acting is what kept me interested and elevated the film.\n\nThe film should&apos;ve been better, I still think it&apos;s a pretty decent movie especially if you wait it out, and it might be a movie based in the 60&apos;s but it&apos;s been released at a time when it&apos;s message is still relevant, just unfortunate it&apos;s still a topic we have to discuss this many years later. Not so much has changed in six decades that the characters and message the movie is advocating for are still very familiar in this age.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 5811,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "12A",
  "genre": [
    "Drama",
    "History"
  ],
  "datePublished": "2022-11-04",
  "keywords": "pregnancy,abortion,chicago illinois,illegal abortion,jane collective",
  "duration": "PT2H1M",
  "actor": [
    {
      "name": "Elizabeth Banks",
      "url": "https://www.imdb.com/name/nm0006969/"
    },
    {
      "name": "Sigourney Weaver",
      "url": "https://www.imdb.com/name/nm0000244/"
    },
    {
      "name": "Chris Messina",
      "url": "https://www.imdb.com/name/nm0582149/"
    }
  ],
  "director": [
    {
      "name": "Phyllis Nagy",
      "url": "https://www.imdb.com/name/nm0619507/"
    }
  ],
  "creator": [
    {
      "name": "Hayley Schore",
      "url": "https://www.imdb.com/name/nm2735698/"
    },
    {
      "name": "Roshan Sethi",
      "url": "https://www.imdb.com/name/nm6149734/"
    }
  ]
}