{
  "type": "Movie",
  "name": "Dog",
  "url": "https://www.imdb.com/tt11252248/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYjA2MDM2YjctYzNhNC00NGEzLWFmYWEtODExODFkNmUyOGE2XkEyXkFqcGdeQXVyODk2NDQ3MTA@._V1_.jpg",
  "description": "Two former Army Rangers are paired against their will on the road trip of a lifetime. Briggs (Channing Tatum) and Lulu (a Belgian Malinois) race down the Pacific Coast to get to a fellow soldier&apos;s funeral on time.",
  "review": {
    "author": "rannynm",
    "dateCreated": "2022-02-21",
    "inLanguage": "English",
    "heading": "Compelling Story About Two Warriors That Rescue Each Other In Their Odyssey Of Self-Discovery",
    "reviewBody": "Dog is a thought-provoking film about an important subject. This movie tells a compelling story about a former Army Ranger and his journey to bring a canine hero to the funeral of his previous comrade and handler. In the end, the two warriors rescue each other in their odyssey of self-discovery.\n\nArmy Ranger Briggs (Channing Tatum) and Lulu (a Belgian Malinois K-9 Working Dog) are joined together against their will to honor the service and sacrifice of Sergeant Riley Rodriguez (Eric Urbiztondo) at his distant funeral. Along the way, they drive each other crazy, exhibit self-destructive and bad behavior while also escaping dangerous situations. They begin to bond on their journey and heal the wounds they both experienced from combat situations which makes them realize that life can move forward in unexpected ways.\n\nChanning Tatum (Army Ranger Briggs) adds a lot of humor in his character&apos;s dialogue and in the physical comedy between Lulu and him. Tatum also co-directs this movie along with Reid Carolin who wrote the screenplay as well. My favorite scene is when Briggs coaxes Lulu into taking a bath-and there are many other funny physical interaction scenes between the two of them when they are fighting or at odds. There are some touching scenes together as well, such as when Lulu is comforting him after a severe headache.\n\nThe message of Dog is that life typically unfolds in unexpected ways and embracing change can bring about unexpected happiness. Both Army Ranger Briggs and Lulu are wounded warriors and together they experience this journey of healing. Parents need to be aware that this film has some mature elements involving language, drugs and sexual material. Younger audiences may also be frightened by some of the dog&apos;s aggressive behavior.\n\nI give Dog 3.5 out of 5 stars and recommend it for ages 14 to 18, plus adults. By Selene W., KIDS FIRST!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 44437,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2022-02-18",
  "keywords": "dog,dog movie,funeral,pretending to be blind,fallen commander",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "Channing Tatum",
      "url": "https://www.imdb.com/name/nm1475594/"
    },
    {
      "name": "Ryder McLaughlin",
      "url": "https://www.imdb.com/name/nm9208180/"
    },
    {
      "name": "Aavi Haas",
      "url": "https://www.imdb.com/name/nm3590810/"
    }
  ],
  "director": [
    {
      "name": "Reid Carolin",
      "url": "https://www.imdb.com/name/nm1730221/"
    },
    {
      "name": "Channing Tatum",
      "url": "https://www.imdb.com/name/nm1475594/"
    }
  ],
  "creator": [
    {
      "name": "Reid Carolin",
      "url": "https://www.imdb.com/name/nm1730221/"
    },
    {
      "name": "Brett Rodriguez",
      "url": "https://www.imdb.com/name/nm2415524/"
    }
  ]
}