{
  "type": "Movie",
  "name": "Don&apos;t Make Me Go",
  "url": "https://www.imdb.com/tt2597804/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYjM4OGY3Y2EtZGFmMi00ZjFlLTg5YTUtNWMxMjg1YmM3YTA0XkEyXkFqcGdeQXVyMTQzNTA5MzYz._V1_.jpg",
  "description": "When a single father to a teenage daughter learns that he has a fatal brain tumor, he takes her on a road trip to find the mother who abandoned her years before and to try to teach her everything she might need over the rest of he...",
  "review": {
    "author": "thesar-2",
    "dateCreated": "2022-11-01",
    "inLanguage": "English",
    "heading": "Rebel With a Cause",
    "reviewBody": "The hook was Cho, the anchor was the immediate full frontal male nudity in the cold open. And it only got better from there.\n\nIt would be hard to pinpoint a scene in this drama that doesn&apos;t confirm that the two leads truly feel like Father and Daughter. And because of that, plus the rest of the script, the last act is truly emotional.\n\nJohn Cho plays Mia Isaac&apos;s single father and unbeknownst to her, he&apos;s dying of a tumor. Yes, it *is* a tumah. This dad has the entire weight of the world on his shoulders from both that secret, and a TON of other stuff. (You will see it in Cho&apos;s fantastic acting.) So, he feels it&apos;s finally time for a road trip so she can meet her mom who left her very young.\n\nThis movie feels very real, all actors give their best, the movie looks great and it certainly gets progressively better through to the end. It&apos;s also a tad funny, but not unrealistically funny - every day humor we all experience.\n\nI wouldn&apos;t call it perfect as most chaotic misadventures the daughter gets the duo into is almost resolved as fast as its introduced and it could be a melodrama at times. But what really saved the movie was that climax. There were signs leading up to it and yet, I still didn&apos;t see it coming.\n\nHighly recommended. I would say even more so for people with children, single parents or not.\n\n***\n\nFinal Thoughts: Not afraid to admit, that closing REALLY got to me emotionally. And I don&apos;t even have kids.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 3639,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "12",
  "genre": [
    "Drama"
  ],
  "datePublished": "2022-07-15",
  "keywords": "mother,domestic drama,teen drama,road trip,nudist beach",
  "duration": "PT1H49M",
  "actor": [
    {
      "name": "John Cho",
      "url": "https://www.imdb.com/name/nm0158626/"
    },
    {
      "name": "Mia Isaac",
      "url": "https://www.imdb.com/name/nm10657454/"
    },
    {
      "name": "Kaya Scodelario",
      "url": "https://www.imdb.com/name/nm2546012/"
    }
  ],
  "director": [
    {
      "name": "Hannah Marks",
      "url": "https://www.imdb.com/name/nm2000954/"
    }
  ],
  "creator": [
    {
      "name": "Vera Herbert",
      "url": "https://www.imdb.com/name/nm3418687/"
    }
  ]
}