{
  "type": "Movie",
  "name": "Minions: The Rise of Gru",
  "url": "https://www.imdb.com/tt5113044/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDM3YWEwYTMtNmY3ZS00YzJiLWFlNWItOWFmNjY0YzA4ZDE3XkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_.jpg",
  "description": "The untold story of one twelve-year-old&apos;s dream to become the world&apos;s greatest supervillain.",
  "review": {
    "author": "aidanratesmovies",
    "dateCreated": "2022-07-08",
    "inLanguage": "English",
    "heading": "Watchable effort, not bad, but getting a bit tired",
    "reviewBody": "It may feel in total like this franchise is running out of steam, or at least fresh and creative ideas- but Minions The Rise of Gru does manage to be decently entertaining and charming enough to be worth at least a one time watch. A lot of people, critics included, bash the 2015 film Minions for a lack of a true plot among many other things- but in my personal opinion I actually enjoyed the first minions movie and may even find it better than this one. Although both films are flawed, Minions had a very clear although frantic vision set in mind for ts characters- and never felt like a combination of two completely different films like this one did. So what is it about this film that makes it worth watching? Well the animation for one is absolutely fantastic, gorgeous visuals that are easily the best to ever come out of Illumination in their company&apos;s entire run. Kid Gru is also a fun and charming lead, and i&apos;ll be darned if the minions silly gags didn&apos;t charm me from time to time and even earn a chuckle or two (the airplane scene most of all). Its plot is truly all over the place, much like the first film, and its focus on characters feels very divided- as well as its focus on future characters come to be in the franchise considering and reminding the audience how this is a prequel- in case the 70&apos;s vibes wouldn&apos;t tell you otherwise. I don&apos;t know, its entertaining it has its moments and I found some fun in it. Its an uneven little flick but its use of colorful visuals and fun characters make it decent enough for a pleasant experience- and certainly trumps the third Despicable Me film and latest franchise release before this one almost 5 years ago. It&apos;s hard to believe this franchise is still going, and how it still manages to propel itself forward, but in this age of commercialization and franchises- Minions the Rise of Gru can be more tolerable than most.\n\nMy Rating: 6.2/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 81945,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2022-07-01",
  "keywords": "sequel to spin off,despicable me&apos;s minion character,supervillainess,supervillain,chinese zodiac",
  "duration": "PT1H27M",
  "actor": [
    {
      "name": "Steve Carell",
      "url": "https://www.imdb.com/name/nm0136797/"
    },
    {
      "name": "Pierre Coffin",
      "url": "https://www.imdb.com/name/nm1853544/"
    },
    {
      "name": "Alan Arkin",
      "url": "https://www.imdb.com/name/nm0000273/"
    }
  ],
  "director": [
    {
      "name": "Kyle Balda",
      "url": "https://www.imdb.com/name/nm0049633/"
    },
    {
      "name": "Brad Ableson",
      "url": "https://www.imdb.com/name/nm1556070/"
    },
    {
      "name": "Jonathan del Val",
      "url": "https://www.imdb.com/name/nm3646390/"
    }
  ],
  "creator": [
    {
      "name": "Matthew Fogel",
      "url": "https://www.imdb.com/name/nm3821363/"
    },
    {
      "name": "Brian Lynch",
      "url": "https://www.imdb.com/name/nm0528244/"
    }
  ]
}