{
  "type": "Movie",
  "name": "Paradise Highway",
  "url": "https://www.imdb.com/tt7469828/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZTRjYmVhM2MtNWE0Ny00OWEyLWI4ZGQtYmI4NDQyYzJkYWE1XkEyXkFqcGdeQXVyMTAxMTM4NzU@._V1_.jpg",
  "description": "A truck driver has been forced to smuggle illicit cargo to save her brother from a deadly prison gang. With FBI operatives hot on her trail, Sally&apos;s conscience is challenged when the final package turns out to be a teenage girl.",
  "review": {
    "author": "trinaboice",
    "dateCreated": "2022-08-08",
    "inLanguage": "English",
    "heading": "We&apos;ve never seen Juliette Binoche like this before!",
    "reviewBody": "IN A NUTSHELL: It&apos;s the presence of Morgan Freeman and Juliette Binoche on the movie poster that will pique your interest in this movie. Fans of Frank Grillo will take notice as well when they find out he&apos;s in this action thriller. The film was written and directed by Anna Gutto as her debut feature.\n\nTHINGS I LIKED: We&apos;ve never seen Juliette Binoche look quite like this before! She&apos;s gritty and tough as a big-rig truck driver. As always, she does a fantastic job.\n\nJuliette Binoche spends most of the movie in her truck with the young actress Hala Finley, who also performs well.\n\nIt&apos;s rare to see Frank Grillo NOT be in the middle of all the action in a movie like this.\n\nThere&apos;s a sad conversation about why kids who are kidnapped in the sex trade don&apos;t try to run away. I&apos;ve often wondered that myself. Morgan Freeman&apos;s salty character gives us an interesting and heartbreaking answer.\n\nThere is some suspense mixed with heartwarming moments.\n\nTHINGS I DIDN&apos;T LIKE: I thought for sure we&apos;d see a beach scene at the end.\n\nThe title of the movie was an odd choice.\n\nThe movie doesn&apos;t go deep enough.\n\nTIPS FOR PARENTS: Profanity and many F-bombs (several spoken by a little girl) Jail scenes We see cigarette burns on a man&apos;s hands and tortured bruises on his chest A child is kidnapped Violence with various weapons You see several people get shot and bloodied A girl throws up all over herself We see a young girl in her underwear\n\nTHEMES: Family Human trafficking Sacrifices Past traumas Abuse Betrayal Trust Loneliness The US prison system Conscience and doing what&apos;s right Protecting the innocent Community Friendship\n\nYou can see the full review on the Movie Review Mom YouTube channel.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 6183,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "15",
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "datePublished": "2022-07-29",
  "keywords": "conspiracy thriller,truck driver,written by director,radio news,human trafficking",
  "duration": "PT1H55M",
  "actor": [
    {
      "name": "Juliette Binoche",
      "url": "https://www.imdb.com/name/nm0000300/"
    },
    {
      "name": "Frank Grillo",
      "url": "https://www.imdb.com/name/nm0342029/"
    },
    {
      "name": "Hala Finley",
      "url": "https://www.imdb.com/name/nm6442629/"
    }
  ],
  "director": [
    {
      "name": "Anna Gutto",
      "url": "https://www.imdb.com/name/nm2008031/"
    }
  ],
  "creator": [
    {
      "name": "Anna Gutto",
      "url": "https://www.imdb.com/name/nm2008031/"
    }
  ]
}