{
  "type": "Movie",
  "name": "Guillermo del Toro&apos;s Pinocchio",
  "url": "https://www.imdb.com/tt1488589/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNjBhZjNkNDItODcxMS00ZGNmLTk3ODUtOGU1NWI3N2Q3YmM1XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
  "description": "A father&apos;s wish magically brings a wooden boy to life in Italy, giving him a chance to care for the child.",
  "review": {
    "author": "eddie_baggins",
    "dateCreated": "2022-12-12",
    "inLanguage": "English",
    "heading": "An artistic triumph slightly lacking elsewhere",
    "reviewBody": "Hot on the heels of the Disney released Tom Hanks starring misfire that has found little fanfare around the world after its release on Disney+, Netflix&apos;s high profile and ambitious take on Carlo Collodi&apos;s beloved children&apos;s tale courtesy of the overseeing of Guillermo del Toro and his co-director Mark Gustafson is an artistic triumph that successful re-imagines the tale of a wooden boy and his creator/father in a way that brings new life and freshness to a story that unquestionably wasn&apos;t in need of yet another cinematic adaptation.\n\nTransporting the fantastical adventure of Pinocchio (hear voiced by Gregory Mann) from the setting of 1800&apos;s Italy to pre-World War 2 Italy under the dictatorship of Benito Mussolini and his National Fascist Party, del Toro and Gustafson&apos;s tale is a lot more mature and adult-minded than we&apos;ve seen most times previously in film versions of this tale but as is to be expected from anything with the Mexican artists touch, the film still manages to offer up whimsy, heart and laughter around all the more serious elements that are sure to affect adult viewers here even more than any little ones that give the film a go.\n\nCurrently the longest stop-motion feature film ever made, every frame of Pinocchio is a significant feat of artistry come to life and vision explored, with one left wondering how on earth the team behind this effort managed to pull off such exemplary feats of animation to birth this tale into existence and whether its colourful cities, mangy looking monkey sidekicks, rabbit filled underworlds or a belly of a giant sea beast there is no doubt every inch of this Netflix original is right up there with the best of 2022&apos;s feats of film-making, making this film as close to a shoe-in as possible for this years Best Animated Film Oscar.\n\nWhile there is so much to enjoy in a visual and aesthetics point of view not everything else in del Toro and Gustafson&apos;s film works to the same high level with some of the films infrequent hit and mostly miss humour (a frequently explored joke of Ewan McGregor&apos;s mistreated Cricket grows wearisome), hammer over the head reminder that fascism is bad, Mann&apos;s slightly irritating voice work of Pinocchio and most tellingly a collection of songs that feel slightly underused and questionable in a sense that perhaps this film might have worked perfectly fine ditching the song and dance numbers all together, combine to stop Pinocchio from operating in other departments as highly and memorably as it does in a purely artistically viewed point of analysis.\n\nUndoubtedly Pinocchio can be viewed as a success and head and shoulders above the other 2022 film of the same name but when it comes to what cinematic version of Collodi&apos;s tale still remains best, the 1940 Disney animation must still be regarded as the king.\n\nFinal Say -\n\nAn outstanding artistic achievement that fails to inspire the same level of magic and awe as its technical prowess elsewhere, Netflix&apos;s Pinocchio is a good film that could&apos;ve been an all round masterpiece if other pieces had come together to reach the same levels of its artistry.\n\n3 1/2 hot chocolates out of 5\n\nJordan and Eddie (The Movie Guys)",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 109150,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.6
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Drama",
    "Family"
  ],
  "datePublished": "2022-12-09",
  "keywords": "magic,monkey,stop motion animation,pinocchio character,italy",
  "duration": "PT1H57M",
  "actor": [
    {
      "name": "Ewan McGregor",
      "url": "https://www.imdb.com/name/nm0000191/"
    },
    {
      "name": "David Bradley",
      "url": "https://www.imdb.com/name/nm0103195/"
    },
    {
      "name": "Gregory Mann",
      "url": "https://www.imdb.com/name/nm9640481/"
    }
  ],
  "director": [
    {
      "name": "Guillermo del Toro",
      "url": "https://www.imdb.com/name/nm0868219/"
    },
    {
      "name": "Mark Gustafson",
      "url": "https://www.imdb.com/name/nm0348993/"
    }
  ],
  "creator": [
    {
      "name": "Guillermo del Toro",
      "url": "https://www.imdb.com/name/nm0868219/"
    },
    {
      "name": "Patrick McHale",
      "url": "https://www.imdb.com/name/nm3239034/"
    },
    {
      "name": "Carlo Collodi",
      "url": "https://www.imdb.com/name/nm0172830/"
    }
  ]
}