{
  "type": "Movie",
  "name": "The Greatest Beer Run Ever",
  "url": "https://www.imdb.com/tt10268488/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMWUwOThjYTAtZWYyYy00YjllLTkxYjEtNTJmNTI5N2M1NjkxXkEyXkFqcGdeQXVyOTU0NjY1MDM@._V1_.jpg",
  "description": "A man&apos;s story of leaving New York in 1967 to bring beer to his childhood buddies in the Army while they are fighting in Vietnam.",
  "review": {
    "author": "christianemden",
    "dateCreated": "2022-09-27",
    "inLanguage": "English",
    "heading": "Ignore the title.",
    "reviewBody": "I saw this movie tonight, without having any idea what I was going to see as a part of a mystery movie screening. The movie even has a cold opening, no title no a tors nothing, so I was sitting through the whole thing until I found out what it&apos;s called. I had never heard that this movie existed, what it was about or seen a glimpse of a trailer. This is not a movie that can be marketed, and is likely going to bomb at the box office.\n\nWhich is a real pity, as this is one if the more effective anti war movies I have seen, and I&apos;m familiar with most of the usual suspects in that genre. It&apos;s not going for the big heroic moments, it&apos;s showing what a bloody stupid idea war is, having the Vietnam war as a stand-in for all wars. That doesn&apos;t mean there are even more stupid ideas, like Chickie&apos;s beer run, and believe me when I say Zac Efron is entirely vanishing in that character. I expect him and Russel Crowe to see nominations next award season for their work here, but while Crowe is chewing every scene he is in, Efron gives a much more subtle performance. Showing more with his expressions than words, how he changes as the movie progresses.\n\nIn a time of big franchises, CGI extravaganzas and super heroes, it sounds odd to say this was a breath of fresh air. There is humor in the movie, but it doesn&apos;t subvert the message, I just hope more people are going to see this movie, and talk about this movie, making filmmakers aware that good storytelling is still in demand.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 25875,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "12A",
  "genre": [
    "Adventure",
    "Drama",
    "War"
  ],
  "datePublished": "2022-09-30",
  "keywords": "vietnam war,based on true story,pabst blue ribbon beer,docudrama drama,based on real people",
  "duration": "PT2H6M",
  "actor": [
    {
      "name": "Zac Efron",
      "url": "https://www.imdb.com/name/nm1374980/"
    },
    {
      "name": "Russell Crowe",
      "url": "https://www.imdb.com/name/nm0000128/"
    },
    {
      "name": "Jake Picking",
      "url": "https://www.imdb.com/name/nm4917623/"
    }
  ],
  "director": [
    {
      "name": "Peter Farrelly",
      "url": "https://www.imdb.com/name/nm0268380/"
    }
  ],
  "creator": [
    {
      "name": "Peter Farrelly",
      "url": "https://www.imdb.com/name/nm0268380/"
    },
    {
      "name": "Brian Hayes Currie",
      "url": "https://www.imdb.com/name/nm0192942/"
    },
    {
      "name": "Pete Jones",
      "url": "https://www.imdb.com/name/nm0971919/"
    }
  ]
}