{
  "type": "Movie",
  "name": "The Wonder",
  "url": "https://www.imdb.com/tt9288822/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDBmNzIwY2QtMjZhOC00YzlhLWIwNjMtZDdkZjY3OWUzZDI4XkEyXkFqcGdeQXVyMTAyMjQ3NzQ1._V1_.jpg",
  "description": "A tale of two strangers who transform each other&apos;s lives, a psychological thriller, and a story of love pitted against evil.",
  "review": {
    "author": "david-meldrum",
    "dateCreated": "2022-12-22",
    "inLanguage": "English",
    "heading": "Weighty, Serious And Moving",
    "reviewBody": "It&apos;s a well-rehearsed truism to say that the act of observing a thing changes the object of the object being observed. That&apos;s just one of the weighty questions at the heart of this meditative historical drama, one that&apos;s also concerned with the interaction of science and faith, free will, when or if to stage an intervention with people bent on self-destructive paths, and the sometimes overwhelming power of guilt - both false guilt and that which has more reason.\n\nTo call it patient - despite its under 2-hour running time - is an understatement, but it&apos;s never dull thanks in large part to the haunting score and soundscape, and Florence Pugh&apos;s truly remarkable central performance (she seems to be packing a few of those into her still young career). A strange and potentially alienating device opens the film, drawing attention to its artificiality, but in doing so it highlights that question of observation changing the observed and encouraging us to do what we&apos;re told the characters are doing - believing their own stories as we experience them.\n\nThere&apos;s a thesis to be written here on the film&apos;s theological allusions, one I won&apos;t attempt to start here. But it has caused me to reflect on my own experience of over twenty years as an ordained Anglican (i.e. Episcopal) priest. I&apos;ve seen many people do a wide variety of things in that time, things done in the name of their faith, for reasons of guilt or redemption, that are destructive to themselves or those around them. I&apos;ve even, sadly, met and listened to people who have been forced to experience precisely the horrific thing, the hidden secret of the past on which the plot turns. If it seems too awful to be true, I can assure you it isn&apos;t - for all this film&apos;s deliberate artifice, it&apos;s a deeply truthful one.\n\nDealing with almost as many fundamental questions as you might care to bring to it, this is a weighty, serious, but still moving film that&apos;s carried by Pugh&apos;s brilliance and the production&apos;s patient tone. You will likely think on it for days.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 42557,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2022-11-16",
  "keywords": "1860s,ireland,nurse,timeframe 1800s,catholic faith",
  "duration": "PT1H48M",
  "actor": [
    {
      "name": "Florence Pugh",
      "url": "https://www.imdb.com/name/nm6073955/"
    },
    {
      "name": "Tom Burke",
      "url": "https://www.imdb.com/name/nm0121895/"
    },
    {
      "name": "Kíla Lord Cassidy",
      "url": "https://www.imdb.com/name/nm10765335/"
    }
  ],
  "director": [
    {
      "name": "Sebastián Lelio",
      "url": "https://www.imdb.com/name/nm0133326/"
    }
  ],
  "creator": [
    {
      "name": "Emma Donoghue",
      "url": "https://www.imdb.com/name/nm1480980/"
    },
    {
      "name": "Sebastián Lelio",
      "url": "https://www.imdb.com/name/nm0133326/"
    },
    {
      "name": "Alice Birch",
      "url": "https://www.imdb.com/name/nm2690539/"
    }
  ]
}