{
  "type": "Movie",
  "name": "The Survivor",
  "url": "https://www.imdb.com/tt9242528/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzI3MTQzM2UtNjUzNS00YjFiLTkwZDMtMzRlYTVmYjJhMTU2XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
  "description": "After World War II, Harry Haft is a boxer who fought against his peers in concentration camps. Haunted by memories, he tries to use fighting legends as a way to find his love.",
  "review": {
    "author": "guskeller",
    "dateCreated": "2022-05-15",
    "inLanguage": "English",
    "heading": "Fresh perspective",
    "reviewBody": "The Survivor provides a fresh perspective on a known atrocity. Narratives surrounding the Holocaust are often meaningful, but this adds tragic layers of survivor&apos;s guilt and complicated love. Ben Foster (who is underappreciated) gives a conflicted and vulnerable performance while also sacrificing his body for the role. The third act awkwardly shifts away from boxing and the dialogue is straightforward, but the plot remains extremely humanizing. By maintaining a small scale and examining the protagonist&apos;s complexity, The Survivor makes unbelievable horrors relatable and recontextualizes a desensitized story. For that, the film stands out and succeeds.\n\nTechnically, The Survivor is mixed. The production switches eras and settings. The effects enhance aging and violence. Plus, there are emotional songs sung by characters, and moments of cinematic focus, angles, composition, and motion. Still, it&apos;s the sound (using abstract stings, J-cuts, and silence) and the editing (using smash cuts, match cuts, and wipes) that are the highlights here. Conversely, the lighting makes mistakes, the pacing is clunky, and the production is overly clean. Overall, The Survivor possesses strengths but never transcends its parts. It has important source material and a powerful lead, yet The Survivor&apos;s safe filmmaking limits its ceiling.\n\nWriting: 9/10 Direction: 6/10 Cinematography: 7/10 Acting: 9/10 Editing: 7/10 Sound: 8/10 Score/Soundtrack: 7/10 Production Design: 8/10 Casting: 7/10 Effects: 7/10\n\nOverall Score: 7.5/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 5755,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama",
    "History"
  ],
  "datePublished": "2022-04-27",
  "keywords": "docudrama drama,boxing,shower,sleep,female nudity",
  "duration": "PT2H9M",
  "actor": [
    {
      "name": "Ben Foster",
      "url": "https://www.imdb.com/name/nm0004936/"
    },
    {
      "name": "Billy Magnussen",
      "url": "https://www.imdb.com/name/nm2915105/"
    },
    {
      "name": "Vicky Krieps",
      "url": "https://www.imdb.com/name/nm3043279/"
    }
  ],
  "director": [
    {
      "name": "Barry Levinson",
      "url": "https://www.imdb.com/name/nm0001469/"
    }
  ],
  "creator": [
    {
      "name": "Justine Juel Gillmer",
      "url": "https://www.imdb.com/name/nm2188444/"
    },
    {
      "name": "Alan Scott Haft",
      "url": "https://www.imdb.com/name/nm13617526/"
    }
  ]
}