{
  "type": "Movie",
  "name": "Three Thousand Years of Longing",
  "url": "https://www.imdb.com/tt9198364/",
  "poster": "https://m.media-amazon.com/images/M/MV5BODFjMmVmN2YtOTc5Yy00YWM0LTg0N2ItZDJiNTU5MWMyMDVlXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
  "description": "A lonely scholar, on a trip to Istanbul, discovers a Djinn who offers her three wishes in exchange for his freedom.",
  "review": {
    "author": "Her-Excellency",
    "dateCreated": "2022-08-29",
    "inLanguage": "English",
    "heading": "Not Quite What I Wished For.",
    "reviewBody": "If you, like I was, are expecting a fast-paced, light-spirited, fun romp of visual extravaganza and witty dialogue along the journey that is Three Thousand Years of Longing ... you WILL be disappointed. Now, that is not meant to dissuade you from watching or enjoying it. On the contrary. It is simply meant to temper your expectations.\n\nThere is certainly much beauty in many of this film&apos;s scenes; from curious beauty in the mundane, to fabulous beauty in the fantastical. (There is also a musical scene that will spirit you away to decadent places). Sadly however, for some unknown reason, this film chooses to stay more in the realm of the mundane than the wondrous. The wasted shame in this is almost palpable.\n\nThe film also feels somewhat choppy or disconnected at times. This is especially true quite early, when it begins to touch upon and wander into the mythical almost immediately, but with no real explanation as to why or how those particular scenes tie in with the rest of the film.\n\nLastly, and most grievously, while all the right words existed for this story to be told ... it seemed to lack a bit of passion or fervor from the storytellers.\n\nAll this is NOT to imply that Three Thousand Years of Longing is without its merits.\n\nFor one, Swinton and Elba together (although IMO neither delivering their best performances), is still a treat. They are beautiful separately, and together, they are art. Neither however, could elevate the tone of the film because, intentionally or not, the MAIN TONE of several parts of the film, is more cacophony than cadence. It is my friends, also, far darker and sadder in parts, than what may be expected.\n\nThink of it as a bedtime story for adults where the story is entertaining enough, and the pictures are beautiful, but the Happily Ever After may be a tad bland, bittersweet and hard to swallow.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 57626,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Fantasy",
    "Romance"
  ],
  "datePublished": "2022-09-02",
  "keywords": "bottle,storytelling,djinn,three wishes,female full frontal nudity",
  "duration": "PT1H48M",
  "actor": [
    {
      "name": "Tilda Swinton",
      "url": "https://www.imdb.com/name/nm0842770/"
    },
    {
      "name": "Idris Elba",
      "url": "https://www.imdb.com/name/nm0252961/"
    },
    {
      "name": "Erdil Yasaroglu",
      "url": "https://www.imdb.com/name/nm7301486/"
    }
  ],
  "director": [
    {
      "name": "George Miller",
      "url": "https://www.imdb.com/name/nm0004306/"
    }
  ],
  "creator": [
    {
      "name": "George Miller",
      "url": "https://www.imdb.com/name/nm0004306/"
    },
    {
      "name": "Augusta Gore",
      "url": "https://www.imdb.com/name/nm13676107/"
    },
    {
      "name": "A.S. Byatt",
      "url": "https://www.imdb.com/name/nm0125706/"
    }
  ]
}