{
  "type": "Movie",
  "name": "Whitney Houston: I Wanna Dance with Somebody",
  "url": "https://www.imdb.com/tt12193804/",
  "poster": "https://m.media-amazon.com/images/M/MV5BY2MyZWMxN2QtMWQ5Mi00MTUyLWFlYjItYjExZWQxNzA1M2FjXkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_.jpg",
  "description": "A joyous, emotional, heartbreaking celebration of the life and music of Whitney Houston, one of the greatest female R&B pop vocalists of all time, tracking her journey from obscurity to musical super stardom.",
  "review": {
    "author": "Avwillfan89",
    "dateCreated": "2023-02-07",
    "inLanguage": "English",
    "heading": "Way too sanitised.",
    "reviewBody": "I like a biopic as much as the next person. But when one creates a biopic, they have to show a different side to the person we know behind the celebrity, or something the average person doesn&apos;t really know up until this point.\n\nThis film ain&apos;t one of them.\n\nThe film takes up way too much of its runtime showing Whitney&apos;s iconic performances in their total. Which not many music biopics do and for good reason; we can just watch them elsewhere.\n\nIt also doesn&apos;t focus in too much on her personal life. The domestic and drug abuse between her and Bobbi was toned down, her relationship with Robyn, arguably the best moments in the film, are fleeting, and the film is way too nice to Clive Davis (not surprising since he executive produced the film) who was like her family, but also like her family, tried to mould her into something she was not.\n\nIt&apos;s clear that to this day, people still want to control Whitney&apos;s legacy. So as a result, the film cannot explore the complexities, flaws, turmoils and difficulties of this incredibly talented woman. Because there is no doubt, she was a one of a kind phenomenal singer.\n\nBut the film is not interested in going further into her inner emotional life - only scratching the surface and emphasising her talent.\n\nI would suggest watching the Kevin MacDonald documentary, which focuses more on why Whitney ended her life the way she did and the clues to her inner turmoil, while also listing her contributions to the music world and the things she loved the most in life.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 21841,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "12A",
  "genre": [
    "Biography",
    "Drama",
    "Music"
  ],
  "datePublished": "2022-12-26",
  "keywords": "1990s,1980s,based on true story,based on real people,soul music",
  "duration": "PT2H24M",
  "actor": [
    {
      "name": "Naomi Ackie",
      "url": "https://www.imdb.com/name/nm7609875/"
    },
    {
      "name": "Stanley Tucci",
      "url": "https://www.imdb.com/name/nm0001804/"
    },
    {
      "name": "Ashton Sanders",
      "url": "https://www.imdb.com/name/nm5480894/"
    }
  ],
  "director": [
    {
      "name": "Kasi Lemmons",
      "url": "https://www.imdb.com/name/nm0501435/"
    }
  ],
  "creator": [
    {
      "name": "Anthony McCarten",
      "url": "https://www.imdb.com/name/nm0565026/"
    }
  ]
}