

{
  "type": "Movie",
  "name": "A Dangerous Method",
  "url": "https://www.imdb.com/tt1571222/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTU5Mjk3NjgxMl5BMl5BanBnXkFtZTcwMDM5MjA5Ng@@._V1_.jpg",
  "description": "A look at how the intense relationship between Carl Jung and Sigmund Freud gives birth to psychoanalysis.",
  "review": {
    "author": "Boba_Fett1138",
    "dateCreated": "2012-03-27",
    "inLanguage": "English",
    "heading": "The movie does a good job....at telling you absolutely nothing!",
    "reviewBody": "A movie about Carl Jung and Sigmund Freud directed by David Cronenberg? That sounds surprising and interesting, to say the very least but the movie as it turned out, was far from anything interesting to watch.\\n\\nThere are really multiple causes. The first and foremost problem is obviously with its story. And not just only the story in itself but also the things its emphasizes and puts its focus on. It makes some bad choices with this, which makes this movie feel like a very dry and distant one.\\n\\nThe movie is mostly focusing on the &apos;romance&apos; between Jung and his mental patient, played greatly by Keira Knightley. Nothing wrong with that, if only the romance was anything really romantic or something to feel involved with. It instead just feels wrong and dirty and besides isn&apos;t made all that believable. Why, out of all of his patients and opportunities he must have had in his life, does Carl Jung suddenly decide to have an affair with this particular woman? What was so different or intriguing about her? This movie really doesn&apos;t give you the answers to any of this.\\n\\nAnd if you think that this movie is being one that is sort of showing the rivalry between Freud and Jung and their opposing psychology methods, you are completely wrong. There is never any interesting dynamic between the two of them, which is granted also due to the fact that Viggo Mortensen as Sigmund Freud, is hardly in the movie at all.\\n\\nAnd don&apos;t know what their methods were and why there are still being used in today&apos;s psychoanalysis and why the both of them are being regarded as the two founding fathers of psychoanalysis? Don&apos;t expect this movie to show or tell you anything! It really remains on the surface all, as if it was afraid for its own subject and that it might loose some of its viewers with it.\\n\\nIn other words, the movie really isn&apos;t telling you anything interesting and it&apos;s mostly being an unusual romantic movie, you&apos;ll get very little out off.\\n\\nAll a same really, since the movie itself remains well made and acted out. It&apos;s a pretty good looking movie, with all of its historical sets and costumes and the actor&apos;s play their roles convincingly. It at least still makes the movie watchable but it&apos;s barely enough to keep you interested in it.\\n\\n6/10 \\n\\nhttp://bobafett1138.blogspot.com/",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 107948,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama",
    "Romance"
  ],
  "datePublished": "2012-02-10",
  "keywords": "spanking a woman,psychoanalysis,psychology,female masochist,friendship",
  "duration": "PT1H39M",
  "actor": [
    {
      "name": "Michael Fassbender",
      "url": "https://www.imdb.com/name/nm1055413/"
    },
    {
      "name": "Keira Knightley",
      "url": "https://www.imdb.com/name/nm0461136/"
    },
    {
      "name": "Viggo Mortensen",
      "url": "https://www.imdb.com/name/nm0001557/"
    }
  ],
  "director": [
    {
      "name": "David Cronenberg",
      "url": "https://www.imdb.com/name/nm0000343/"
    }
  ],
  "creator": [
    {
      "name": "Christopher Hampton",
      "url": "https://www.imdb.com/name/nm0358960/"
    },
    {
      "name": "John Kerr",
      "url": "https://www.imdb.com/name/nm4301796/"
    }
  ]
}