

{
  "type": "Movie",
  "name": "Harry Potter and the Deathly Hallows - Part 2",
  "url": "https://www.imdb.com/tt1201607/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjE5OTE4N2UtNzllYi00OTgzLWIzZWMtNzNjMThmZTc5ZGFkXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
  "description": "Harry, Ron, and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts.",
  "review": {
    "author": "theycallmemrglass",
    "dateCreated": "2011-07-07",
    "inLanguage": "English",
    "heading": "An Exhilarating and Beautiful Conclusion to a Magnificent Saga.",
    "reviewBody": "I saw this at a preview screening in London.\\n\\nDeathly Hallows part 2 ends this incredibly well produced saga with tremendous grace and a beautifully orchestrated climax that I am sure will satisfy both lovers of the books and films.\\n\\nIf you have read the books as I have you will be glad to know major key moments are intact. Much is missing but I won't dwell on that, no point, its how well this movie plays out and for me it rolls wonderfully between excitement, thrills and emotional drama towards a satisfactory (though a slightly rushed) conclusion. \\n\\nThere are at least 2 sequences so powerful that I defy anyone not to at least stifle a tear or choke a little. One of those sequence is an exquisitely executed flashback that is pivotal to the whole story. \\n\\nI have to say, that despite the woes we book readers have when elements (big chunks of it too) are omitted from the movies, much credit still has to go to Steve Kloves for adapting the books for the big screen, cleverly weaving, changing and even adding new big elements to give a kinetic flow to the narrative and here it all comes together superbly.\\n\\nDavid Yates assured direction has nurtured our young actors in the last 4 films to blossom into even more adept actors who convey their characters with natural tones without overacting. Daniel Radcliffe had to carry this movie more than any other and has done so brilliantly complemented with great support from his two companions, Emma Watson and Rupert Grint.\\n\\nPretty much all the characters we have met in all the movies have made an appearance in this finale but one actor stands out, Alan Rickman. His portrayal of Professor Snape has always been a joy to watch (if a little novel) but here his scenes will leave a dramatic engraving in my memory. Here he elevates his portrayal of one of the most complex character in young adult literature to an unforgettable piercingly emotional one.\\n\\nAnother actor who really shines in the few scenes that he has, is Matthew Lewis as Neville Longbottom who we see gradually transforming over the past films from the clumsy bullied boy to a brave warrior in this final film. Many other British thespians of the series also have their few moments to shine especially Maggie Smith's Professor McGonagal who was a delight to watch as she takes charge of the defence of Hogwarth School.\\n\\nAs for the spectacle of the battle and showdowns, while not at the scale of Lord of the Rings, I honestly cant think how it could have been done better as the film makers have intertwined heart stopping action with dramatic progressions in the narrative. Its actually more visceral and dynamic than the rather smaller scale battle of the brilliant novels (not to take anything away from Rowling's writing). \\n\\nDo I have any gripes? Yes I do. Although I applaud Steve Kloves for a difficult screenplay adaption...I think he could still have done better at explaining some odd anomalies that only readers of the book will understand. This might annoy you if you haven't read the books. But its a small gripe because what we get is delightful.\\n\\nWhat an amazing achievement to faithfully bring Rowling's epic saga to the big screen with the same cast and largely the same crew, maintaining the brilliant quality right to the end.\\n\\nOh my god, its only just sinking in, this was the end....but what a great great end.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 939557,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 8.1
  },
  "contentRating": "12A",
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "datePublished": "2011-07-15",
  "keywords": "friendship,snake,ginny weasley character,lucius malfoy character,hermione granger character",
  "duration": "PT2H10M",
  "actor": [
    {
      "name": "Daniel Radcliffe",
      "url": "https://www.imdb.com/name/nm0705356/"
    },
    {
      "name": "Emma Watson",
      "url": "https://www.imdb.com/name/nm0914612/"
    },
    {
      "name": "Rupert Grint",
      "url": "https://www.imdb.com/name/nm0342488/"
    }
  ],
  "director": [
    {
      "name": "David Yates",
      "url": "https://www.imdb.com/name/nm0946734/"
    }
  ],
  "creator": [
    {
      "name": "Steve Kloves",
      "url": "https://www.imdb.com/name/nm0460141/"
    },
    {
      "name": "J.K. Rowling",
      "url": "https://www.imdb.com/name/nm0746830/"
    }
  ]
}