

{
  "type": "Movie",
  "name": "Judy Moody and the Not Bummer Summer",
  "url": "https://www.imdb.com/tt1547230/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjA4NDc0NzI5OV5BMl5BanBnXkFtZTcwMjc0MDA4NA@@._V1_.jpg",
  "description": "Third grader Judy Moody sets out to have the most thrilling summer of her life.",
  "contentRating": "PG",
  "genre": [
    "Comedy",
    "Family"
  ],
  "datePublished": "2011-10-21",
  "keywords": "costume,book,bedroom,imagination,vomiting",
  "duration": "PT1H33M",
  "rating": {
    "ratingCount": 3417,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.3
  },
  "review": {
    "author": "american218",
    "dateCreated": "2011-07-13",
    "inLanguage": "English",
    "heading": "Judy Moody and the NOT Bummer Summer is a MASTERPIECE.",
    "reviewBody": "I really enjoyed watching this Fantastic successful family movie,it was great fun and never got bored with it.The acting was brilliant and the kids were so cute and so funny that I wished I had kids like them,this is not exaggeration at all.\\n\\nJudy Moody is a cuddly kid in 3rd grade and this exceptional year she plans her extraordinary summer vacation with her best cute friends Rocky and Amy.So Judy packed all her things with her including candy,toys and kids stuff and invited her friends to accompany her in this outstanding Summer Vacation.Unfortunately for Judy Her first friend Rocky is going to circus camp to learn to tame lions,determined Judy didn&apos;t despair she talks to Amy who is also busy this summer but in something else traveling to Borneo with her mom to save a lost tribe. Alas for the lovely Judy she could not help but stay home with her troublesome little brother Stink and second best friend Frank Pearl.\\n\\nPoor little beautiful girl Judy while she was dreaming of having a whale of time swimming in the sea,having fun ,eating ice cream & playing with her best friends,things turned out quite the opposite for her.\\n\\nBut this is not the end of the world for the gorgeous Judy,she suddenly hears that her parents will spend the Summer Vacation in California and Judy can go with them & stay with her Aunt Opal, whom she has never even met! \\n\\nNevertheless beautiful, smart,strong and cute Judy went To California but what she doesn&apos;t know is that she has to face there one of the most pleasant and unexpected surprises she has never ever seen which will positively change her mood in a funny mysterious way you&apos;ll detect its splendor in this masterpiece Guaranteed entertaining family movie.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "actor": [
    {
      "name": "Jordana Beatty",
      "url": "https://www.imdb.com/name/nm1970642/"
    },
    {
      "name": "Heather Graham",
      "url": "https://www.imdb.com/name/nm0001287/"
    },
    {
      "name": "Parris Mosteller",
      "url": "https://www.imdb.com/name/nm2673828/"
    }
  ],
  "director": [
    {
      "name": "John Schultz",
      "url": "https://www.imdb.com/name/nm0776271/"
    }
  ],
  "creator": [
    {
      "name": "Kathy Waugh",
      "url": "https://www.imdb.com/name/nm0915291/"
    },
    {
      "name": "Megan McDonald",
      "url": "https://www.imdb.com/name/nm3696683/"
    }
  ]
}