

{
  "type": "Movie",
  "name": "Phil Ochs: There But for Fortune",
  "url": "https://www.imdb.com/tt1597089/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjA2NTI0OTk3M15BMl5BanBnXkFtZTcwMDg3NDA2NA@@._V1_.jpg",
  "description": "From civil rights to the anti-war movement to the struggles of workers, folksinger Phil Ochs wrote topical songs that engaged his audiences in the issues of the 1960s and 70s. In this biographical documentary, veteran director Kenneth Bowser captures the force of historical events on individuals through Ochs' life and music.",
  "review": {
    "author": "orrsisland",
    "dateCreated": "2011-03-26",
    "inLanguage": "English",
    "heading": "Captures the Force of Historical Events on Individuals",
    "reviewBody": "I went originally to see this documentary because I loved Ochs music - even played some of it badly at one time - but feared it might simply be a 'trip down memory lane'. But the film is so much more than a bio of Ochs and his music or - thank god - just an exercise in nostalgia. It really captured the power and significance of the historically altering events of the 60's - both for the country and for individuals. I wish everyone - especially young people - could see it. Ochs comments in the film that Nixon used the stereotype of a drugged out-of-control protester to present the masses with the false choice of himself or 'those'. Of course that strategy of fear and false political choices is not unique to Nixon - always existed and still does. Nonetheless,it still saddens and angers me that conservatives have succeeded so well in shaping the historical lens that most people see the 60's through now. Most people today simply think of drugs, sex, rock-and-roll, and self-indulgence when they think of the 60's. Lost is any mass knowledge of what happened in Birmingham, or to martyrs like the Philadelphia Three, or the work of thousands of sincere people like Ochs who fought for fairness. The film captures this split - how the 60's was really two segments - and just as Ochs lost his way after Chicago - so did the nation. I don't have a problem with the fact that there wasn't more musical footage of Och's music in the documentary. There was enough to present his music and place in the folk scene of his time. Other sources can fill in more of his music - and hopefully people who aren't familiar with his music will do that. One documentary cannot be three films - i.e. personal bio, musical compilation, and historical analysis. It needs to have a focus and point of view. And,for me, this film captured the power and impact of his music, and how his personal life followed - sadly - the country's loss of trust and hope.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 413,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "Unrated",
  "genre": [
    "Documentary",
    "Biography",
    "History"
  ],
  "datePublished": "2011-01-05",
  "keywords": "biographical documentary,music documentary",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Salvador Allende",
      "url": "https://www.imdb.com/name/nm0021201/"
    },
    {
      "name": "Erik Andersen",
      "url": "https://www.imdb.com/name/nm7497848/"
    },
    {
      "name": "Joan Baez",
      "url": "https://www.imdb.com/name/nm0001926/"
    }
  ],
  "director": [
    {
      "name": "Kenneth Bowser",
      "url": "https://www.imdb.com/name/nm0101461/"
    }
  ],
  "creator": [
    {
      "name": "Kenneth Bowser",
      "url": "https://www.imdb.com/name/nm0101461/"
    }
  ]
}