

{
  "type": "Movie",
  "name": "Waiting for Forever",
  "url": "https://www.imdb.com/tt1296898/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTMyNzg3MDE5MF5BMl5BanBnXkFtZTcwNjM4NTQyNA@@._V1_.jpg",
  "description": "A Hollywood-set romantic tale of a guy who is content to live his life without a job yet with the love of his life, a young actress.",
  "review": {
    "author": "supadude2004",
    "dateCreated": "2011-04-24",
    "inLanguage": "English",
    "heading": "Pretty Compelling Above Average Romantic Movie.",
    "reviewBody": "Oddball Juggler lusts after (FHM's 77th hottest) gal next door (...or close enough), with whom he shared a childhood. Alas, this movie takes off where childhood is no more - so what will become of our pair, for whom time has moved on? In some ways this is an enjoyable, flirty little number; in others, it is the tale of unrequited 'what if's'. Yet, when all's said and done, this movie is not perfect. It's still a reasonably engaging, very human tale. Acting and direction are pretty good.\\n\\nThe protagonist is (just as the poster shows) an unlikely, pyjama loving, bowler hatted someone who can barely afford to live. Such is American cinema that if he should choose to escape his plight, in the usual manner, he'd routinely be found bereft of life, a few scenes later. Instead, he overdoses on dreams of his childhood sweetheart, thus to escape the uncertain pains which life besets upon a man of his standing. Yet we must be prepared to accept that a certain Miss foxy 'hot-thang' would possibly give him more than the time of day/evensong/etc. Or, will she? Indeed, I found it hard to stomach the movie's very premise: that here we have arguably one of the hottest women in America who might even talk with a man whose preoccupation is profitlessly offbeat, to say the least. In his defence, as the marketing blurb will tell you, they shared a childhood. But will that be enough? Again, this is primarily a romance movie, and why should any realities have any potential to ruin the possibilities? Or, do they? Watch and see: I give nothing away.\\n\\nIf you're between 16 & 24, female, or in a relationship, or just romantically inclined, then this movie is for you.\\n\\nIts rating, currently 6.8/10, is surprisingly on the ball. Most people here have got this one right. And as such it is a movie worth watching. You might even consider it as being like a less garrulous, 'home baked' alternative to Linklater's superior 'Before Sunrise'.\\n\\nLastly, I hope that they make a sequel to this movie, by the way, as this reviewer personally felt that its ending left some curious questions open. Will you agree... Please watch and see!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 20196,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "PG",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2011-02-04",
  "keywords": "brother brother relationship,grief,self acceptance,orphan,haunted by the past",
  "duration": "PT1H35M",
  "actor": [
    {
      "name": "Rachel Bilson",
      "url": "https://www.imdb.com/name/nm1377375/"
    },
    {
      "name": "Tom Sturridge",
      "url": "https://www.imdb.com/name/nm0836432/"
    },
    {
      "name": "Richard Jenkins",
      "url": "https://www.imdb.com/name/nm0420955/"
    }
  ],
  "director": [
    {
      "name": "James Keach",
      "url": "https://www.imdb.com/name/nm0005077/"
    }
  ],
  "creator": [
    {
      "name": "Steve Adams",
      "url": "https://www.imdb.com/name/nm0011376/"
    }
  ]
}