{
  "type": "Movie",
  "name": "Evil Dead Rise",
  "url": "https://www.imdb.com/tt13345606/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTRkZGE1MjItOTc2NC00YTMzLWJlZTUtNGM1ZDJmYTViMWUyXkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_.jpg",
  "description": "A twisted tale of two estranged sisters whose reunion is cut short by the rise of flesh-possessing demons, thrusting them into a primal battle for survival as they face the most nightmarish version of family imaginable.",
  "review": {
    "author": "BA_Harrison",
    "dateCreated": "2023-04-21",
    "inLanguage": "English",
    "heading": "Cronin fails to rise to the occasion.",
    "reviewBody": "After all the hype, the rave reviews, the revealing trailers, and the silly reaction videos (God, how I hate those), Evil Dead Rise turns out to be exactly what I expected: a serviceable sequel, nothing more, nothing less. Like the remake before it, it delivers on the gore, but is lacking in originality and likeable characters.\n\nThe film takes place in a rundown apartment building, home to single mother Ellie (Alyssa Sutherland) and her three obnoxious brats, Bridget (Gabrielle Echols), Danny (Morgan Davies) and Kassie (Nell Fisher). After an earthquake hits the area, Danny discovers a secret vault below the building&apos;s underground car park where he finds an ancient book and three old records. Playing the discs unleashes an ancient evil that possesses his mother and spreads to other people in the building. On hand to protect the kids and fight the evil is Ellie&apos;s sister Beth (Lily Sullivan).\n\nWriter/director Lee Cronin conducts matters in a workmanlike manner, ladling on the blood and slime, killing off characters that might reasonably be expected to survive many a horror movie, and throwing in a few nods to the original movies to appease long-time fans of all things Evil Dead (I particularly enjoyed the EDII flying eyeball scene); unfortunately, the film wastes its promising locale by confining most of the action to one apartment and doesn&apos;t generate much in the way of atmosphere or genuine scares (I didn&apos;t jump once).\n\nWhat the film sorely needed was more imagination and creativity (in both story and direction), and characters that I could actually care about -- exactly the qualities that still make the original film the best of the franchise.\n\n5.5/10, rounded up to 6 for IMDb.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 129308,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "18",
  "genre": [
    "Horror"
  ],
  "datePublished": "2023-04-21",
  "keywords": "book of the dead,necronomicon,sister sister relationship,possession,chainsaw",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Mirabai Pease",
      "url": "https://www.imdb.com/name/nm5685676/"
    },
    {
      "name": "Richard Crouchley",
      "url": "https://www.imdb.com/name/nm11156289/"
    },
    {
      "name": "Anna-Maree Thomas",
      "url": "https://www.imdb.com/name/nm8609147/"
    }
  ],
  "director": [
    {
      "name": "Lee Cronin",
      "url": "https://www.imdb.com/name/nm2091846/"
    }
  ],
  "creator": [
    {
      "name": "Lee Cronin",
      "url": "https://www.imdb.com/name/nm2091846/"
    }
  ]
}