{
  "type": "Movie",
  "name": "Sisu",
  "url": "https://www.imdb.com/tt14846026/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMWYwMzNkOWEtNjA3YS00YjE5LTlkMjYtMmRjMjExNjA1NDM0XkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_.jpg",
  "description": "When an ex-soldier who discovers gold in the Lapland wilderness tries to take the loot into the city, Nazi soldiers led by a brutal SS officer battle him.",
  "review": {
    "author": "RightOnDaddio",
    "dateCreated": "2023-04-28",
    "inLanguage": "English",
    "heading": "Sisu. A Man of Few Words Seeks a Life of Peace After The Hell of War.",
    "reviewBody": "Finland. Such a gorgeous landscape even when war torn. It&apos;s 1944 and a rogue commander now wanders the Laplands looking for gold, oh, that precious and sweet yellow metal. The Second World War is rumbling to a noisy end, and still a reminder that it&apos;s there off in the not so far distance and occasionally it&apos;s even closer in the air overhead.\n\nThis elder and his really cool-looking dog (I want one!) search this ravaged world, just the two of them and a horse as well. Panning for riches.\n\nThis is a silent film for the first half hour or so, but where conversation may lack, the beauty of everything else on screen fills in those gaps rather nicely. (You&apos;ll think as you watch, I want to visit Finland. I want to live in Finland.) But this is the mid-1940&apos;s and there are Nazis being pushed out of the country at the moment and they are losing this war and their death-grip on this land and its&apos; people.\n\nThis movie is told in six announced chapters. It&apos;s a gloriously short hour and a half. Tarantino&apos;s influence is heavy but more so from his Westerns than from Inglorious Basterds as one might think.\n\nThe kills are awesome. The fights are realistic and not like the choreographed dance fighting we see in most modern productions these days.\n\nThough there is little dialogue as stated, it is told here in English and there are no subtitles.\n\nThe action sequences are breathtaking and hearten back to Raiders of the Lost Ark.\n\nI&apos;m serious!\n\nThis is a good story and it is timeless.\n\nA man and his dog want to live comfortably, in peace, and be left alone.\n\nThis is one of the Best Films of 2023.\n\nThis is one of the Best Films of the 2020s.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 66703,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.9
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "War"
  ],
  "datePublished": "2023-05-26",
  "keywords": "one man army,gun violence,world war two,1940s,nazi",
  "duration": "PT1H31M",
  "actor": [
    {
      "name": "Jorma Tommila",
      "url": "https://www.imdb.com/name/nm0866918/"
    },
    {
      "name": "Aksel Hennie",
      "url": "https://www.imdb.com/name/nm0377336/"
    },
    {
      "name": "Jack Doolan",
      "url": "https://www.imdb.com/name/nm1660027/"
    }
  ],
  "director": [
    {
      "name": "Jalmari Helander",
      "url": "https://www.imdb.com/name/nm1118351/"
    }
  ],
  "creator": [
    {
      "name": "Jalmari Helander",
      "url": "https://www.imdb.com/name/nm1118351/"
    }
  ]
}