{
  "type": "Movie",
  "name": "The Mill",
  "url": "https://www.imdb.com/tt26569323/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZDc1NzM0MTQtZjQ3Ny00MWViLTk1YTAtMjA5NDRhZWI5YjNmXkEyXkFqcGdeQXVyMzQ1OTY2Nzg@._V1_.jpg",
  "description": "A businessman mysteriously wakes up in an open-air prison cell with only an old grist mill. Forced to work as a beast of burden, he must find a way to escape before the birth of his child.",
  "review": {
    "author": "anthonyiaclaims",
    "dateCreated": "2023-10-11",
    "inLanguage": "English",
    "heading": "Lil out of shape Rey does his best Conan impersonation",
    "reviewBody": "If you are old enough to remember Schartzeneger in Conan, you&apos;ll remember him pushing a similar wheel with 3 other men and then through the magic of a Hollywood montage he became huge over time and pushed it alone. Lil Rey has smaller arms than the kid from Conan (bigger tits though) and when he started pushing it he couldn&apos;t even budge it. He had to throw all of his weight onto it 3 times to get it to move an inch or two. Somehow, he worked 16 hours and made 5 laps.... Is that believable? No, but even worse, if you&apos;ve ever worked that hard at something you are not used too, you know that the next several days are hell. Aches, pain, cramps and he got 1 bottle of water a day. Somehow, he does 100 revolutions though, then 370, then over 700. I&apos;m guessing none of the writers can do a single push up as they know nothing about how the human body works. Not the worst movie ever but what is irritating is if they showed this to a kid in 9th grade who has worked out before, that kid could have done a quick 30 minute re-write that would have improved the story immensely. This film is just watchable, if that&apos;s why you make movies, congrats, you did the bare minimum.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 2164,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": null,
  "genre": [
    "Drama",
    "Mystery",
    "Sci-Fi"
  ],
  "datePublished": "2023-12-19",
  "keywords": "prison,escape",
  "duration": "PT1H46M",
  "actor": [
    {
      "name": "Lil Rel Howery",
      "url": "https://www.imdb.com/name/nm2577076/"
    },
    {
      "name": "Pat Healy",
      "url": "https://www.imdb.com/name/nm0372366/"
    },
    {
      "name": "Karen Obilom",
      "url": "https://www.imdb.com/name/nm5352046/"
    }
  ],
  "director": [
    {
      "name": "Sean King O&apos;Grady",
      "url": "https://www.imdb.com/name/nm2968183/"
    }
  ],
  "creator": [
    {
      "name": "Jeffrey David Thomas",
      "url": "https://www.imdb.com/name/nm2853320/"
    }
  ]
}