{
  "type": "Movie",
  "name": "Your Lucky Day",
  "url": "https://www.imdb.com/tt16424988/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOTFhNjBjOGEtYTY5ZS00ZWNjLWE3NGUtNWRmMmVmZjA5ZTA4XkEyXkFqcGdeQXVyMDA4NzMyOA@@._V1_.jpg",
  "description": "After a dispute over a winning lottery ticket turns into a deadly hostage situation, the witnesses must decide exactly how far they&apos;ll go, and how much blood they&apos;re willing to spill, for a cut of the $156 million.",
  "review": {
    "author": "SnoopyStyle",
    "dateCreated": "2024-01-07",
    "inLanguage": "English",
    "heading": "loses me with the cops",
    "reviewBody": "Drug dealer Sterling (Angus Cloud) gets rolled. He is one of the patrons in a convenience store when a customer discovers that he won the $156 million lottery jackpot. Sterling decides to steal the ticket and all heck brings loose.\n\nI don&apos;t watch Euphoria, but I do remember Angus Cloud&apos;s death. There is a powerful unstable energy about him. He is very cinematic and magnetic. I completely buy his impulsiveness and recklessness. He also has an endearing quality and is able maintain the rooting interest. I like the first half. Sterling has no plan with the robbery and the story flows from that. I assume that the rest of the people are partly playing Sterling to stay alive. Whatever plans they come up with is to appease Sterling. That part works. The problem is that there is no perfect crime in this after the messy killing. That doesn&apos;t matter since Sterling is not the sharpest mind. The crooked cops are a big problem. They would never get away with it. Sterling can have no plan. If the cops have no good plan, then the movie suffers and it&apos;s bad writing. This is half-good. The second half loses me.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 1009,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "R",
  "genre": [
    "Thriller"
  ],
  "datePublished": "2023-11-10",
  "keywords": "christmas,female frontal nudity,female full frontal nudity,female nudity,year 2017",
  "duration": "PT1H29M",
  "actor": [
    {
      "name": "Angus Cloud",
      "url": "https://www.imdb.com/name/nm3783307/"
    },
    {
      "name": "Elliot Knight",
      "url": "https://www.imdb.com/name/nm3231931/"
    },
    {
      "name": "Jessica Garza",
      "url": "https://www.imdb.com/name/nm3309992/"
    }
  ],
  "director": [
    {
      "name": "Dan Brown",
      "url": "https://www.imdb.com/name/nm3699300/"
    }
  ],
  "creator": [
    {
      "name": "Dan Brown",
      "url": "https://www.imdb.com/name/nm3699300/"
    }
  ]
}