{
  "type": "Movie",
  "name": "Five Feet Apart",
  "url": "https://www.imdb.com/tt6472976/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjM4OTE2NTk5Nl5BMl5BanBnXkFtZTgwOTQ2MjU2NjM@._V1_.jpg",
  "description": "A pair of teenagers with cystic fibrosis meet in a hospital and fall in love, though their disease means they must avoid close physical contact.",
  "review": {
    "author": "rgkarim",
    "dateCreated": "2019-03-15",
    "inLanguage": "English",
    "heading": "Five Feet Apart From Other Romance Dramas",
    "reviewBody": "Teenage romance movies always hold special places in a lot of people&apos;s hearts, but depending on the decade your familiar with, the elements and presentation are a little different. Eighties brought comedy with emotional drama, nineties was the Nicholas Sparks beginning with the cute, cheesy tactics, early 2000s were all about the Nicholas Sparks, super dramatic stories that hold a lot of places in the hearts of the public. Then came the 2010s and the twist was now romance, but put some type of terminal illness with it to sweeten the deal... So tonight&apos;s movie continues this current trend, taking another story in hopes of invoking tears and pulling the heart strings of the audience at the same time. Yes, tonight is Five Feet Apart and yours truly is here to write his reviews as always and share his opinions. Let&apos;s go:\n\nMovie: Five Feet Apart (2019)\n\nDirector: Justin Baldoni Writers: Mikki Daughtry, Tobias Iaconis Stars: Haley Lu Richardson, Cole Sprouse, Claire Forlani\n\n LIKES: Acting Character Use Comedy Appreciation of Art Beautiful Romantic Nice Surprises\n\nSUMMARY: The latest movie fills the formula of sad, drama meeting the romantic teenage plotlines. Fortunately, the acting is there to bring a fantastic dynamic to latch onto in the form of Cole Sprouse and Harley Lu Richardson. Their chemistry is amazing, bringing the two sides of the romantic cone to life in a very sweet, charming, and surprisingly realistic way. Five Feet Apart takes these characters and does a fantastic job advancing them past the carbon copy templates most of these films do. The supporting cast does a wonderful job of being integrated into the story, their own tales and dynamics meshing well to bring out the main characters in new ways. Of course the movie somehow manages to add on to the simple romantic story by appreciating other dynamics that can be included in romance movies. The comedy is simple and classy, fitting very well with the tone of the movie without being too forced. For those enjoying symbology in the visual arts, the rooms and works of our proverbial Romeo and Juliet have plenty of artistic bite that is quite impressive to behold, instigating a little jealously in my mind about their artwork. As for the romance component itself, again I give them props for finding a way to bring love and beauty into a realistic way that was both poetic and fun to behold. Five Feet Apart takes most of the cheese factor out of the romance, and instead makes it an adventure that is fun to go on. The ordeal of the disease contending with the blossoming love is a driving force of the film and somehow manages to be fresh despite how plotted love tales are. Perhaps it is also the surprises that come in at points that assists with keeping the adventure going, finding ways to divert from the film, without going too far away from the tale at hand. With all these components it works very well for me.\n\n DISLIKES:\n\nPredictable Cheesy At Times Scientific Stretches The Parent Components?\n\n SUMMARY: No surprise, the movie follows much of the same formula, and my friend and I were able to predict much of the movie based on the trailers we had seen. Fortunately, surprises were able to help with this, but they still held some trouble keeping the romantic movie cheese fest from happening. Five Feet Apart leaves much of the mushy, gushy, Nicholas Sparks like drama that is difficult to get away from, which is a selling point for most going to these movies, but for me could have used a little more spice up. In addition, some of the scientific plausibility for one with my mindset are difficult to get over in terms of the miracles vs. the statistical chances of the real life. Some of the interactions, primarily in the ending occurring the way it did, was very unrealistic and seeing these miracle moments only added to the cheesy coincidences that this series is famous for. If that&apos;s not something that bothers you, no worries on this, but for me this is just something to warrant on. As for the parents, they were okay, but I felt that for something as intense as the themes in this movie, some more involvement would be seen. Five Feet Apart&apos;s weakest characters are actually the parents, reduced to a few lines of dialogue and the background images. Sure, it&apos;s not about them, but in the other films similar to this, the parents were very active in the support of the kids. What happened here?\n\n The VERDICT:\n\nOverall, Five Feet Apart was much better than I had anticipated, with a lot more heart, artistic beauty, and adventure than many of the romance/dramas that I&apos;ve seen. A strong cast, character usage, and surprises in terms of comedy and plot were the selling points for this reviewer in regards to this film. It still has predictability and cheese factors, primarily in the scientific stretches, but the good far outweighs the bad for me in regards to this category of movies. I think this is one for the theater in regards to dramas. If not check this one out for a rent/stream because it&apos;s got the heart that movies are known to have.\n\nMy scores are:\n\nDrama/Romance: 8.0 Movie Overall: 7.0",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 80189,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.2
  },
  "contentRating": "12A",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2019-03-22",
  "keywords": "hospital,cystic fibrosis,terminal illness,teenager,teenage boy",
  "duration": "PT1H56M",
  "actor": [
    {
      "name": "Haley Lu Richardson",
      "url": "https://www.imdb.com/name/nm4726634/"
    },
    {
      "name": "Cole Sprouse",
      "url": "https://www.imdb.com/name/nm0819850/"
    },
    {
      "name": "Moises Arias",
      "url": "https://www.imdb.com/name/nm2030779/"
    }
  ],
  "director": [
    {
      "name": "Justin Baldoni",
      "url": "https://www.imdb.com/name/nm1682573/"
    }
  ],
  "creator": [
    {
      "name": "Mikki Daughtry",
      "url": "https://www.imdb.com/name/nm5657522/"
    },
    {
      "name": "Tobias Iaconis",
      "url": "https://www.imdb.com/name/nm3037068/"
    }
  ]
}