{
  "type": "Movie",
  "name": "Monos",
  "url": "https://www.imdb.com/tt6062774/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYTA0ZDllNTYtY2ExYS00NGJlLWEzNGEtMjhkMzdhYjViMjZiXkEyXkFqcGdeQXVyODAzODU1NDQ@._V1_.jpg",
  "description": "On a remote mountaintop, eight kids with guns watch over a hostage and a conscripted milk cow.",
  "review": {
    "author": "trpuk1968",
    "dateCreated": "2020-04-28",
    "inLanguage": "English",
    "heading": "Why you should watch this film",
    "reviewBody": "Hallucinatory plunge into the depths of the human soul certainly won&apos;t be for everyone. However, if you have the nerves its a dark, unsettling exhilaratingly wild and ultimately rewarding ride.\n\nI agree with other reviewers about comparisons to Aguirre Wrath of God, Deliverance, Apocalypse Now, Southern Comfort as well as child soldier films such as Johnny Mad Dog or Come and See. However, Monos also bears comparison with two much older films. The first being Figures in a Landscape (Joseph Losey, 1970). This starred Robert Shaw and Malcolm McDowell as two men on the run in a bleak landscape, possibly Europe, possibly the Americas somewhere, evading soldiers, a menacing black helicopter and, on occasion, raiding villages for supplies. The second is 1985&apos;s The Emerald Forest, (John Boorman) set in the South American rain forest and exploring environmental themes through the story of a lost child. Both films address existentialist questions and lost children respectively, themes which abound in Monos, whose children are metaphorically if not at times literally also lost.\n\nMonos is the superior film to Figures by virtue of a firmer commitment to ambiguity. Neither film indicates where, or indeed when, it&apos;s taking place. Neither film gives back story to the characters. Whereas dialogue is sparing in Monos, in Figures there&apos;s speech throughout, with both men holding forth their philosophies on life and especially women. This jars somewhat with the otherwise Kafkaesque feel and results in a film which, rather than being one of the great classic cult movies of the seventies, such as Deliverance, is more of a curious period piece, it&apos;s excessive acting and attempts at profundity over reaching and rendering it somewhat dated.\n\nIt&apos;s too long since I saw The Emerald Forest to be able to properly compare it, suffice to say I&apos;ll shortly be returning to it, assuming I can get hold of it. At the time of writing Figures was uploaded on to youtube.\n\nThe lack of a clear narrative arc and the use of multiple protagonists means that MONOS will frustrate some viewers. The film expresses ideas and notions rather than &apos;working through&apos; a problem or presenting the viewer with a moral - the lack of any clear moral sense will further unsettle those who&apos;re accustomed to the conventions of narrative film.\n\nThe militia unit of eight teenagers is presumably modelled on cults / guerrilla organisations like Peru&apos;s Shining Path or Colombia&apos;s FARC. While ostensibly about child soldiers and the cynical way in which youthful idealism (and naivety) is taken advantage of and exploited by those older, ultimately MONOS is about the human condition and essentially the human animal alone in an indifferent universe. The title Monos can be read as an ironic comment - Spanish for &apos;monkey&apos; in that we humans are in fact nothing more than relatively sophisticated primates.\n\nSeveral themes are explored. How to live our lives, how to adjust to, negotiate the compromises the individual needs to make in order to secure the safety and advantages from the group. The consequences of the individual abnegating responsibility and prioritising transient pleasures over longer term prosperity.\n\nThe group of teenagers can be seen as a microcosm of the human race - given a cow to look after, their negligence leads to its death. The cow can be seen as allegorical of the earth which, like the cow in the film, provides for us. We&apos;re likewise custodians failing to care for, nurture and secure the earth for future generations.\n\nThere&apos;s little sense of the kids working together in a cohesive manner. Authority and order are remote, at the end of a radio. Those of a religious faith would acknowledge that any God, if we accept God&apos;s existence, has allowed humanity to get on with things by itself. My reading of the film is that we are indeed alone, in an indifferent universe, with only ourselves. God is as remote as whoever is at the end of the radio. If a saviour exists, it&apos;s in the form of Messenger (played by former FARC member Wilson Salazar), the commander who arrives intermittently. There&apos;s another analogy here with this character as a possible saviour figure and I won&apos;t reveal spoilers because my purpose is here to tell you Why You Should Watch This Film.\n\nCamera work and different locations are really effective in conveying meaning, moving from agoraphobia on the mountain top to claustrophobia in the jungle and river scenes. Close in camera work, honing in on the characters faces conveys their bewilderment and there&apos;s an incredible visceral quality. As Messenger pushes them through their paces, the sheer futility of human existence expressed as they run on the spot, going nowhere, their feet pounding in the mud or in the water. We are animals, monkeys, of the earth and no amount of thought, ideology will change that.\n\nThe cast of largely non professionals turn in totally convincing performances all the more real for being informed by lived experiences. Apparently the director of the film invited teenagers from all over Colombia and, having narrowed down the applicants, put them through an actual military style &apos;boot camp.&apos; The uncertainties and anxieties of adolescence are consistently conveyed by the young cast through facial expression, body language and movement. As is the impetuousness of that age, the compulsion and the craziness. Tension sustains, this is an edge of your seat film because we simply don&apos;t know where these kids are going or what they&apos;re planning, or going, to do.\n\nAnother way this movie triumphs is through use of sound and the incidental music, which reinforces the interior worlds of the characters. The score by composer Mica Levi is superb. I&apos;m not a fan of music in films, however in this case less in the form of beautiful yet unsettling electronica is most definitely more hence all the more effective. The sound scape in the jungle scenes is also masterful aural sculpture, building, sustaining a sense of quiet unease, claustrophobia and a feeling of dread through the sounds of the forest.\n\nBe warned. This certainly isn&apos;t for everyone. See it if...You like your action movies philosophical, leaving plenty of room for thought, speculation, interpretation. You can manage the dread, anxiety, apprehension you&apos;ll likely feel. A vertiginous plunge into the darkest recesses of the human condition. Just be sure to see it on the biggest screen with the loudest speakers that you can.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 18649,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "15",
  "genre": [
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "datePublished": "2019-10-25",
  "keywords": "metaphoric title,one word title,violence,gun,hostage",
  "duration": "PT1H42M",
  "actor": [
    {
      "name": "Sofia Buenaventura",
      "url": "https://www.imdb.com/name/nm9304766/"
    },
    {
      "name": "Julián Giraldo",
      "url": "https://www.imdb.com/name/nm11187715/"
    },
    {
      "name": "Karen Quintero",
      "url": "https://www.imdb.com/name/nm9304769/"
    }
  ],
  "director": [
    {
      "name": "Alejandro Landes",
      "url": "https://www.imdb.com/name/nm1622258/"
    }
  ],
  "creator": [
    {
      "name": "Alejandro Landes",
      "url": "https://www.imdb.com/name/nm1622258/"
    },
    {
      "name": "Alexis Dos Santos",
      "url": "https://www.imdb.com/name/nm2063526/"
    }
  ]
}