

{
  "type": "Movie",
  "name": "Daddy Day Care",
  "url": "https://www.imdb.com/tt0317303/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNTZiYjEzY2UtMzA2OC00NjM1LWFlMjItMzg4MTAwOTU2YzYxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "Two men named Charlie Hinton and Phil Ryerson get laid off and have to become stay-at-home fathers when they can't find jobs. This inspires them to open their own day care center.",
  "review": {
    "author": "stephen_thanabalan_fans",
    "dateCreated": "2005-09-03",
    "inLanguage": "English",
    "heading": "The Cast (even the kids) are tremendous fun!",
    "reviewBody": "Casting for this film was brilliant. In fact, it could not have been anything less, given that the final edited product - which boasts of great interplay and chemistry between the crew, cast and the kids- was a great family film (decent, entertaining, and heartfelt). What is particularly nifty is that in this film, like some others including Judge Reinhold's Vice Versa (1988), we get to see a children's movie for adults with both the kids and the adults sharing equal stage presence, which really is splendid. \n\nEddie Murphy (now into his family man image phase) and fellow co-stars like Steve Zahn (playing yet another geeky role with slick comic timing) really capture the screen with their ability to play such innocently playful and tender roles and when you watch them engage in conversations with the child actors (who must have been a handful to manage), one can tell instantly there was chemistry on and off screen there (even child actors are kids and kids know who to trust) that went on to boost the production set.\n\nThe credits even run a series of bloopers which showed the whole cast and crew crying out in laughter after the some of the cherubic kids deliver hilarious comments in between takes. The fun and interaction they must have all shared as a crew unit must have been dewy cheeked wonderful! This boost spills over into the film as one can definitely sense the fun filed atmosphere, and even if someone disagrees they'd definitely agree that there was loads of confetti colour and delightful rainbow filled moments throughout the film, which kind of also is a credit to the originality of this film's screenplay.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 73356,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "contentRating": "PG",
  "genre": [
    "Comedy",
    "Family"
  ],
  "datePublished": "2003-07-11",
  "keywords": [
    "reference to dr. benjamin spock",
    "reference to curious george",
    "children",
    "reference to the flash",
    "diaper change"
  ],
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "Eddie Murphy",
      "url": "https://www.imdb.com/name/nm0000552/"
    },
    {
      "name": "Jeff Garlin",
      "url": "https://www.imdb.com/name/nm0307531/"
    },
    {
      "name": "Anjelica Huston",
      "url": "https://www.imdb.com/name/nm0001378/"
    }
  ],
  "director": [
    {
      "name": "Steve Carr",
      "url": "https://www.imdb.com/name/nm0139867/"
    }
  ],
  "creator": [
    {
      "name": "Geoff Rodkey",
      "url": "https://www.imdb.com/name/nm0734900/"
    }
  ]
}