

{
  "type": "Movie",
  "name": "The Magdalene Sisters",
  "url": "https://www.imdb.com/tt0318411/",
  "poster": "https://m.media-amazon.com/images/M/MV5BODZmMzMzNWQtMGZiZS00ZDk0LWJhMTktNmNjZmE5MTJjYzMwXkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_.jpg",
  "description": "Three young Irish women struggle to maintain their spirits while they endure dehumanizing abuse as inmates of a Magdalene Sisters Asylum.",
  "genre": [
    "Drama"
  ],
  "datePublished": "2003-02-21",
  "duration": "PT1H54M",
  "contentRating": "15",
  "keywords": "female full frontal nudity,irish,ireland,unwed pregnancy,unwed mother",
  "rating": {
    "ratingCount": 28334,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "review": {
    "author": "john-3109",
    "dateCreated": "2006-03-04",
    "inLanguage": "English",
    "heading": "Dirty washing in public",
    "reviewBody": "Peter Mullan's (2002) film is based primarily upon the TV documentary 'Sex in a Cold Climate' by Steve Humphries which was first aired on RTE (Ireland) and BBC (England) in 1998. The documentary records the recollections of four Irish women who spent their youth and a good proportion of their adult lives as involuntary guests of uncompromising Roman Catholic nuns.\n\nThe film is set in a particular example of this institution which, somewhat akin to the English workhouses of the late 19th and early 20th century, became established in Ireland after the Second World War. The Magdelene Laundries took their name from the biblical figure of Mary Magdalene, a 'fallen woman' whom Christ befriended.\n\nWe join the main heroines of the movie - Margarette (Anne-Marie Duff), Bernadette (Norah-Jane No one), Rose (Dorothy Duffy) and Crispina (Eileen Walsh) in cameo as their entrance scholarships for the Magdelene Laundry are being sat.\n\nWhat's most uncomfortable about this part of the movie, is trying to work out what's going on. Trying to work out what it is that's being whispered and what will be the upshot of it, and why. At first, it seems like the soundtrack of the film and the contrast have failed. But before long, it becomes obvious that the soundtrack of the film and the contrast have succeeded. The dark and deafening silence surrounding the circumstances under which these young women are being consigned to the unwelcome stewardship of the Magdalene Sisters comes through loud and muted.\n\nWe follow their induction into the laundry by Sister Bridget (Geraldine McEwan), ably assisted by the Sisters Jude (Frances Healy), Clemantine (Eithne McGuinness) and Augusta (Phyllis MacMahon) who contrive with formally celibate gentlemen like Father Fitzroy (Daniel Costello) to represent a world in which God's greatest ideal is achieved through punishment and penitence.\n\nAs the film progresses, we begin to understand why it is no accident that these institutions should have been laundries. They could - after all - have been bakeries, dairies, canneries or places where mailbags are sewn.\n\nWith every garment that passes through the process, unmentionable filth is cleansed - if the Sisters are to be believed. And if the Sisters are to be believed, the sins of the teenagers and the route to Heaven is bound up in hot water, salt and flagellation.\n\nAnd as we follow these unsaintly girls on their hapless journey, we finally learn that salvation is as straightforward as a letter we are not privileged to read and a brother who arrives with a suitcase - as if there is anything that anybody could possibly want to carry away from a place like this.\n\nThis film is a powerful elegy to the suffering of these unfortunate girls who, constrained to silence for so long, have finally found a voice.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "actor": [
    {
      "name": "Eileen Walsh",
      "url": "https://www.imdb.com/name/nm0909626/"
    },
    {
      "name": "Dorothy Duffy",
      "url": "https://www.imdb.com/name/nm0240524/"
    },
    {
      "name": "Nora-Jane Noone",
      "url": "https://www.imdb.com/name/nm1172901/"
    }
  ],
  "director": [
    {
      "name": "Peter Mullan",
      "url": "https://www.imdb.com/name/nm0611932/"
    }
  ],
  "creator": [
    {
      "name": "Peter Mullan",
      "url": "https://www.imdb.com/name/nm0611932/"
    }
  ]
}