

{
  "type": "Movie",
  "name": "Thirteen",
  "url": "https://www.imdb.com/tt0328538/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOGZmZjNjYWUtYTI4ZS00NmVjLThkMjAtY2EyMWU5ZTcyZDZhXkEyXkFqcGdeQXVyMTUzMDUzNTI3._V1_.jpg",
  "description": null,
  "review": {
    "author": "bob the moo",
    "dateCreated": "2004-09-29",
    "inLanguage": "English",
    "heading": "Occasionally goes to extremes but is very convincing with great characters in the hands of three actresses all giving great performances",
    "reviewBody": "Tracy is a normal thirteen-year-old girl, dressed in bright pastels, bedroom full of soft toys and with giggly thoughts of boys. Starting school in the new term she finds everyone in awe of Evie Zamora and her friends \\u0096 all of who have suddenly turned into sexy young ladies over the summer. With her goofy kid look, Evie blanks Tracy until she impresses her by stealing a purse to go shopping. As Evie gets in with Tracy&apos;s mum Mel, she also takes Evie into her own world of rebellion involving stealing, drink, disobedience, drugs and sex. Mel struggles to hold on to the small parts of her daughter that she still recognises.\\n\\nAt many points in our lives we all change and perhaps the first time it happens is the hardest to deal with. The stage where everyone seems to go from just being kids to suddenly being a peer group is a major one and this film, for all its extremes, does justice to the difficulties (for everyone) of the period in a story that is well written, cleverly directed and really well acted by the whole cast. The plot builds well on minor changes to Tracy and makes it totally clear where the pressure is coming from and how it affects her; in this regard the script is spot on and is totally convincing. When it goes to extremes it does show signs of stretching and almost breaking but it never does \\u0096 while it is extreme it is still convincing and only two or three moments seem like they are going too far. Certainly I can&apos;t imagine many parents will be able to watch it without worrying about how they and theirs will handle the change when it comes.\\n\\nWhile the writing is great, there does come a point where it needs to end and, while unconvincing, the film does at least draw to an end on an ambiguous ending and only the final shot of a &apos;isn&apos;t life hard&apos; scream from Tracy struck a duff note and was too clumsy. As co-writer, Reed shows a real awareness of the world around her and she deserves the praise she got for that role but also her performance as Evie is praise worthy, but perhaps not to the extent that Wood&apos;s is. Wood takes us from a child to womanhood and never hits a duff note in her portrayal of a girl just trying to fit in.\\n\\nShe is excellent and her dynamic with Hunter is a perfect fit and also convincing; in my mind she is better than Reed because Wood had a more complex character to develop \\u0096 Wood had to change her character, Reed played a character who was already there. Hunter deals with some minor clutter in her character but generally she is as good as her teenage cos-stars. Minor support roles for people like Sisto, Unger and Clarke all add to the film but really the film belongs to the lead trio. Director Hardwicke directs with style and with an eye for the clever shot \\u0096 at times using fast camera motions while in one key scene just letting the camera frame the front room like it was a stage. She also uses a clever touch in tainting the film stock a washed out colour when Tracy&apos;s bubble finally bursts \\u0096 we immediately go from bright colours to washed out blue and, even with the conclusion we only return to dark browns and not the highs of the main story.\\n\\nOverall this is a very good film that is hard to watch if you have pre-teen kids. It has extremes in there and it won&apos;t apply to every teenager out there but to just call it unrealistic is to ignore the reality of peer pressure and the sexualisation of youth generally. The script is convincing, frightening and moving and is greatly helped by three great performances from Reed, Wood and Hunter.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 96861,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "contentRating": "18",
  "genre": [
    "Drama"
  ],
  "datePublished": "2003-12-05",
  "keywords": "female frontal nudity,female nudity,oral sex,borderline personality disorder,coming of age",
  "duration": "PT1H40M",
  "actor": [
    {
      "name": "Evan Rachel Wood",
      "url": "https://www.imdb.com/name/nm0939697/"
    },
    {
      "name": "Holly Hunter",
      "url": "https://www.imdb.com/name/nm0000456/"
    },
    {
      "name": "Nikki Reed",
      "url": "https://www.imdb.com/name/nm1223023/"
    }
  ],
  "director": [
    {
      "name": "Catherine Hardwicke",
      "url": "https://www.imdb.com/name/nm0362566/"
    }
  ],
  "creator": [
    {
      "name": "Catherine Hardwicke",
      "url": "https://www.imdb.com/name/nm0362566/"
    },
    {
      "name": "Nikki Reed",
      "url": "https://www.imdb.com/name/nm1223023/"
    }
  ]
}