{
  "type": "Movie",
  "name": "Clifford the Big Red Dog",
  "url": "https://www.imdb.com/tt2397461/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZGIxYTU5MzctY2MzNS00MTRhLWEwM2UtY2Q5Mzk3OTAzMzcwXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg",
  "description": "A young girl&apos;s love for a tiny puppy named Clifford makes the dog grow to an enormous size.",
  "review": {
    "author": "statuskuo",
    "dateCreated": "2021-11-10",
    "inLanguage": "English",
    "heading": "Hey Girrrrrrl",
    "reviewBody": "Clifford The Big Red Dog is indicative of the Boomer generation creation that becomes iconic, in terms of its simplicity. He is big...he is red and he is a dog, no doubt. The 60&apos;s, where the books come from, have this sensibility. Making the most basic things blow up in popularity.\n\nThough the movie takes place in present day New York City, this movie definitely belongs in a different generation. One that requires that a man who lives in his cube truck be gleefully unapologetic about his lot in life, or that a paralegal and her daughter can afford to live in a large Harlem apartment. Or that everyone in the neighborhood are mystically whimsical and light, then this movie is for you. It may as well be a musical.\n\nThe story is of a girl for which magic works, and if your brain doesn&apos;t accept this, then this film is not for you.\n\nI happen to miss this level of innocence. It lacks the cynicism to which politics have ruined everything. It just wants you to like it. Much like Clifford. He is sweet, wide-eyed and has no clue why he is seen as abnormal. Isn&apos;t that what we all want?\n\nSpecial kudos to John Cleese speaking lines that would die in any other actor&apos;s mouth.\n\nEveryone in this flick just seems so happy to do something this light.\n\nI genuinely enjoyed this movie and found myself smiling. And that is all that is required.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 16666,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "PG",
  "genre": [
    "Adventure",
    "Comedy",
    "Family"
  ],
  "datePublished": "2021-12-10",
  "keywords": "kaiju,live action cgi hybrid,red dog,little girl,puppy",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Darby Camp",
      "url": "https://www.imdb.com/name/nm6081322/"
    },
    {
      "name": "Jack Whitehall",
      "url": "https://www.imdb.com/name/nm3099754/"
    },
    {
      "name": "Izaac Wang",
      "url": "https://www.imdb.com/name/nm9865565/"
    }
  ],
  "director": [
    {
      "name": "Walt Becker",
      "url": "https://www.imdb.com/name/nm0065608/"
    }
  ],
  "creator": [
    {
      "name": "Jay Scherick",
      "url": "https://www.imdb.com/name/nm0771065/"
    },
    {
      "name": "David Ronn",
      "url": "https://www.imdb.com/name/nm0740115/"
    },
    {
      "name": "Blaise Hemingway",
      "url": "https://www.imdb.com/name/nm1271984/"
    }
  ]
}