{
  "type": "Movie",
  "name": "Introducing, Selma Blair",
  "url": "https://www.imdb.com/tt14030526/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZDdlM2MzNDAtODliMi00NjFkLWI0NzUtOWU3ZjNjZGRiYmM3XkEyXkFqcGdeQXVyMTAyMjQ3NzQ1._V1_.jpg",
  "description": "A deeply intimate and raw portrait of Selma Blair after she is diagnosed with Multiple Sclerosis and tries to slow the progression of her disease.",
  "review": {
    "author": "avenuesf",
    "dateCreated": "2021-10-24",
    "inLanguage": "English",
    "heading": "Beautiful, painful film",
    "reviewBody": "As another reviewer here states, I also found this very powerful documentary to be heartbreaking and incredibly moving. I knew Ms. Blair had been diagnosed with MS in 2018 but was unaware she had gone through the process of undergoing a stem cell transplant, and the film chronicles a lot of what that hellish experience is like. Throughout the documentary she very bravely shows us both the physical as well as the mental pain she experiences coping with her illness, and although her courage is certainly commendable, sometimes it&apos;s difficult to watch.\n\nWhat I found most heart-wrenching was Ms. Blair&apos;s continual search throughout the film&apos;s running time to try to find love from her memories of a mother who apparently wasn&apos;t a very loving one; at first I found her sarcastic, self-deprecating sense of humor endearing, but it became more and more painful to watch as the film progressed and I gained a better understanding of what her childhood may have been like. Strangely, the film keeps her mother at a distance, mostly just showing us photographs and brief recollections from Ms. Blair. At one point during the documentary there&apos;s a very brief phone conversation shown between the two, and her mother doesn&apos;t seem to be completely coherent. No further explanation of it is given, and I wish the filmmaker had given us a more detailed picture of what the woman had been like. She&apos;s depiected as quite narcissistic. What is made very clear and is equally poignant is that the love Ms. Blair often implies she didn&apos;t receive as a child she gives whole-heartedly to her young son. She&apos;s an amazing mother who shows him nothing but completely accepting, unconditional love.\n\nThis is a documentary that shows us how life often doesn&apos;t make any sense and how cruel it can be sometimes. Ms. Blair is a courageous, very admirable woman and I wish her the very best in her continued recovery. Maybe someday we&apos;ll even see her in a role again, something I very much look forward to.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 970,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.8
  },
  "contentRating": null,
  "genre": [
    "Documentary"
  ],
  "datePublished": "2021-10-21",
  "keywords": null,
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Selma Blair",
      "url": "https://www.imdb.com/name/nm0004757/"
    }
  ],
  "director": [
    {
      "name": "Rachel Fleit",
      "url": "https://www.imdb.com/name/nm8405072/"
    }
  ],
  "creator": []
}