{
  "type": "Movie",
  "name": "Oxygène",
  "url": "https://www.imdb.com/tt6341832/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMWQ3N2EzNjYtMzgwYS00YjdmLThmOTUtMzc4NDUxZjZkY2RhXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
  "description": "A woman wakes in a cryogenic chamber with no recollection of how she got there. As she&apos;s running out of oxygen, she must rebuild her memory to find a way out of her nightmare.",
  "review": {
    "author": "eddie_baggins",
    "dateCreated": "2021-06-11",
    "inLanguage": "English",
    "heading": "An above average Netflix offering",
    "reviewBody": "Making a name for himself in the horror field with the likes of High Tension, The Hills Have Eyes, Piranha 3D and Crawl, French director Alexandre Aja takes a different route with his newest outing Oxygen, with this Netflix acquired claustrophobic thriller a more dialed back affair for the boundary pushing director who even showcases a much softer side to himself than his shown previously.\n\nTaking the Buried/Devil approach to proceedings as we spend Oxygen&apos;s 100 minute runtime confined to a life supporting medical pod with Melanie Laurent&apos;s Liz, who has awoken with no memories of who she is or how she came to be stuck in the pod with a quickly dwindling supply of air, Aja&apos;s well-filmed ride may not always be the pulse-pounding thriller it wants to be but thanks to some inventive directing and a committed leading lady, this sweat inducing ride will keep you engaged throughout.\n\nStarting off relatively slowly, with us and Liz trying to figure things out and wondering why we should care for her plight to survive with nothing more than an A. I computer known as MILO to help her, Oxygen does start to ramp things up around the half way mark with more knowledge about what is going on and how Liz came to be found in such a predicament helping the film out in a big way as we all of a sudden start to ride every bump and fall with Liz as her oxygen dwindles and her quest to survive feels more pressing with every passing second.\n\nWith strong visuals (and a scene that will go down as one of the years best as we catch a glimpse of Liz&apos;s external surrounds), a great score by Robin Coudert and some neat little horror throwbacks from its director, Oxygen feels like a polished and professional offering and a level above other similar Netflix released offerings, ensuring that its high concept idea is bought to life in a strong and satisfying way.\n\nIt&apos;s not too say the film is able to reach the highs of some of its other similar counterparts, there are numerous moments where the film feels bogged down by repetitive situations and stretches of unengaging scenarios but despite not being able to reach grand heights, Oxygen is a thriller worth checking out and a nice example of Alexandre Aja trying his hand at something a little different from his usual staple.\n\nFinal Say -\n\nRamping up in its latter stages and featuring a great central turn from its leading lady, Oxygen is a solid thriller that might not grip you through its entirety but has enough solid moments to make it worth your time.\n\n3 lab rats out of 5.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 43459,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.5
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Fantasy",
    "Sci-Fi"
  ],
  "datePublished": "2021-05-12",
  "keywords": "female protagonist,escape,jump scare,clone,hallucination",
  "duration": "PT1H40M",
  "actor": [
    {
      "name": "Mélanie Laurent",
      "url": "https://www.imdb.com/name/nm0491259/"
    },
    {
      "name": "Mathieu Amalric",
      "url": "https://www.imdb.com/name/nm0023832/"
    },
    {
      "name": "Malik Zidi",
      "url": "https://www.imdb.com/name/nm0956026/"
    }
  ],
  "director": [
    {
      "name": "Alexandre Aja",
      "url": "https://www.imdb.com/name/nm0014960/"
    }
  ],
  "creator": [
    {
      "name": "Christie LeBlanc",
      "url": "https://www.imdb.com/name/nm7959699/"
    }
  ]
}