

{
  "type": "Movie",
  "name": "Wo hu cang long: Qing ming bao jian",
  "url": "https://www.imdb.com/tt2652118/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTA2MzM5NTk4NTBeQTJeQWpwZ15BbWU4MDk0NjgyNDcx._V1_.jpg",
  "description": "A story of lost love, young love, a legendary sword and one last opportunity at redemption.",
  "review": {
    "author": "R-Clercx",
    "dateCreated": "2016-03-16",
    "inLanguage": "English",
    "heading": "A very flawed attempt to Americanize a Chinese art-house classic",
    "reviewBody": "Obviously their was a decent production budget and energy spend on this martial arts movie set in ancient China. Much effort went into (re)creating sets, costumes and choreography. That&apos;s the good part...\\n\\nHowever, it&apos;s out of place to go through all the effort to evoke a historical time period, only to let all Chinese characters speak English (in a time period where only very few Chinese intellectuals would be able to speak any other other language than Chinese). Either the producers didn&apos;t have faith in a movie audience to read subtitles or to accept a movie with any other spoken language than English. The original movie did manage to do that however: to appeal as well to a mainstream audience AND lovers of exotic foreign language martial arts movies.\\n\\nSword of Destiny doesn&apos;t do anything which hasn&apos;t been done much better before. Martial Arts in itself as a genre, having being so popular mainly in the 70s and 80s has explored about any camera angle, fast montage and special effect. Tarantino already directed the ultimate homage in Kill Bill.\\n\\nSword of Destiny, although with some credits to the production in itself never amazes, unless you&apos;ve never seen a martial arts movie before. Like in the previous Crouching Tiger, Hidden Dragon there is a lot of cable work and floating going on. As if fast paced and shot martial arts scenes weren&apos;t enough, in this series the fighting characters are elevated to near super heroes, resulting in choreography and fighting scenes which aren&apos;t credible anymore.\\n\\nThis is exactly where for instance Bruce Lee-flicks were far superior: as a viewer you saw incredible sequences but yet they remained credible. In Sword of Destiny the character has seized to be human and becomes a fantasy.\\n\\nSword of Destiny finally ends up being neither: too slick to be accepted by a die hard audience of authentic martial arts movies, too Americanized to appeal to lovers of historical art house costume movies. \\n\\nGoing through all the effort to evoke an ancient Chinese period and let all Chinese characters speak English is simply foolish. \\n\\nSword of Destiny is exactly where American mainstream cinema has gone wrong: in a cash-in attempt to &apos;Americanize&apos; classics in other countries, they end up with would-be blockbusters without soul or authenticity what so ever. You watch it, you forget it: it&apos;s not good, not super bad either, it ends up being a movie you hardly remember the next day, unlike the original.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 20793,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "12",
  "genre": [
    "Action",
    "Adventure",
    "Drama"
  ],
  "datePublished": "2016-02-26",
  "keywords": "3 dimensional,ancient china,sequel,second part,part of duology",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Donnie Yen",
      "url": "https://www.imdb.com/name/nm0947447/"
    },
    {
      "name": "Michelle Yeoh",
      "url": "https://www.imdb.com/name/nm0000706/"
    },
    {
      "name": "Harry Shum Jr.",
      "url": "https://www.imdb.com/name/nm1484270/"
    }
  ],
  "director": [
    {
      "name": "Woo-Ping Yuen",
      "url": "https://www.imdb.com/name/nm0950759/"
    }
  ],
  "creator": [
    {
      "name": "John Fusco",
      "url": "https://www.imdb.com/name/nm0299301/"
    },
    {
      "name": "Du Lu Wang",
      "url": "https://www.imdb.com/name/nm0238893/"
    },
    {
      "name": "Bey Logan",
      "url": "https://www.imdb.com/name/nm0004214/"
    }
  ]
}