

{
  "type": "Movie",
  "name": "God's Not Dead 2",
  "url": "https://www.imdb.com/tt4824308/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjIxNTExMDk4NF5BMl5BanBnXkFtZTgwODM0MDczNzE@._V1_.jpg",
  "description": "When a high school teacher is asked a question in class about Jesus, her response lands her in deep trouble.",
  "review": {
    "author": "bkoganbing",
    "dateCreated": "2016-04-01",
    "inLanguage": "English",
    "heading": "A truly simplistic world",
    "reviewBody": "The life of the Creator/Deity of the infinite universe of time, space, and matter gets a second go round in God's Not Dead 2. In this film, Advanced Placement History teacher Melissa Joan Hart is suspended when she quotes from the Gospel of Matthew in answer to a student's question concerning Jesus, Gandhi, and Martin Luther King. Somebody tapes the lesson and Hart's hauled up before the school board and then put on trial. For what I'm still not sure as this is not a criminal matter. Now what John Thomas Scopes was put on trial for teaching evolution back in the 20s, that was a criminal matter. All that should be happening here is a legal appeal of an administrative ruling and certainly that is civil.\\n\\nI remember many years ago in New York City in the Bronx I believe there was a teacher fired for bringing up Jesus as her evangelical faith tells her she has to. She was told that she could not be talking about religion. With all seriousness and ingenuousness she replied she wasn't talking about religion to her students, she was talking about Jesus. That got her deservedly canned. Poor woman had not a clue.\\n\\nThe school board retains the biggest villain in the evangelical modern world, the American Civil Liberties Union. Ray Wise is a properly smarmy lawyer whom if he wore a handlebar mustache would be twirling it. Hart's lawyer is Jesse Metcalfe late of the revived TV Dallas and he's the hero of the piece saving Hart's job and right to her beliefs.\\n\\nI brought up the Scopes Trial and those of us who've seen any version of Inherit The Wind remember that the judge ruled out scientific expert testimony about evolution. That's not what happens here as Jesse Metcalfe is allowed to bring in religious 'expert' testimony from some real folk playing themselves. I guess different rules apply in Judge Ernie Hudson's court. Mike Huckabee is playing himself as Fox New commentator and he's probably cursing the fact that God's Not Dead 2 was released after he called a halt to his presidential campaign.\\n\\nThe original God's Not Dead was a Christian propaganda piece, but in terms of the film the story was interestingly presented. This one played like a long episode story from the 700 Club. I'm sure it will play heavily on the Christian film circuit and will be rented a lot by youth pastors all over the Bible Belt once it goes to DVD.\\n\\nIt's a truly simplistic world these folks live in. They're right, the Bible is the word of God not to be questioned or given alternative interpretation. And those who don't believe are either sinners beyond redemption or a fertile evangelical field to be plowed.\\n\\nSeeing the united front the kids give Melissa Joan Hart in support you know this is a Bible Belt community she's from. I wonder if there are any kids openly saying that she was wrong. God help them, the gay kids must be very deep in the closet there.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 2
    }
  },
  "rating": {
    "ratingCount": 13357,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.3
  },
  "contentRating": "PG",
  "genre": [
    "Drama",
    "Fantasy"
  ],
  "datePublished": "2016-04-29",
  "keywords": "manipulation,repeat sequel,alternate universe,christian film,bible",
  "duration": "PT2H",
  "actor": [
    {
      "name": "Melissa Joan Hart",
      "url": "https://www.imdb.com/name/nm0004997/"
    },
    {
      "name": "Jesse Metcalfe",
      "url": "https://www.imdb.com/name/nm0582462/"
    },
    {
      "name": "David A.R. White",
      "url": "https://www.imdb.com/name/nm0924684/"
    }
  ],
  "director": [
    {
      "name": "Harold Cronk",
      "url": "https://www.imdb.com/name/nm1880561/"
    }
  ],
  "creator": [
    {
      "name": "Chuck Konzelman",
      "url": "https://www.imdb.com/name/nm0465484/"
    },
    {
      "name": "Cary Solomon",
      "url": "https://www.imdb.com/name/nm0813301/"
    }
  ]
}