

{
  "type": "Movie",
  "name": "Hillsong: Let Hope Rise",
  "url": "https://www.imdb.com/tt3850544/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTY2ODgwMDY4N15BMl5BanBnXkFtZTgwMzgwMzc0OTE@._V1_.jpg",
  "description": "A documentary on the Australia-based band Hillsong and their rise to prominence as an international church.",
  "genre": [
    "Documentary",
    "Family",
    "Music"
  ],
  "datePublished": "2016-09-16",
  "duration": "PT1H43M",
  "contentRating": "PG",
  "rating": {
    "ratingCount": 900,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "review": {
    "author": "ray-331-768935",
    "dateCreated": "2016-11-09",
    "inLanguage": "English",
    "heading": "Just a theatrical church using theaters to promote themselves ... sic",
    "reviewBody": "If your into layers of self patrony then start here. This film seeks to promote the evangelical church movement to the vulnerable and followers of Brian Houston. Its a mess of self indulgent close ups, but as far as using theater and production to symbolize god. This movie seeks to add to the brainwashing effect that those fanatics in the euphoric movement, those self absorbed in colour and light and sound fail to see as literally the worship of HILLSONG itself. As such it would be blasphemous and idolatry in its continual use of light to imply the actual, literal presence of god, no, it was light, it was angelic singing, and slick production. Even this movie, with its million dollar budget is just a mass of mind manipulation through sound and light. Don't be fooled, it was a bore, has no place in cinema, is hypocritic, and expect the person who is into this movie to jump up and say hallelujah while they periscope.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 1
    }
  },
  "keywords": "band,christian,faith,song,family secret",
  "actor": [
    {
      "name": "Michael Guy Chislett",
      "url": "https://www.imdb.com/name/nm3715614/"
    },
    {
      "name": "Matt Crocker",
      "url": "https://www.imdb.com/name/nm8434613/"
    },
    {
      "name": "Adam Crosariol",
      "url": "https://www.imdb.com/name/nm8434618/"
    }
  ],
  "director": [
    {
      "name": "Michael John Warren",
      "url": "https://www.imdb.com/name/nm1434034/"
    }
  ],
  "creator": []
}