

{
  "type": "Movie",
  "name": "Rules Don't Apply",
  "url": "https://www.imdb.com/tt1974420/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc0MTk4MTI1M15BMl5BanBnXkFtZTgwOTIxMDQ0MDI@._V1_.jpg",
  "description": "The unconventional love story of an aspiring actress, her ambitious driver, and their eccentric boss, the legendary billionaire Howard Hughes.",
  "review": {
    "author": "Michael_Elliott",
    "dateCreated": "2016-12-01",
    "inLanguage": "English",
    "heading": "Uneven to Say the Least but It Was Entertaining",
    "reviewBody": "Rules Don't Apply (2016)\n\n*** (out of 4) \n\nMarla Mabrey (Lily Collins) arrives in Hollywood as a contract player for the one and only Howard Hughes (Warren Beatty) but before long she realizes all the weird stories she's heard about him are true. She strikes up a friendship with her driver Alden (Frank Forbes), although they can't take it any further due to Hughes' rules about his workers dating his future stars. Before long the two young people grow closer to each other as well as Hughes.\n\nIsn't it shocking that it's been nearly twenty-years since Beatty wrote and directed a movie? It's even more shocking that it's been fifteen-years since he acted in one. There have been rumors of Beatty doing a Howard Hughes bio-pic for decades and it was rather shocking when news broke that he was finally making it. In another shocking turn, what people got certainly wasn't what they expected. I saw the movie six days after its release and it's already bombed with critics and at the box office. Sadly the picture just wasn't what people expected or wanted and who knows if this is the last time we see the legend on the big screen.\n\nI must admit that it's rather shocking to see Beatty basically making an old-fashioned romantic comedy. I mean, he could have done that but why waste his Hughes bio on that type of movie? I want to say that I did enjoy the movie and I found it to be quite charming but at the same time you just have to wonder what was going on with this thing. The picture is certainly uneven to say the least. The first hour is basically the romantic side of the two young characters with Hughes basically a supporting player. The second half of the picture kicks up the drama and darker elements as the romantic couple take a back seat and Hughes gets the attention. I'm really not sure why they done the story this way but it seems like one or the other would have made for something better. Did I mention the strange sex/religion stuff going on? \n\nAs I said, once you get over the fact that this isn't the type of movie you're expecting, once you set back into your seat, what we get here is pretty good. I thought the romance actually worked in an old-fashioned type of way and there were certainly some great performances here. Both Collins and Forbes are terrific together. Both of them nail their characters and they also share a terrific chemistry with each other. Collins is really the stand out as she perfectly captures the innocence of her character. Beatty is also terrific in his supporting role. The first portion of the film has him doing a lot of great comic timing but Beatty gets to show his dramatic side in the second half with the character's troubles come into play. It really makes you wonder what he could have done in a straight bio. The supporting players feature some very well-known actors and all of them do a fine job.\n\nRULES DON'T APPLY has some great cinematography, nice music selection and for the most part it's just a charming and fun film. Until the drama starts and then the drama works just fine as well. I just don't think the two mixed all that well and that's why the film seems uneven. Sadly, RULES DON'T APPLY will probably become known as being a major flop, which is too bad because there's a good movie here. Most people probably won't see that because we expected more from Beatty.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 11608,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "12A",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2017-04-21",
  "keywords": "chauffeur,1960s,actress,driver,billionaire",
  "duration": "PT2H7M",
  "actor": [
    {
      "name": "Lily Collins",
      "url": "https://www.imdb.com/name/nm2934314/"
    },
    {
      "name": "Haley Bennett",
      "url": "https://www.imdb.com/name/nm2247245/"
    },
    {
      "name": "Taissa Farmiga",
      "url": "https://www.imdb.com/name/nm3920288/"
    }
  ],
  "director": [
    {
      "name": "Warren Beatty",
      "url": "https://www.imdb.com/name/nm0000886/"
    }
  ],
  "creator": [
    {
      "name": "Warren Beatty",
      "url": "https://www.imdb.com/name/nm0000886/"
    },
    {
      "name": "Bo Goldman",
      "url": "https://www.imdb.com/name/nm0325743/"
    }
  ]
}