{
  "type": "Movie",
  "name": "Synchronicity",
  "url": "https://www.imdb.com/tt2049543/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc2NDAyOTc4MV5BMl5BanBnXkFtZTgwNjE4Mjk0NzE@._V1_.jpg",
  "description": "A physicist who invents a time machine must travel back to the past to uncover the truth about his creation and the woman who is trying to steal it.",
  "review": {
    "author": "m_lecarre",
    "dateCreated": "2016-01-25",
    "inLanguage": "English",
    "heading": "Well Worth Watching",
    "reviewBody": "I&apos;ve read the negative and &apos;so-so&apos; reviews here on this movie and wonder if we watched the same movie. References to Blade Runner, capturing 80&apos;s style production etcetera - sorry but I don&apos;t agree. I Hailed Blade Runner as the best futuristically dystopian Sci-Fi movie as the best I&apos;d ever seen way back when it first came out, I have every version of it and still watch them on a regular basis - it never fails to satisfy and leave me with a feeling of calm satisfaction. Just about every movie that&apos;s ever been made just like every story that&apos;s ever been written owes something to those that came before it: as they say there is nothing new under the sun. Now back to Synchronicity 2015. It is a stand alone movie with (all IMHO) a solid well-written script, a sound and interesting premise, more than acceptably good special effects (which it didn&apos;t need to rely upon to tell its story), very well cast and well acted and although not a &apos;drivingly wild video game movie&apos; (yuk) it never lags in pace or fails to hold the viewers interest and curiosity. Nothing is certain ... is it past or parallel, real or imagined, it leaves a lot for the viewer to decide which is, I surmise, why the movie gets such a mixed reception. Not a typical Hollywood style wrap it all up neatly in buttered popcorn it needs your attention and perhaps more than a single viewing to appreciate the content. The sexuality/physical attraction that has been called a love story is neither pointless nor gratuitous but serves a well-defined emotional purpose given the context of events and the nature of the relationship which intertwines the raison d&apos;être of the two characters involved with the development of the premise upon which the film proceeds. If you want or are looking for a movie that is blunt force trauma to the senses then this won&apos;t be for you. If, however, you appreciate subtlety of expression, timing and story development then give this movie a watch. I enjoyed it and will watch it several more times to allow the subtleties previously unseen to fully develop. 7 out of 10 at least on my scale for a movie that not only entertains, but holds ones attention for the duration of the movie and has characters that are believable and very human.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 11284,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.4
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Mystery",
    "Romance"
  ],
  "datePublished": "2016-01-22",
  "keywords": "fainting man,woman flashes her leg,woman wears a see through blouse,woman wears black lingerie,woman",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "Chad McKnight",
      "url": "https://www.imdb.com/name/nm0572030/"
    },
    {
      "name": "Brianne Davis",
      "url": "https://www.imdb.com/name/nm1732403/"
    },
    {
      "name": "AJ Bowen",
      "url": "https://www.imdb.com/name/nm1410105/"
    }
  ],
  "director": [
    {
      "name": "Jacob Gentry",
      "url": "https://www.imdb.com/name/nm1402180/"
    }
  ],
  "creator": [
    {
      "name": "Jacob Gentry",
      "url": "https://www.imdb.com/name/nm1402180/"
    },
    {
      "name": "Alex Orr",
      "url": "https://www.imdb.com/name/nm1373794/"
    }
  ]
}