{
  "type": "Movie",
  "name": "Teenage Mutant Ninja Turtles: Out of the Shadows",
  "url": "https://www.imdb.com/tt3949660/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMmVkNjVjZTQtNTczYS00ODk5LWFkNjItYjNlMDc5ZjMyYTQwXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
  "description": "The Turtles get into another battle with their enemy the Shredder, who has acquired new allies: the mutant thugs Bebop and Rocksteady and the alien being Krang.",
  "review": {
    "author": "slicedbread117",
    "dateCreated": "2016-06-04",
    "inLanguage": "English",
    "heading": "A Franchise Halfway Out of its Shell",
    "reviewBody": "2014&apos;s Teenage Mutant Ninja Turtles gave us a new look and feel for the beloved franchise, and it disappointed greatly. Now two years later, a second chance to win over the hearts of die hard Turtle fans has arrived in the form of Out of the Shadows, a sequel while better than the first, still falls short of becoming a special TMNT film.\n\nWhile the Turtles were far and away the highlight of the first film, their grittier design and lack of proper development was no doubt a downside. Now, I must admit, where in the first film I honestly could not stand the look and feel of the Turtles, I have begun to come around to, not necessarily enjoying, but tolerating their massive Hulk-like looks, and this is because Leo, Raph, Donny and Mikey are all super fun to watch, with more chemistry developed throughout the cast members and a much more classic Ninja Turtle vibe to the Turtles in this film. Eating pizza, cracking jokes, awesome ninja action and just generally acting like teenagers are all major points in the development of these characters, and with Out of the Shadows, there is some more of that old school TMNT feel between the four brothers. Even if there is an alarming lack of literal action scenes involving our favorite mutants, the Turtles are once again the best part of the movie, as they should be.\n\nThere are more positives to be excited about, including the additions of villains Bebop and Rocksteady and occasionally, the Turtle&apos;s sidekick Casey Jones. Bebop and Rocksteady are fun villains, humorous, energetic and bring more setting-appropriate antagonists into the fold. I had mixed feelings throughout the film about Stephen Amell&apos;s portrayal of Casey Jones. He was funny, bad ass, and even if it was brief, sported his iconic hockey mask and stick, much to my delight. However, Amell occasionally is too bland and lacks that cocky personality you&apos;d expect from the character, and never develops a meaningful connection to the Turtles, something that the classic 1990 film was able to do extremely well in comparison. \n\nThe movie&apos;s plot is much goofier than the first film, which holds many positives, but also brings unwanted ridiculousness. TMNT is supposed to be silly and wacky, a point I complained about in the first movie, and to that aspect, Out of the Shadows does succeed. Anyone expecting an Oscar winning story from TMNT would be kidding themselves, and the more lighthearted story is welcomed to this franchise which often suffers from being far too serious. On the other hand, the dimension- crossing, world ending concept that the film presents is just too much to handle in a movie about turtles that are ninjas, it just doesn&apos;t seem to fit. For once in the duration of this franchise, I would love to watch the Turtles fight some crime on the streets, a simpler tale that doesn&apos;t have to include the end of days. \n\nWhat I will never be able to wrap my head around is what goes through the mind of Michael Bay whether he&apos;s in the director&apos;s chair or producing, but his presence is once again felt greatly in this film, and that is easily its greatest downfall. The pace of the film feels like it&apos;s on speed, giving no time to care about or really dive into what&apos;s happening on screen, and the major use of Bay&apos;s trademark slow motion and explosions don&apos;t fit whatsoever in this film. Heck, the logo at the end even assembles exactly like the logo for Bay&apos;s Transformers franchise. Director Dave Green is able to make small changes to improve the quirky tone of the film, but Bay is felt right from the start and it doesn&apos;t do the film any good.\n\nThe cast is decent for the most part, led by Noel Fisher, Jeremy Howard, Pete Ploszek, and Alan Ritchson as Mikey, Donny, Leo and Raph respectfully, with Fisher stealing pretty much every scene he&apos;s in as Mikey. Bepop and Rocksteady are in good hands with Gary Anthony Williams and Stephen Farrelly and even the overlord Krang is done quite well by 3-time Emmy winner Brad Garrett. Tyler Perry is surprisingly great as mad scientist Baxter Stockman, charming to watch in his science quests and his hilarious evil laugh. \n\nOn the other side of the coin, we have some poorly cast actors and poorly written characters. Megan Fox, thankfully, is in less of the film this time around, but when she is, she&apos;s the worst April O&apos;Niel we could have possibly gotten. Her character is horribly developed, and her portrayal is even worse. Will Arnett isn&apos;t much better as Vern, he&apos;s largely unfunny and put in action scenes with Fox that should&apos;ve been used on the Turtles and Casey Jones. It&apos;s terribly unfortunate that TMNT mainstays like the big bad Shredder and the Turtle&apos;s master Splinter are extremely underused as well.\n\nTo say that Out of the Shadows was a total flop wouldn&apos;t be fair. Even if by a small margin, Out of the Shadows is an improvement over the first film. There are still some major fixes I wish could be made to help improve this franchise which got off to a very rocky start two years ago and is crawling its way to improvement. I can only hope that the inevitable third installment propels the series upwards into a love I and so many others have for the Teenage Mutant Ninja Turtles name.\n\n6.5/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 99209,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2016-05-30",
  "keywords": "sequel,turtle,based on cartoon,rat,brother brother relationship",
  "duration": "PT1H52M",
  "actor": [
    {
      "name": "Megan Fox",
      "url": "https://www.imdb.com/name/nm1083271/"
    },
    {
      "name": "Will Arnett",
      "url": "https://www.imdb.com/name/nm0004715/"
    },
    {
      "name": "Tyler Perry",
      "url": "https://www.imdb.com/name/nm1347153/"
    }
  ],
  "director": [
    {
      "name": "Dave Green",
      "url": "https://www.imdb.com/name/nm1757777/"
    }
  ],
  "creator": [
    {
      "name": "Josh Appelbaum",
      "url": "https://www.imdb.com/name/nm0032227/"
    },
    {
      "name": "André Nemec",
      "url": "https://www.imdb.com/name/nm0625858/"
    },
    {
      "name": "Peter Laird",
      "url": "https://www.imdb.com/name/nm0481990/"
    }
  ]
}