{
  "type": "Movie",
  "name": "The Huntsman: Winter&apos;s War",
  "url": "https://www.imdb.com/tt2381991/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMmI5ZjBjZmMtNTQwOC00YWJjLThkNmUtOTY2ZDkwMmI2ZmU4XkEyXkFqcGdeQXVyMTQ1ODEyNjA@._V1_.jpg",
  "description": "Eric and fellow warrior Sara, raised as members of ice Queen Freya&apos;s army, try to conceal their forbidden love as they fight to survive the wicked intentions of both Freya and her sister Ravenna.",
  "review": {
    "author": "ayoreinf",
    "dateCreated": "2016-06-05",
    "inLanguage": "English",
    "heading": "Based on a false premise, and still a decent film",
    "reviewBody": "I want to say at the very beginning that at the base of this prequel/sequel is a false premise, or a logical fallacy. If one does remember the first movie, there&apos;s no way this one can be truly connected to the same story and characters. This is simply a story line that was stretched and contorted so another movie could be created with Charlize Theron as the evil queen and Chris Hemsworth as the huntsman, everything else didn&apos;t matter, the producers thought they could get some more money from the struggle between these two and the rest simply had to fit in. I knew that before I went to see this one, and I was practically ready to hate it. I didn&apos;t. And once again, the main reason is the acting. To be more precise, it&apos;s the three actresses pulling this unlikely story from start to end. Charlize Theron, once again menacing and chilling as the evil queen, with less fragility and less humanity. Which is, in my book the worst fault of this movie: if one does decide to further develop the characters of the first movie, the starting point should&apos;ve been the origins of Ravena&apos;s hate for all men, and of human emotions. The creative team didn&apos;t go this way, this in fact made Ravena a two dimensional cartoon. Only Charlize Theron brilliance manages to make her somewhat relatable. Then there&apos;s Jessica Chastain as Sara with a performance filled with subtleties and nuances, managing to look like a fierce warrior and still make us feel she has a beating heart in her chest. But both Jessica Chastain and Charlize Theron pale in front of the real standout performance of this film, that&apos;s the one of Emily Blunt. The truth is, she does have the best written role in the film, and she carries it and in fact the entire movie all the way through. If only they could do the same for Charlize Theron, this could&apos;ve been a real something to see. But even as is, the movie is surprisingly engaging and entertaining.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 118483,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Drama"
  ],
  "datePublished": "2016-04-04",
  "keywords": "fairy tale,based on fairy tale,dark fantasy,second part,sequel",
  "duration": "PT1H54M",
  "actor": [
    {
      "name": "Chris Hemsworth",
      "url": "https://www.imdb.com/name/nm1165110/"
    },
    {
      "name": "Jessica Chastain",
      "url": "https://www.imdb.com/name/nm1567113/"
    },
    {
      "name": "Charlize Theron",
      "url": "https://www.imdb.com/name/nm0000234/"
    }
  ],
  "director": [
    {
      "name": "Cedric Nicolas-Troyan",
      "url": "https://www.imdb.com/name/nm1031639/"
    }
  ],
  "creator": [
    {
      "name": "Evan Spiliotopoulos",
      "url": "https://www.imdb.com/name/nm0818746/"
    },
    {
      "name": "Craig Mazin",
      "url": "https://www.imdb.com/name/nm0563301/"
    },
    {
      "name": "Evan Daugherty",
      "url": "https://www.imdb.com/name/nm2489193/"
    }
  ]
}