{
  "type": "Movie",
  "name": "Survive the Game",
  "url": "https://www.imdb.com/tt12861508/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYjBjZjdhOGEtNDFjNi00MzU5LWE1Y2EtYjgzZjM3MWE2YWUzXkEyXkFqcGdeQXVyMjUxOTAxNzI@._V1_.jpg",
  "description": "A man&apos;s life on his farm is interrupted when a cop and a pair of dangerous criminals show up.",
  "review": {
    "author": "FridayElmStreet",
    "dateCreated": "2021-10-16",
    "inLanguage": "English",
    "heading": "Bruce Willis not even pretending to try or care.",
    "reviewBody": "I keep chucking out the newest Bruce Wills movies because I get so damn curious about them and they all suck. Cosmic Sin, Midnight in Switchgrass, Breach, 10 Minutes Gone, Reprisal, The Prince, Hard Kill, Out of Death. All crappy Bruce Willis films made within the last few years. What happened to this guy? He has no passion left for the craft of acting. Hes hardly trying. Why even continue?\n\nOh well lets dive into this film called Survive the Game. The film is about two cops (Bruce Wills and Swen Temmel) bust two villains (Zach Ward who was the bully in A Christmas Story and some girl looking a lot like Harley Quinn) doing some kind of deal. I really did not catch what the deal is or what crime they were committing. The movie explains nothing. Willis gets shot in the gut and expresses very little pain. Its like Tim Roth is Reservoir Dogs if he didnt care. Hes wounded for the whole film but its not like it matters. More bad guys chase the cops through land occupied by a man who lost his family (Chad Michael Murray) and they get into multiple non exciting shootouts and lame car chases where its mostly two cares going kinda fast in a straight line. The film is padded with long drawn out dull dialog yet hardly explains any plot.\n\nThe real heart of this film is Bruce Willis not caring. Its rather funny how much he does not care. Its like he was at gunpoint while being in this film. Sometimes its not even him in the film. There are clearly double sitting in for Bruce in many scenes. And the cherry on top is that on the poster to the film his picture is the same one they used in Midnight in Switchgrass!\n\n2/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 2
    }
  },
  "rating": {
    "ratingCount": 4984,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.1
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Thriller"
  ],
  "datePublished": "2021-10-08",
  "keywords": "outnumbered,drug bust,remote farm,drug dealing,shooting",
  "duration": "PT1H37M",
  "actor": [
    {
      "name": "Chad Michael Murray",
      "url": "https://www.imdb.com/name/nm0614877/"
    },
    {
      "name": "Bruce Willis",
      "url": "https://www.imdb.com/name/nm0000246/"
    },
    {
      "name": "Swen Temmel",
      "url": "https://www.imdb.com/name/nm2394568/"
    }
  ],
  "director": [
    {
      "name": "James Cullen Bressack",
      "url": "https://www.imdb.com/name/nm4097598/"
    }
  ],
  "creator": [
    {
      "name": "Ross Peacock",
      "url": "https://www.imdb.com/name/nm3311016/"
    }
  ]
}