{
  "type": "Movie",
  "name": "The Matrix Resurrections",
  "url": "https://www.imdb.com/tt10838180/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMGJkNDJlZWUtOGM1Ny00YjNkLThiM2QtY2ZjMzQxMTIxNWNmXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
  "description": "Return to a world of two realities: one, everyday life; the other, what lies behind it. To find out if his reality is a construct, to truly know himself, Mr. Anderson will have to choose to follow the white rabbit once more.",
  "review": {
    "author": "siderite",
    "dateCreated": "2022-01-01",
    "inLanguage": "English",
    "heading": "Great start, then progressively worse",
    "reviewBody": "A lot of effort went into the story, with details and references and self references and in-jokes. And yet, in the last act of the film, it felt like who ever wrote the thing ran out of ideas and just did random things. That felt like a betrayal. Then there was the film itself, which consistently felt less evolved, in both effects and fight choreography, than the original film *from 22 years ago!*. Last but not least, there were the characters. Keanu and Carrie-Ann aside, the rest of the people had no characterization at all and the actors, some I knew from other stuff like Sense8, had less to work with than in the TV series they were grabbed from. Remember how awesome Max Riemelt was in Sense 8? Here he was a yes man with a bad accent. Remember how amazing and fun Lambert Wilson was in the original Matrix films? Here he was no more than an obscenity spouting homeless crazy person. I think Jonathan Groff did a reasonable job, but his character was all over the place. And so on. I don&apos;t want to touch on the sexual orientation of most of the actors or the agenda that is always pushed by the Wackowskis, because it doesn&apos;t really matter here. Put all that aside and it&apos;s still a mess of a film. Bottom line: if it were a random low budget scifi, it would have been average. As a sequel to The Matrix, it has great potential and it failed miserably.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 273968,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.7
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Sci-Fi"
  ],
  "datePublished": "2021-12-22",
  "keywords": "fourth part,matrix,war against machines,self referential,simulation",
  "duration": "PT2H28M",
  "actor": [
    {
      "name": "Keanu Reeves",
      "url": "https://www.imdb.com/name/nm0000206/"
    },
    {
      "name": "Carrie-Anne Moss",
      "url": "https://www.imdb.com/name/nm0005251/"
    },
    {
      "name": "Yahya Abdul-Mateen II",
      "url": "https://www.imdb.com/name/nm5584344/"
    }
  ],
  "director": [
    {
      "name": "Lana Wachowski",
      "url": "https://www.imdb.com/name/nm0905154/"
    }
  ],
  "creator": [
    {
      "name": "Lana Wachowski",
      "url": "https://www.imdb.com/name/nm0905154/"
    },
    {
      "name": "David Mitchell",
      "url": "https://www.imdb.com/name/nm3290967/"
    },
    {
      "name": "Aleksandar Hemon",
      "url": "https://www.imdb.com/name/nm3097752/"
    }
  ]
}