{
  "type": "Movie",
  "name": "80 for Brady",
  "url": "https://www.imdb.com/tt18079362/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzY4MzQ1MTgtNGZiYS00Y2M5LWJmODUtYzIzNWFlOGZjMjk5XkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_.jpg",
  "description": "A group of friends made it their life-long mission to go to the Super Bowl and meet NFL superstar Tom Brady.",
  "review": {
    "author": "gee-15",
    "dateCreated": "2023-02-11",
    "inLanguage": "English",
    "heading": "There are only four reasons to watch this movie....",
    "reviewBody": "And they are as follows: Lily Tomlin, Jane Fonda, Rita Moreno and Sally Field. (Okay, if you like football, there will be a fifth: Tom Brady). This movie has the barest of plots (four ladies realize their dream to see the SuperBowl and their favorite player, Tom Brady). Some of the events that play out make no sense. (For example, when they dance their way into the SuperBowl. I&apos;ll be the first to say they dance better than I do but the crowd acts like they&apos;ve just seen Cirque de Soleil not four old broads doing the frug.). But these four pros take thinly written characters and make them stand out. Sally Field is probably the funniest as the retired math professor who loves spouting statistics. Jane Fonda, who looks incredible, is sympathetic as the aging sexpot who really just wants to have a comfortable romance. Rita Moreno is great as a grieving widow with a penchant for gambling. And Lily Tomlin, as the de facto leader of the quartet, leaves the snark behind to play an ordinary woman with health issues that just wants to have one last fun trip with her friends. Check your brain at the door, accept that this is silly sentimental nonsense half the time and remember that this could be the last time we see any one of these great actresses.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 10674,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "contentRating": "12A",
  "genre": [
    "Biography",
    "Comedy",
    "Drama"
  ],
  "datePublished": "2023-03-24",
  "keywords": "nfl,super bowl,friend,american football,football",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Lily Tomlin",
      "url": "https://www.imdb.com/name/nm0005499/"
    },
    {
      "name": "Jane Fonda",
      "url": "https://www.imdb.com/name/nm0000404/"
    },
    {
      "name": "Rita Moreno",
      "url": "https://www.imdb.com/name/nm0001549/"
    }
  ],
  "director": [
    {
      "name": "Kyle Marvin",
      "url": "https://www.imdb.com/name/nm5568803/"
    }
  ],
  "creator": [
    {
      "name": "Sarah Haskins",
      "url": "https://www.imdb.com/name/nm2873539/"
    },
    {
      "name": "Emily Halpern",
      "url": "https://www.imdb.com/name/nm1054604/"
    }
  ]
}