{
  "type": "Movie",
  "name": "Adalynn",
  "url": "https://www.imdb.com/tt15353442/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOWRiYmExMWUtMThiMC00NjIxLWI1MjMtNGRiNWMyYjFkNTY5XkEyXkFqcGdeQXVyOTEyNzg5MA@@._V1_.jpg",
  "description": "When her husband leaves on a business trip, a new mom off her psych meds is driven to madness and uncovers a secret that will forever change her life.",
  "review": {
    "author": "astraight-05807",
    "dateCreated": "2023-11-11",
    "inLanguage": "English",
    "heading": "Might need to think about if mental health is triggering before watching",
    "reviewBody": "It seems a little underrated, honestly. I would say it probably should have had a description that even sort of touched on how potentially triggering to a select kind of audience it would be potentially problematic for, but I get the feeling that was kind of the point. The description was vague, there isn&apos;t a lot of context given unless you watch it. If you have the hyper vigilance like I do, it will all make sense along the way. There are details super small for support which is actually brilliant. So many tiny clues, though if you miss them? You&apos;re not lost without them.\n\nI knew what the end would be to some degree, which is almost always the case with movies/shows, though still found myself a bit off at the point. I knew it was coming, fully expected the outcome, and yet it still felt like I needed to make sure I was right. That should be skipped by a larger, though still not huge, group of people who might be triggered by it. With good reason, I might add. Think serious mental health issues, without giving the whole thing away. If this is a sensitive subject for you? Please skip the movie. Though there is something to be said about the portion that speaks to bringing awareness and the idea that shame forces a masking behavior. It&apos;s deeper than it comes across.\n\nIt&apos;s definitely not rated according to the brain of someone that appreciates the layers of the story more than the budget. And frankly? It probably wouldn&apos;t have been so worth the watch with a higher budget. If you can bring yourself to watch it, you&apos;ll understand why. That&apos;s not to say movies with a similar plot line haven&apos;t been made, as with almost every other movie you will see. Obviously the horror concept relates to a very real occurrence in mental health which a million other movies could touch on as well. The likelihood of understanding the mental illness exists, has been part of true crime stories with a different plot line, and even possibly knowing someone who has the symptoms in real life? That&apos;s the horror aspect. That&apos;s the root. Which is kind of a brilliant way to label horror as an avid horror movie watcher. It&apos;s a different take than a slasher or paranormal thriller. I would recommend for my reasons, but again? Not for all.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 121,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.1
  },
  "contentRating": null,
  "genre": [
    "Drama",
    "Horror",
    "Mystery"
  ],
  "datePublished": "2023-03-28",
  "keywords": "psychological thriller,postpartum depression,mother,mental health,psychosis",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Sydney Carvill",
      "url": "https://www.imdb.com/name/nm10629864/"
    },
    {
      "name": "Wade Baker",
      "url": "https://www.imdb.com/name/nm6001526/"
    },
    {
      "name": "Janet Carter",
      "url": "https://www.imdb.com/name/nm3401034/"
    }
  ],
  "director": [
    {
      "name": "Jacob Byrd",
      "url": "https://www.imdb.com/name/nm4900820/"
    }
  ],
  "creator": [
    {
      "name": "Jerrod D. Brito",
      "url": "https://www.imdb.com/name/nm4809543/"
    }
  ]
}