{
  "type": "Movie",
  "name": "Blue Beetle",
  "url": "https://www.imdb.com/tt9362930/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMmY1ODUzZGItNDllOS00MDBhLTg4NmUtYjU4YjUxMGNlYmMwXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
  "description": "An alien scarab chooses Jaime Reyes to be its symbiotic host, bestowing the recent college graduate with a suit of armor that&apos;s capable of extraordinary powers, forever changing his destiny as he becomes the superhero known as Blu...",
  "review": {
    "author": "deveshk-51057",
    "dateCreated": "2023-09-14",
    "inLanguage": "English",
    "heading": "Boring, predictable and uninspiring",
    "reviewBody": "I&apos;m a big fan of superhero movies and especially DC. I really loved the style of Man of steel. I love that DC takes the time to make action and movies more intense in their fight sequences and also does a great job at setting up characters and making you care about them.\n\nWell this movie literally just had me bored and I don&apos;t know what else to say. The only good part was the family dynamic in the movie which was nice to see but I really found myself caring very little about the characters and the villain is extremely average and uninspired.\n\nThe fight scenes I just very bland and it seems like there&apos;s a lot that happens but they were just boring and very average even though they try not to be. This movie really made me contemplate why I even watch movies anymore and how predictable cinema has become instead of being something that should ignite the senses and the imagination and this was the complete opposite of that and has made me not go and watch random superhero movies anymore.\n\nI&apos;ve never given any marble or DC movie of 4 out of 10 and this is the first because it just felt like a waste of my time and at no point was I excited and in fact I actually walked out in the middle of a fight scene with 25 minutes left to go in the movie.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 83492,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2023-08-18",
  "keywords": "based on comic book,superhero,dc extended universe,good versus evil,dc comics",
  "duration": "PT2H7M",
  "actor": [
    {
      "name": "Xolo Maridueña",
      "url": "https://www.imdb.com/name/nm4927704/"
    },
    {
      "name": "Bruna Marquezine",
      "url": "https://www.imdb.com/name/nm1367490/"
    },
    {
      "name": "Becky G",
      "url": "https://www.imdb.com/name/nm3121384/"
    }
  ],
  "director": [
    {
      "name": "Angel Manuel Soto",
      "url": "https://www.imdb.com/name/nm3924049/"
    }
  ],
  "creator": [
    {
      "name": "Gareth Dunnet-Alcocer",
      "url": "https://www.imdb.com/name/nm3722546/"
    }
  ]
}