{
  "type": "Movie",
  "name": "Elemental",
  "url": "https://www.imdb.com/tt15789038/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjYxYWVjMDMtZGRjZS00ZDE4LTk0OWUtMjUyOTI4MmYxNjgwXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_.jpg",
  "description": "Follows Ember and Wade, in a city where fire-, water-, earth- and air-residents live together.",
  "review": {
    "author": "talking_about_movies",
    "dateCreated": "2023-09-16",
    "inLanguage": "English",
    "heading": "Romantic",
    "reviewBody": "This is the Pixar I know. I knew what kind of a story Elemental was going to be. From the IMDb plot and the reviews, I knew the cliches it would have and the route it will take. But this movie still really touched me.\n\nI was really surprised by how well they executed the romance. And I&apos;m surprised by the fact that Pixar made just a love story. I knew there was going to be romance in this but I thought, like most pixar movies, the main theme of this movie would be something else and the romance would progress on the sidelines. But no, the romance takes center stage in this film.\n\nThe main character, Ember, was very well written. She was likeable, relatable, and we as viewers experienced the entire story through her perspective. In comparison to Ember though, the side characters aren&apos;t as well explored as she is and that&apos;s the aspect of the movie that could&apos;ve been a bit better.\n\nBut the romance is very good, honestly. It doesn&apos;t fit at first and feels a bit forced initially. That&apos;s why the 1st act of the movie isn&apos;t really as engaging. But the romance is paced perfectly. Because when these 2 characters started understanding more and more about each other, I started to really root for them and that&apos;s when this movie started to get really good. Amd the conclusion of the movie is very satisfying because of how well the romance is executed. The soundtrack too was very catchy and it worked perfectly with some specific moments of the film.\n\nThe theme though is cliche and it could have been done better. And the character of wade too could have been explored a bit more.\n\nBut in the end, I had a really nice time with this movie. You know, when a character is crying, and you just can&apos;t help but feel like crying yourself, that&apos;s when you know the movie has done its job.\n\nPixar had lost its way lately, but this film might get them back on track. This was a very sweet and wonderfully executed romance.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 109580,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2023-07-07",
  "keywords": "pixar,3d animation,fire,water,air",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "Leah Lewis",
      "url": "https://www.imdb.com/name/nm2301427/"
    },
    {
      "name": "Mamoudou Athie",
      "url": "https://www.imdb.com/name/nm6974206/"
    },
    {
      "name": "Ronnie Del Carmen",
      "url": "https://www.imdb.com/name/nm0215455/"
    }
  ],
  "director": [
    {
      "name": "Peter Sohn",
      "url": "https://www.imdb.com/name/nm0812307/"
    }
  ],
  "creator": [
    {
      "name": "John Hoberg",
      "url": "https://www.imdb.com/name/nm0387671/"
    },
    {
      "name": "Kat Likkel",
      "url": "https://www.imdb.com/name/nm0969581/"
    },
    {
      "name": "Brenda Hsueh",
      "url": "https://www.imdb.com/name/nm1597674/"
    }
  ]
}