{
  "type": "Movie",
  "name": "Ailey",
  "url": "https://www.imdb.com/tt13622084/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZDAzOWYzN2ItMTM0MS00OWU5LTkwZjctMjcwMTJmMmU0ZWVkXkEyXkFqcGdeQXVyMTAyMjQ3NzQ1._V1_.jpg",
  "description": "An immersive portrait of dance pioneer Alvin Ailey, told through his own words and a new dance inspired by his life.",
  "review": {
    "author": "rannynm",
    "dateCreated": "2021-07-22",
    "inLanguage": "English",
    "heading": "Beautiful exploration of choreographer Alvin Ailey and his influence on dance",
    "reviewBody": "The documentary Ailey redefines the meaning of contemporary dance and the unconventional form created by choreographer Alvin Ailey.\n\nAiley is a documentary about the life of choreographer Alvin Ailey, known for creating contemporary dance arrangements such as Revelations and The River. With his own narration and testimonials from people who knew him, we learn who he was, what he went through and how he interpreted his life into dances that later became world renowned.\n\nOut of many dance genres, modern dance used to be my least favorite. I found it odd and confusing. That is until I watched the film Ailey. Director Jamlia Wignot takes the documentary into a learning experience not only about Alvin Ailey, but also about the true meaning of interpretive dance. I enjoy the scenes of the modern Alvin Ailey Dance Theater, showing that his legacy still lives on through dance. This film has many scenes that feel like filler when the narrator is speaking and that gets repetitive over time. I love how this film does not require you to have a general knowledge or passion for dance. It allows the audience to create their own feelings and opinions about what dance means to them.\n\nThe message of Ailey is to pursue your passion and use your talent to impact others in a meaningful way. This documentary portrays this message with great success.\n\nI give Ailey 4.5 out of 5 stars and recommend it for ages 10 to 18, plus adults. You can watch Ailey in theatres July 23, 2021.\n\nReviewed by Ashleigh C., KIDS FIRST!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 292,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "12A",
  "genre": [
    "Documentary",
    "Biography",
    "History"
  ],
  "datePublished": "2021-07-23",
  "keywords": "gay,aids,choreography,one word title,character name as title",
  "duration": "PT1H35M",
  "actor": [
    {
      "name": "Alvin Ailey",
      "url": "https://www.imdb.com/name/nm0014617/"
    },
    {
      "name": "Fana Minea Tesfagiorgis",
      "url": "https://www.imdb.com/name/nm12379062/"
    },
    {
      "name": "Judith Jamison",
      "url": "https://www.imdb.com/name/nm0417192/"
    }
  ],
  "director": [
    {
      "name": "Jamila Wignot",
      "url": "https://www.imdb.com/name/nm2163565/"
    }
  ],
  "creator": []
}