{
  "type": "Movie",
  "name": "Antlers",
  "url": "https://www.imdb.com/tt7740510/",
  "poster": "https://m.media-amazon.com/images/M/MV5BY2UzODAyNjktN2MwYy00M2RkLThiOTEtMjU1MTgxY2EzM2YyXkEyXkFqcGdeQXVyODk5MDA0MDU@._V1_.jpg",
  "description": "In an isolated Oregon town, a middle-school teacher and her sheriff brother become embroiled with her enigmatic student, whose dark secrets lead to terrifying encounters with an ancestral creature.",
  "review": {
    "author": "CinemaClown",
    "dateCreated": "2021-12-15",
    "inLanguage": "English",
    "heading": "Wants To Say Many Things, Ends Up Saying Nothing",
    "reviewBody": "Steeped in dark, grim & brooding atmosphere yet failing to capitalise on it to fully realise its ambitions, Antlers begins on a promising note but it doesn&apos;t take long for the film to devolve into a frustrating slog. It tries to be too many things yet doesn&apos;t have the discipline or clarity to deliver the desired goods. There is plenty it wants to say yet has no idea how to articulate it right.\n\nCo-written & directed by Scott Cooper (Black Mass), the story does create the right sort of intrigue with its foreboding mystery but the human drama that unfolds is not only bland but also inauthentic. Cooper is unsure of what road to take and plays with several ideas hoping some would somehow stick. The balance between its genre elements is off, and the themes aren&apos;t properly handled either.\n\nOn the plus side, the creature design, gore effects & moody camerawork is worth a mention but the plot & characters don&apos;t have that gripping quality to it that would make us care. Still, the actors do what they can to make the journey worthwhile but it doesn&apos;t amount to a lot in the end. The problem lies with the script itself that required more fine-tuning to figure out its identity and what themes to address or discard.\n\nOverall, Antlers strives to be a supernatural horror rooted in indigenous folklore, an allegory about unresolved trauma, drug addiction & child abuse, and also an environmental parable, all at the same time, yet falls remarkably short on nearly all fronts. Its premise had potential but its execution is dry & directionless, thus resulting in a tedious & disappointing genre fare that in an effort to say several things ends up saying nothing at all.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 43576,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Horror",
    "Mystery"
  ],
  "datePublished": "2021-10-29",
  "keywords": "wendigo,folk horror,native american legend,traumatized child,locked in a room",
  "duration": "PT1H39M",
  "actor": [
    {
      "name": "Keri Russell",
      "url": "https://www.imdb.com/name/nm0005392/"
    },
    {
      "name": "Jesse Plemons",
      "url": "https://www.imdb.com/name/nm0687146/"
    },
    {
      "name": "Jeremy T. Thomas",
      "url": "https://www.imdb.com/name/nm8864596/"
    }
  ],
  "director": [
    {
      "name": "Scott Cooper",
      "url": "https://www.imdb.com/name/nm0178376/"
    }
  ],
  "creator": [
    {
      "name": "Henry Chaisson",
      "url": "https://www.imdb.com/name/nm5737776/"
    },
    {
      "name": "Nick Antosca",
      "url": "https://www.imdb.com/name/nm4528537/"
    },
    {
      "name": "Scott Cooper",
      "url": "https://www.imdb.com/name/nm0178376/"
    }
  ]
}