{
  "type": "Movie",
  "name": "Don&apos;t Breathe 2",
  "url": "https://www.imdb.com/tt6246322/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNjgzMjQ4NjMtNzQ5OS00MzE4LWIxMmMtNjI0YjM1ZWZiN2U2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
  "description": "The sequel is set in the years following the initial deadly home invasion, where Norman Nordstrom lives in quiet solace until his past sins catch up to him.",
  "review": {
    "author": "CinemaClown",
    "dateCreated": "2021-09-04",
    "inLanguage": "English",
    "heading": "Some Sequels Are Better Left Unmade",
    "reviewBody": "An unwanted, unwarranted & unnecessary sequel to Fede Alvarez&apos;s tense, thrilling & terrifying original, Don&apos;t Breathe 2 is a dull, derivative & disappointing follow-up that sacrifices the nail-bitingly intense atmosphere & clever setup of the 2016 home-invasion horror, and attempts to make up for it by upping the violence & brutality without first rectifying the glaring problems in the script.\n\nCo-written & directed by Rodo Sayagues in his directorial debut, the film neither exhibits any potential nor is able to validate its existence at any given time, and treads a route that&apos;s very predictable from afar. Where the previous chapter invoked terror & suspense by tapping into the viewers&apos; primal fears, this one takes an action-oriented approach and is severely lacking the unsettling aura of the first film.\n\nThe new characters are awfully sketched while the reprising one&apos;s arc goes nowhere, and its attempt to rehabilitate the protagonist is absurd, for all the story does is make him the lesser of two evils. Stephen Lang still delivers a solid input and retains his intimidating presence but the rest are simply forgettable in their caricature roles. And also not helping the cause are its generic plot, cartoonish characters & dumb twists.\n\nOverall, Don&apos;t Breathe 2 is downright inferior to its predecessor and has none of the qualities that made the last effort such an effective & impressive entry in the home-invasion subgenre of horror-thrillers. It is only during the first half that the film is able to create a sort of interest but it is only brief, short-lived & fizzles out just as quick. There is a bleak, nihilistic element at play here but the storytelling is too bland & uninspiring for it to amount to much.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 69691,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6
  },
  "contentRating": "18",
  "genre": [
    "Action",
    "Crime",
    "Horror"
  ],
  "datePublished": "2021-08-13",
  "keywords": "blind man,home invasion,ex navy seal,sole survivor,old blind man",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Stephen Lang",
      "url": "https://www.imdb.com/name/nm0002332/"
    },
    {
      "name": "Madelyn Grace",
      "url": "https://www.imdb.com/name/nm6388677/"
    },
    {
      "name": "Brendan Sexton III",
      "url": "https://www.imdb.com/name/nm0786639/"
    }
  ],
  "director": [
    {
      "name": "Rodo Sayagues",
      "url": "https://www.imdb.com/name/nm2140186/"
    }
  ],
  "creator": [
    {
      "name": "Fede Alvarez",
      "url": "https://www.imdb.com/name/nm1793079/"
    },
    {
      "name": "Rodo Sayagues",
      "url": "https://www.imdb.com/name/nm2140186/"
    }
  ]
}