{
  "type": "Movie",
  "name": "God&apos;s Not Dead: We the People",
  "url": "https://www.imdb.com/tt14578032/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMzJlNmI4MzAtYTU4NS00Y2FiLWExYzUtMWU0ODBlN2UwNDI2XkEyXkFqcGdeQXVyMjMzNDQxMTQ@._V1_.jpg",
  "description": "Reverend Dave defending himself and a group of Christian homeschooling families after the inspection by the local government official.",
  "review": {
    "author": "23samurai",
    "dateCreated": "2021-11-09",
    "inLanguage": "English",
    "heading": "They saved the worst for last (hopefully)",
    "reviewBody": "This entire series is laughable, but GND4 just takes the cake for the most preachy, unrealistic, unsubtle garbage yet to come out of what was Pureflix (has a different name now, apparently). I thought they would end this series and move on after the third one-which, I will concede, showed minor improvement over the first two films-didn&apos;t do well commercially, but I guess not.\n\nThe entire plot of the movie revolves around a non-issue. The government is attempting to force homeschooling Christian families to adhere to a specific curriculum or face fines; apparently it is these families and only them who are targeted, so returning character Reverend Dave resolves to take the matter to Washington to fight for Christians&apos; rights that are supposedly under attack. Tell me, when have Christian homeschooling families ever been treated this way? No one is attempting to ban them from teaching the Bible to their children. It&apos;s not the curriculum being attacked, it&apos;s Christianity, and the film makes sure to continually drive that point home. Although all of these films wallow in a persecution fantasy, it&apos;s particularly egregious here.\n\nThe film also spews a gratuitous amount of pro America sentiment which, I noticed, is almost always spoken the loudest by people of colour/ethnic minorities. Case in point: returning character Martin Yip shows up to loudly praise America&apos;s virtues, after which he is forgotten about. His only purpose in the film is to have an immigrant vouch for how amazing the USA is.\n\nBesides all that, the film suffered from the usual &apos;Christian&apos; film issues: bad acting, bad writing, uninspired direction, the works. However, this movie stands out for just how ridiculous, unlikely and in-your-face it is. Not only is it the worst instalment in this series, I have to say it&apos;s one of the worst religious films of all time.\n\nHopefully the faithful will eventually start to demand more from these religious production companies so we can actually get some quality films.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 1
    }
  },
  "rating": {
    "ratingCount": 1577,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.2
  },
  "contentRating": "PG",
  "genre": [
    "Drama",
    "Fantasy"
  ],
  "datePublished": "2021-11-11",
  "keywords": "anti christian,god in title,christian,christian film,homeschooling",
  "duration": "PT1H32M",
  "actor": [
    {
      "name": "David A.R. White",
      "url": "https://www.imdb.com/name/nm0924684/"
    },
    {
      "name": "William Forsythe",
      "url": "https://www.imdb.com/name/nm0001235/"
    },
    {
      "name": "Isaiah Washington",
      "url": "https://www.imdb.com/name/nm0913460/"
    }
  ],
  "director": [
    {
      "name": "Vance Null",
      "url": "https://www.imdb.com/name/nm3749865/"
    }
  ],
  "creator": [
    {
      "name": "Tommy Blaze",
      "url": "https://www.imdb.com/name/nm0087984/"
    },
    {
      "name": "Chuck Konzelman",
      "url": "https://www.imdb.com/name/nm0465484/"
    },
    {
      "name": "Cary Solomon",
      "url": "https://www.imdb.com/name/nm0813301/"
    }
  ]
}