{
  "type": "Movie",
  "name": "Happily",
  "url": "https://www.imdb.com/tt9849004/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMGMxMzBhNDQtODJhNy00NDBmLWI5NTYtMTJkMjUxYjE0OWZjXkEyXkFqcGdeQXVyMTAyMjQ3NzQ1._V1_.jpg",
  "description": "A dark romantic comedy. Tom and Janet have been happily married for years. But a visit from a mysterious stranger leads to a dead body, a lot of questions, and a tense couples&apos; trip with friends who may not actually be friends at ...",
  "review": {
    "author": "joostkale",
    "dateCreated": "2021-03-20",
    "inLanguage": "English",
    "heading": "Interesting concept with really unrealistic side characters",
    "reviewBody": "This is one of those movies where the ending can make or break it, but it ended up doing neither. The entire movie keeps you interested with the mystery that is going on, but it just ends up giving you a totally different conclusion. While I did enjoy the reality of the ending, it still left me with a lot of questions. I think the concept of the story is really intriguing. The movie gives of this really weird feeling that won&apos;t go away until the final shot. It&apos;s just not right. Everything feels just a bit of. When we first get introduced to the main couple, we feel the love, but also the weirdness of their relationship. Well, they were probably the most normal by the end of the movie. Everyone in the movie has their own problems and backstories, but they don&apos;t really explain the way they react to certain events. There are some very frustrating character decisions in the movie that are just left unanswered by the end. I still think it&apos;s a solid watch, but there is just to much unrealistic decisions to feel satisfied by the end.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 4362,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Crime",
    "Romance"
  ],
  "datePublished": "2021-03-19",
  "keywords": "visit",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Kerry Bishé",
      "url": "https://www.imdb.com/name/nm2628935/"
    },
    {
      "name": "Joel McHale",
      "url": "https://www.imdb.com/name/nm0570364/"
    },
    {
      "name": "Al Madrigal",
      "url": "https://www.imdb.com/name/nm1371339/"
    }
  ],
  "director": [
    {
      "name": "BenDavid Grabinski",
      "url": "https://www.imdb.com/name/nm2818863/"
    }
  ],
  "creator": [
    {
      "name": "BenDavid Grabinski",
      "url": "https://www.imdb.com/name/nm2818863/"
    }
  ]
}