{
  "type": "Movie",
  "name": "Lansky&apos;s Road",
  "url": "https://www.imdb.com/tt0239551/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOGNmZjJlMmQtNzA2YS00MDA0LTg4NmYtMjUyMWYwYmM2ZWE2XkEyXkFqcGdeQXVyODQ4MDM0NA@@._V1_.jpg",
  "description": "A couple is abducted by aliens. After they are released, they are hounded by both the media and government agents trying to discover what they might have learned about the aliens.",
  "review": {
    "author": "richar-2",
    "dateCreated": "2022-08-28",
    "inLanguage": "English",
    "heading": "Amazing Story",
    "reviewBody": "This is one of the most unique interesting and fresh stories I have ever seen. The camera work is very exceptional with a number of memorable moments. It&apos;s too bad when it was originally released it didn&apos;t get the attention it deserves. But with Richard&apos;s re-release and remastering it has even reached higher than it was ever was before.\n\nI must say I have seen a lot of science fiction movies I have seen a lot of Science Fiction independent Productions and this one really stands out.\n\nWith Richard&apos;s updating to bring his movie Into The 21st century has really brought new light into the strangely odd issue of the current disclosure debate.\n\nAnd then to top it off the ending is just spell binding answering questions but then establishing a whole new set of questions with a whole new sets of twist this movie twist and turns and leaves you with a satisfying result.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": null,
    "bestRating": null,
    "worstRating": null,
    "ratingValue": null
  },
  "contentRating": null,
  "genre": [
    "Sci-Fi"
  ],
  "datePublished": null,
  "keywords": "government",
  "duration": null,
  "actor": [],
  "director": [
    {
      "name": "Richard Farr",
      "url": "https://www.imdb.com/name/nm0268056/"
    }
  ],
  "creator": [
    {
      "name": "Richard Farr",
      "url": "https://www.imdb.com/name/nm0268056/"
    }
  ]
}