{
  "type": "Movie",
  "name": "Mass",
  "url": "https://www.imdb.com/tt11389748/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZGM3MDg1YzYtMzM0MS00ZGY2LWE4ZjctZDZhYmZlYjVlZGE5XkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_.jpg",
  "description": "The parents of both the shooter and one of the victims of a school shooting tragedy agree to meet and talk in an attempt to move forward.",
  "review": {
    "author": "jtindahouse",
    "dateCreated": "2022-01-10",
    "inLanguage": "English",
    "heading": "The power that perfectly written dialogue can possess",
    "reviewBody": "I love nothing more than when a film that takes place almost entirely inside one room is able to be infinitely more powerful and impactful than a film made on a 200 million dollar budget. It&apos;s what movie-making has lost in my opinion, the ability to make magic on paper, rather than by throwing special effects and stunts at the screen willy-nilly. &apos;Mass&apos; is an incredible film.\n\nI&apos;ll start by talking about the cast. The script is quite amazing in that it somehow gives each and every one of the main four an exactly equal opportunity to shine. If you said to me which of the four was the star, or even which stood out the most I would struggle to pick one. The each take the limelight when it&apos;s on offer, and they each fall back into supporting the others when it&apos;s not their turn. The balancing act in this regard is excellent.\n\nThe film is like being hit with a sledgehammer in the best way possible (hopefully that makes sense to you). The film is so powerful that it really does feel like you are in these character&apos;s positions. Their pain is yours. The film also does a great job of knowing when to reveal information. There was a pointy where I thought to myself that the time was right to let us in on what was going on, and within 60 seconds the film had done just that.\n\nThe fact that this is a debut writing/directing effort by Fran Kranz is nothing short of amazing. The dialogue is mesmerising, the pacing is perfect and the class with which the ending was handled (this would not have been an easy film to write the ending for) was classy beyond his years. This is a film not to be missed and very close to the best 2021 had to offer. 10/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 10
    }
  },
  "rating": {
    "ratingCount": 17102,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.6
  },
  "contentRating": "12A",
  "genre": [
    "Drama"
  ],
  "datePublished": "2022-01-21",
  "keywords": "church,grief,reference to barack obama,written by director,reference to alcoholics anonymous",
  "duration": "PT1H51M",
  "actor": [
    {
      "name": "Jason Isaacs",
      "url": "https://www.imdb.com/name/nm0005042/"
    },
    {
      "name": "Martha Plimpton",
      "url": "https://www.imdb.com/name/nm0000588/"
    },
    {
      "name": "Ann Dowd",
      "url": "https://www.imdb.com/name/nm0235652/"
    }
  ],
  "director": [
    {
      "name": "Fran Kranz",
      "url": "https://www.imdb.com/name/nm0469823/"
    }
  ],
  "creator": [
    {
      "name": "Fran Kranz",
      "url": "https://www.imdb.com/name/nm0469823/"
    }
  ]
}