{
  "type": "Movie",
  "name": "Kaibutsu",
  "url": "https://www.imdb.com/tt23736044/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDA3NTQ1YWItZDg4Ny00ZDYxLWJmZDYtODY4MTcwYWFlMDYwXkEyXkFqcGdeQXVyMDc5ODIzMw@@._V1_.jpg",
  "description": "A mother demands answers from teacher when her son begins acting strangely.",
  "review": {
    "author": "bjhex1",
    "dateCreated": "2023-07-10",
    "inLanguage": "English",
    "heading": "Who judges whom?",
    "reviewBody": "A very well constructed film exploring the complexity of how simple words and actions affect people in unexpected ways. Highly relatable in showing how, armed with only a superficial understanding of a person or situation, context can be manufactured to fit a particular narrative. But not only individuals, but institutions as well are put in the crosshairs. The bureaucratic value placed on appearance and propriety (perhaps more particularly in Japanese society but nevertheless universal) is also critiqued.\n\nBut the most telling point, and for me the one most central to the story, was what could have been dismissed as a throw-away line. But at its heart, the perfect example of how simple words create a life of their own. It&apos;s when the teacher, Mr. Hori, casually, and quite un-seriously, remarks in the PE class about what it is to be a man. At its core, that&apos;s what the film is about, understanding who you are as a human, and accepting it on your own terms. Confusion, misinterpretation, familial and societal expectations of how someone must be, or act, or love, can turn them into the other, the strange, the monster. And the film is overflowing with empathy for all those who become afflicted in one way or another.\n\nIf the film has one drawback, it&apos;s that the editing in the later stages of the film gets a bit loose. The time-jump and multiple perspective structure of the film works magnificently well for most of the film, but nearing the end, it does tend to drag a bit. But overall, a wonderfully engaging and skillfully produced film.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 6420,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 8.1
  },
  "contentRating": "PG-13",
  "genre": [
    "Drama",
    "Thriller"
  ],
  "datePublished": "2023-06-02",
  "keywords": "gay love,father,mother,child,children",
  "duration": "PT2H7M",
  "actor": [
    {
      "name": "Sakura Ando",
      "url": "https://www.imdb.com/name/nm2747232/"
    },
    {
      "name": "Eita Nagayama",
      "url": "https://www.imdb.com/name/nm1216345/"
    },
    {
      "name": "Soya Kurokawa",
      "url": "https://www.imdb.com/name/nm13318127/"
    }
  ],
  "director": [
    {
      "name": "Kore-eda Hirokazu",
      "url": "https://www.imdb.com/name/nm0466153/"
    }
  ],
  "creator": [
    {
      "name": "Yûji Sakamoto",
      "url": "https://www.imdb.com/name/nm0757111/"
    }
  ]
}