{
  "type": "Movie",
  "name": "Paranormal Activity: Next of Kin",
  "url": "https://www.imdb.com/tt10515988/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYTI0YjQ1OWItZTI4NS00MDY4LWE1OWMtMWJlMjIzY2VkNDMzXkEyXkFqcGdeQXVyMTM1MTE1NDMx._V1_.jpg",
  "description": "Margot, a young woman who was abandoned by her mother as a baby, travels to a secluded Amish community with a documentary film crew seeking answers about her mother and extended family.",
  "review": {
    "author": "jtindahouse",
    "dateCreated": "2021-10-29",
    "inLanguage": "English",
    "heading": "Has nothing that used to make the Paranormal Activity movies great",
    "reviewBody": "&apos;Paranormal Activity&apos; films used to be the staple of every Halloween. They were remarkably consistent right up until the very unfortunate &apos;Ghost Dimension&apos; which killed the series. Now, years later, we have another entry in the &apos;Paranormal Activity&apos; series. The only problem is that it is a part of the series in name only. It has no connection to the previous films and it has nothing that demands it be a &apos;Paranormal Activity&apos; movie. It could be any old found footage film - and not a very good one at that.\n\nThe original series was so good because it was set in an ordinary looking house like yours or mine. And the thought of your partner spending hours through the night standing over you and staring was simply terrifying. A film set on an Amish farm isn&apos;t scary in any way, because who of us is ever going to go to one?\n\nA couple of things I did like. They were able to recreate the feel of the series in the first half of the film. It was actually building up quite nicely for a while there until it decided to go well off the rails at the end. The other thing I liked were the main three characters. They were very likeable and people I could get onside with.\n\nI feel like I&apos;m mentioning it a lot in films lately, but it needs to be remembered that less is more. This film goes so hard and in your face that it can&apos;t possible be scary. What we don&apos;t see is always scarier than what we do. This film completely forgets that at the end.\n\nI so desperately wanted to like this movie, with the hope that it would reignite a series that I love. This wasn&apos;t the storyline to do it with though. This feels like a random found footage film that needed a selling point, and so chucked &apos;Paranormal Activity&apos; in front of its title. Very disappointing. 5/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 16026,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": "15",
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2023-09-14",
  "keywords": "franchise,sequel,supernatural creature,uber,vanity",
  "duration": "PT1H38M",
  "actor": [
    {
      "name": "Emily Bader",
      "url": "https://www.imdb.com/name/nm7515939/"
    },
    {
      "name": "Roland Buck III",
      "url": "https://www.imdb.com/name/nm5828411/"
    },
    {
      "name": "Dan Lippert",
      "url": "https://www.imdb.com/name/nm5505923/"
    }
  ],
  "director": [
    {
      "name": "William Eubank",
      "url": "https://www.imdb.com/name/nm1827931/"
    }
  ],
  "creator": [
    {
      "name": "Christopher Landon",
      "url": "https://www.imdb.com/name/nm0484907/"
    },
    {
      "name": "Oren Peli",
      "url": "https://www.imdb.com/name/nm2305431/"
    }
  ]
}