{
  "type": "Movie",
  "name": "Shiva Baby",
  "url": "https://www.imdb.com/tt11317142/",
  "poster": "https://m.media-amazon.com/images/M/MV5BM2Y5ZDg1MmMtNjJkYS00NmEzLTk0ZjAtMGUxOTIyMDVlNzM1XkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_.jpg",
  "description": "At a Jewish funeral service with her parents, a college student runs into her sugar daddy and ex girlfriend.",
  "review": {
    "author": "Pjtaylor-96-138044",
    "dateCreated": "2021-06-13",
    "inLanguage": "English",
    "heading": "The chaos of cringe.",
    "reviewBody": "Set mostly in real time, &apos;Shiva Baby (2020)&apos; focuses on a young woman whose life seems to spiral out of control when she bumps into her sugar daddy at a shiva. It&apos;s basically an exercise in controlled chaos. With its claustrophobic atmosphere, creepy soundtrack and uncomfortably relatable cringe, the picture basically feels like a panic attack on screen. In many ways, it actually tells its tales using tropes of the horror genre. It swaps jump-scares for awkward confrontations, monsters for judgmental relatives and blood and guts for unattainable expectations. It&apos;s not scary, as such, but it certainly gets under your skin, eking as much suspense from its central situation as possible. It puts you in the position of its protagonist, bombarded with passive aggressive prying and close calls with the truth. There&apos;s almost always an impending sense of doom; devastation seems inevitable. The flick isn&apos;t dour, though. It&apos;s often quietly funny, its comedy coming purely from its characters and their almost unbearable social situation. There&apos;s quite a bit of dramatic irony going on and it works very well. As does the character development in general, which is slight but significant. Every player feels like an actual person, like someone you could (and probably do) actually know, and that&apos;s really impressive. Overall, this is an entertaining and engaging film. It&apos;s interesting, well-written and unique. 7/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 31192,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "15",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2021-06-11",
  "keywords": "sugar daddy,jewish family,bi protagonist,cheating husband,jewish culture",
  "duration": "PT1H17M",
  "actor": [
    {
      "name": "Rachel Sennott",
      "url": "https://www.imdb.com/name/nm6976735/"
    },
    {
      "name": "Danny Deferrari",
      "url": "https://www.imdb.com/name/nm1876851/"
    },
    {
      "name": "Fred Melamed",
      "url": "https://www.imdb.com/name/nm0577329/"
    }
  ],
  "director": [
    {
      "name": "Emma Seligman",
      "url": "https://www.imdb.com/name/nm7681231/"
    }
  ],
  "creator": [
    {
      "name": "Emma Seligman",
      "url": "https://www.imdb.com/name/nm7681231/"
    }
  ]
}