{
  "type": "Movie",
  "name": "Spirit Untamed",
  "url": "https://www.imdb.com/tt11084896/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMDVlZTEwMTItNmE4Zi00ZGFhLWI4NjgtMDdiZTA5NDdmNWYyXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg",
  "description": "Lucky Prescott&apos;s life is changed forever when she moves from her home in the city to a small frontier town and befriends a wild mustang named Spirit.",
  "review": {
    "author": "Clank_Zoka",
    "dateCreated": "2021-07-31",
    "inLanguage": "English",
    "heading": "Who Asked for This?",
    "reviewBody": "I liked the first Spirit movie, it has a unique story, beautiful animation and memorable characters, a very underrated DreamWorks film I must say, but who asked for a 3D animated movie?, even if it&apos;s related the show, it came out in the UK yesterday and I gave it a watch and... yeah..., it was boring.., super bland and forgettable...\n\nThe film has nothing new or original, it&apos;s the same old saving the animals from villain with a parent who won&apos;t listen and main character want to explore instead of following family tradition, it&apos;s predictable to the point that you can guess within the first few minutes and you can connect the dots, it&apos;s exactly that, it&apos;s not a funny movie at all, I didn&apos;t smile once or anything, it&apos;s that rubbish, the characters are designed blandly and don&apos;t stand out, they are quite boring with no personality and memorable lines, even the voice acting feels phoned in and the cast sound tired along with a basic bland and forgettable animation that has nothing worth remembering from DreamWorks, also I was bored incase you couldn&apos;t tell...\n\nHowever there was a couple of things I can say positively, even though it&apos;s not funny at all, I did laugh once and I liked the nice bonding of Lucky & Spirit, that was okay, despite how basic and bland It looks, the animation is legit pretty to look at and Spirit looks good in 3D animation, so at least it&apos;s visually pleasant at best, along with decent voicing acting with Jake Gyllenhaal and Walton Goggins giving out their best performance here.\n\nBut yeah, I didn&apos;t like it, not the worst DreamWorks film but it&apos;s close, so I even need to say?, boring story, tiresome acting, forgettable animation and just dumb characters, this film might be fine for kids but boy is it boring, even with pretty animation and a okay bonding scene, it&apos;s still not a good film, far from it, almost as bad as Shark Tale, but at least it&apos;s not scary, but yeah don&apos;t waste your time on this, stick to the 2002 movie or the show if it&apos;s any good but I haven&apos;t seen it so I won&apos;t get around to watching it, but yeah definitely one of the worst DreamWorks films to date and one of the worst films of this year and one I will instantly forget quickly.\n\nSpirit: Untamed gets a 3.9/10.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 4579,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.5
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2021-07-30",
  "keywords": "horse,cgi animation,wild horse,female protagonist,brown haired girl",
  "duration": "PT1H28M",
  "actor": [
    {
      "name": "Isabela Merced",
      "url": "https://www.imdb.com/name/nm5097044/"
    },
    {
      "name": "Marsai Martin",
      "url": "https://www.imdb.com/name/nm6343162/"
    },
    {
      "name": "Mckenna Grace",
      "url": "https://www.imdb.com/name/nm5085683/"
    }
  ],
  "director": [
    {
      "name": "Elaine Bogan",
      "url": "https://www.imdb.com/name/nm4136807/"
    },
    {
      "name": "Ennio Torresan",
      "url": "https://www.imdb.com/name/nm0868871/"
    }
  ],
  "creator": [
    {
      "name": "Aury Wallington",
      "url": "https://www.imdb.com/name/nm0909233/"
    },
    {
      "name": "Kristin Hahn",
      "url": "https://www.imdb.com/name/nm0353929/"
    },
    {
      "name": "Katherine Nolfi",
      "url": "https://www.imdb.com/name/nm1868375/"
    }
  ]
}