{
  "type": "Movie",
  "name": "The Voyeurs",
  "url": "https://www.imdb.com/tt11235772/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZmQzMGE0YzEtZjNiYS00Mjg5LTgyOTctNWViZTFiZDAzYTNkXkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_.jpg",
  "description": "Pippa and Thomas move into their dream apartment, they notice that their windows look directly into the apartment opposite, this will set in motion a chain of events that will lead to disaster.",
  "review": {
    "author": "silverscreenbuff1992",
    "dateCreated": "2021-09-10",
    "inLanguage": "English",
    "heading": "I Like to Watch",
    "reviewBody": "The Voyeurs is a fantastic erotic thriller harkening back to the days where made for video titles featuring similar plots were all the rage at the local video store - so it won&apos;t come as a surprise to seasoned fans of the genre that there are multiple twists and turns along the way when a young couple, Pippa and Thomas (played by Sydney Sweeney and Justice Smith respectively), moves into an apartment and immediately discover that they have a perfect view into the sex life of their neighbours across the street. Becoming enraptured by these strangers, it becomes an unhealthy obsession for our leads, especially Pippa as the duo buy binoculars and go to extreme, and illegal, lengths to listen in on what&apos;s being said.\n\nAs with most movies of this ilk, it&apos;s best not to get dogged down by the logic or any potential plot holes - these films work due to their stylishness and eroticism and The Voyeurs features both in spades. Alongside the lovely Ms Sweeney, there&apos;s also the incredibly beautiful Natasha Liu Bordizzo as the distressed wife whose life is being spied on, plus there&apos;s plenty of nudity (both female and male) to keep everyone happy.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 28465,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "18",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2021-09-10",
  "keywords": "female voyeur,couple having sex while watching another couple have sex,voyeurism,exhibitionism,voyeur couple",
  "duration": "PT1H56M",
  "actor": [
    {
      "name": "Sydney Sweeney",
      "url": "https://www.imdb.com/name/nm2858875/"
    },
    {
      "name": "Justice Smith",
      "url": "https://www.imdb.com/name/nm6819854/"
    },
    {
      "name": "Ben Hardy",
      "url": "https://www.imdb.com/name/nm5228887/"
    }
  ],
  "director": [
    {
      "name": "Michael Mohan",
      "url": "https://www.imdb.com/name/nm2278537/"
    }
  ],
  "creator": [
    {
      "name": "Michael Mohan",
      "url": "https://www.imdb.com/name/nm2278537/"
    }
  ]
}