{
  "type": "Movie",
  "name": "The Tragedy of Macbeth",
  "url": "https://www.imdb.com/tt10095582/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMzM0YWNmMDEtNmI3Yy00NjQ4LWJlZjMtMzk2YjUxOThhZGQxXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg",
  "description": "A Scottish lord becomes convinced by a trio of witches that he will become the next King of Scotland, and his ambitious wife supports him in his plans of seizing power.",
  "review": {
    "author": "Prismark10",
    "dateCreated": "2022-01-31",
    "inLanguage": "English",
    "heading": "The Tragedy of Macbeth",
    "reviewBody": "Joel Coen brings a low key Macbeth. It is shot in black and white with minimum staging. There is some clever use of special effects and CGI.\n\nTo my mind it bears comparison with Orson Welles inexpensive version.\n\nThis is not a low budget version and it boasts heavyweights both behind and in front of the camera. Joel Coen, his wife Frances McDormand and Denzel Washington have 10 Oscars between them.\n\nDenzel Washington as Macbeth starts out as low key before being consumed by his thirst for power as he is approached by the witches. (A contorted performance by Kathryn Hunter.)\n\nTo becomes the King of Scotland, he overthrows King Duncan (Brendan Gleeson) with the full support of the scheming Lady Macbeth (Frances McDormand) who likes the idea of becoming Queen.\n\nMacbeth&apos;s corruption and paranoia invites revenge from Duncan&apos;s heir and Macduff. There is civil war in Scotland.\n\nThe text is dense but the film remains accessible. Coen has kept the play stripped down and stagebound.\n\nLady Macbeth who starts as clever and crafty becomes slowly mad to match her crazed husband.\n\nHunter shines as the witches. There are good performances from Bertie Carvel as Banquo and Alex Hassell as Ross.\n\nThere are a range of accents on offer in the movie, but very few Scottish ones.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 38704,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.1
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2021-12-26",
  "keywords": "plot,wife,murder,death,ambition",
  "duration": "PT1H45M",
  "actor": [
    {
      "name": "Denzel Washington",
      "url": "https://www.imdb.com/name/nm0000243/"
    },
    {
      "name": "Frances McDormand",
      "url": "https://www.imdb.com/name/nm0000531/"
    },
    {
      "name": "Alex Hassell",
      "url": "https://www.imdb.com/name/nm1307435/"
    }
  ],
  "director": [
    {
      "name": "Joel Coen",
      "url": "https://www.imdb.com/name/nm0001054/"
    }
  ],
  "creator": [
    {
      "name": "Joel Coen",
      "url": "https://www.imdb.com/name/nm0001054/"
    },
    {
      "name": "William Shakespeare",
      "url": "https://www.imdb.com/name/nm0000636/"
    }
  ]
}