{
  "type": "Movie",
  "name": "Over the Moon",
  "url": "https://www.imdb.com/tt7488208/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDAxMzBlZTUtNTgwNS00NjZhLWJjZmItMDBjZjhhZTM4OWQ2XkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg",
  "description": "In this animated musical, a girl builds a rocket ship and blasts off, hoping to meet a mythical moon goddess.",
  "review": {
    "author": "coreyjdenford",
    "dateCreated": "2020-10-24",
    "inLanguage": "English",
    "heading": "Flying high",
    "reviewBody": "It&apos;s quite often when an animated film comes out and they try to imitate or to simulate the same narrative aspects or the same characterisation or even the same animated standards of Disney. Sometimes it&apos;s so good it stands out, but other times the story mechanics are very familiar with Disney that it can make the film very far from being a success. Over the Moon is a charming Chinese inspired animation that&apos;s both victim to that but also different to that and thankfully sets the bar quite high in animated filmmaking. The story is very familiar a teenage girl is trying to get over the death of her mother and to do that she must embark on a journey of enlightenment to move on. We&apos;ve seen it all before, but the one thing that&apos;s different is the colours whether it&apos;s the weird and wonderful creatures walking around or the stunning picturesque views of China&apos;s landscape. It will often remind you of Spirited Away or Inside Out or other brilliantly successful animations. Granted Over the Moon may not be new when it comes to the storytelling or the pain we all experience when feeling grief but the colours alone make it a wild success and lest we forget the glorious tunes to boot which will make you cry, make you dance and make you smile. It&apos;s likely that Netflix will go to the Oscars with this but whether they&apos;ll get the prize is a different story. But it flies high past other films of 2020 and could actually be the best animated film of the year...maybe. 4/5.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 24618,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "U",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2020-10-23",
  "keywords": "girl,frog,rabbit,moon,true love",
  "duration": "PT1H35M",
  "actor": [
    {
      "name": "Glen Keane",
      "url": "https://www.imdb.com/name/nm0443855/"
    },
    {
      "name": "Brycen Hall",
      "url": "https://www.imdb.com/name/nm9964894/"
    },
    {
      "name": "Ruthie Ann Miles",
      "url": "https://www.imdb.com/name/nm4597798/"
    }
  ],
  "director": [
    {
      "name": "Glen Keane",
      "url": "https://www.imdb.com/name/nm0443855/"
    },
    {
      "name": "John Kahrs",
      "url": "https://www.imdb.com/name/nm0434969/"
    }
  ],
  "creator": [
    {
      "name": "Audrey Wells",
      "url": "https://www.imdb.com/name/nm0920108/"
    },
    {
      "name": "Jennifer Yee McDevitt",
      "url": "https://www.imdb.com/name/nm2364904/"
    },
    {
      "name": "Alice Wu",
      "url": "https://www.imdb.com/name/nm1226108/"
    }
  ]
}