{
  "type": "Movie",
  "name": "The Half of It",
  "url": "https://www.imdb.com/tt9683478/",
  "poster": "https://m.media-amazon.com/images/M/MV5BY2RlZmZkOTUtMDI5Ni00ZjZmLWI1OTItZmUwNWE4ZWVjNzFiXkEyXkFqcGdeQXVyMTkzODUwNzk@._V1_.jpg",
  "description": "When smart but cash-strapped teen Ellie Chu agrees to write a love letter for a jock, she doesn&apos;t expect to become his friend - or fall for his crush.",
  "review": {
    "author": "richard-1787",
    "dateCreated": "2020-05-04",
    "inLanguage": "English",
    "heading": "An enjoyable and interesting film, with an intelligent script, but it runs too long",
    "reviewBody": "There are lots of things to like in this riff on Cyrano de Bergerac.\n\nOften, it is the new material, the things that differentiate it from Cyrano&apos;s plot line, that I found the most interesting. Such as Paul&apos;s doubts about his ability to love someone in an intelligent way. Christian, in Rostand&apos;s masterpiece, recognizes that he can&apos;t speak intelligently to women, but he never doubts his mind or the value of his love for Roxane. Paul in one moving scene doubts the validity of his romantic feelings for Aster because he thinks he&apos;s too dumb to really love well. That&apos;s a very sad moment, and something no man or woman should ever feel.\n\nThe same-sex themes that run through this movie are, in principle, not in Rostand&apos;s original, but they&apos;re certainly not foreign to it either. When Cyrano first proposes to Christian that they work together to win Roxane&apos;s love, it&apos;s hard not to suspect that Cyrano also has some sort of interest in Christian as well, though he may be unaware of it.\n\nThe performances of the three main roles here are good. I found Daniel Diemer particularly good as the Christian whose mind has not been developed, but who does indeed develop some in the course of the movie. His role could have been a two-dimensional caricature like the fireman Christian in the movie *Roxane*, but Diemer - and Alice Wu&apos;s script - make it more nuanced than that. Leah Lewis is also very good as the female Cyrano who, unlike the male original, comes to a realization of her feelings for the Roxane only once she starts to help Paul/Christian express his.\n\nThere are definitely weak parts to this movie. Trig&apos;s character is over-the-top stereotype/caricature,as are most of the rest of the townfolk. His more or less equivalent in the play, de Guiche, is more interesting for being more complex. Similarly, the way Ellie wins over her sadly xenophobic classmates with an unexceptional performance of an unexceptional song is too fast and complete to be convincing. The turnarounds at the end of the movie, especially Paul&apos;s with regard to his own homophobia, also happen too fast and too neatly. They could have been motivated earlier in the movie had they been thought out more. While the script, pace some of the previous reviewers, is generally very intelligent, it is lacking in that respect. It takes too long to work things out, and then the resolution of the conflicts happens too quickly.\n\nIt might also have helped if we had seen why Aster allowed herself to be claimed by Trig. That didn&apos;t seem convincing to me either.\n\nStill, for only the second movie by the writer-director, Alice Wu, she got a lot right, and sometimes very impressively so.\n\nThis is definitely a movie to be watched at home, in my opinion. I can&apos;t see most audiences sitting through it in a theater. But watched at home, with perhaps one break to get a snack, it is an interesting and original riff on Rostand&apos;s great masterpiece.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 42482,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.9
  },
  "contentRating": "12",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2020-05-01",
  "keywords": "lesbian,lesbian attracted to a straight woman,lesbian teen,lesbian character,single father",
  "duration": "PT1H44M",
  "actor": [
    {
      "name": "Leah Lewis",
      "url": "https://www.imdb.com/name/nm2301427/"
    },
    {
      "name": "Daniel Diemer",
      "url": "https://www.imdb.com/name/nm8159701/"
    },
    {
      "name": "Alexxis Lemire",
      "url": "https://www.imdb.com/name/nm8467055/"
    }
  ],
  "director": [
    {
      "name": "Alice Wu",
      "url": "https://www.imdb.com/name/nm1226108/"
    }
  ],
  "creator": [
    {
      "name": "Alice Wu",
      "url": "https://www.imdb.com/name/nm1226108/"
    }
  ]
}