

{
  "type": "Movie",
  "name": "Independence Day: Resurgence",
  "url": "https://www.imdb.com/tt1628841/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjIyMTg5MTg4OV5BMl5BanBnXkFtZTgwMzkzMjY5NzE@._V1_.jpg",
  "description": "Two decades after the first Independence Day invasion, Earth is faced with a new extra-Solar threat. But will mankind's new space defenses be enough?",
  "review": {
    "author": "tjgoalie13",
    "dateCreated": "2016-06-25",
    "inLanguage": "English",
    "heading": "Ultra Dumb and Generic",
    "reviewBody": "Independence Day: Resurgence is here, and it would seem with the direction they went that Independence Day may have been better if it hadn't had a sequel. The original film was admittedly dumb, and considering Roland Emmerich's filmography I didn't go in expecting this film to be thought provoking, but Independence Day: Resurgence lacks the impactful moments the first one had. Independence Day: Resurgence is full of clichés, features weak characters, and lacks the iconic moments of the original. It is sad to say but given the filmography of Roland Emmerich, the fact that this movie isn't very good isn't a surprise.\\n\\nThe original Independence Day wasn't very original, but it found a way to surpass it's generic approach with entertaining acting and storytelling. However, Independence Day: Resurgence loses some of that charm, and ends up being even more generic. The story takes a radical departure from the realistic approach of the first one, and puts the audience in a super technologically advanced earth. The film is also hurt by the lack of charismatic leads, who have been replaced by young more dull actors.\\n\\nThe problem is partially that the actors aren't all that good, whether that's a lack of direction or a lack of ability is up for debate. That being said the actors are only part of the problem, as even if they were great the characters are one dimensional. Another major problem is that the original film was a perfect example of dumb fun, where it was funny and frankly dumb, the sequel is just as dumb, if not more and half as funny. The end result is when a major character dies or anything happens in this film it's hard to care.\\n\\nThe lack of care for major moments resonates as the ultimate disappointment of Independence Day: Resurgence. Even if you hate Independence Day you can't deny that when Bill Pullman delivers his speech, everybody watching gets a little emotional, and there are various other moments from that film that resonate. There are next to none of these moments in Independence Day: Resurgence. In the end Independence Day: Resurgence is boring because it's not emotionally gripping, and just trugs along.\\n\\nIndependence Day: Resurgence is in essence a sequel made purely for the profit, that departs from what made the first film so special. The sequel is inferior to the original in most aspects, and in some areas doesn't even feel like a sequel to Independence Day. The characters are one dimensional, the story is generic and clichéd, the dialogue is weak, the film is incredibly dumb, but admittedly the special effects are amazing. In the end if you like action and want a release where you can go and just shut your brain off, then this is for you, otherwise you may be disappointed.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 187817,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.2
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2016-06-23",
  "keywords": "alien,alien invasion,mothership,independence day,human versus alien",
  "duration": "PT2H",
  "actor": [
    {
      "name": "Liam Hemsworth",
      "url": "https://www.imdb.com/name/nm2955013/"
    },
    {
      "name": "Jeff Goldblum",
      "url": "https://www.imdb.com/name/nm0000156/"
    },
    {
      "name": "Bill Pullman",
      "url": "https://www.imdb.com/name/nm0000597/"
    }
  ],
  "director": [
    {
      "name": "Roland Emmerich",
      "url": "https://www.imdb.com/name/nm0000386/"
    }
  ],
  "creator": [
    {
      "name": "Nicolas Wright",
      "url": "https://www.imdb.com/name/nm1288961/"
    },
    {
      "name": "James A. Woods",
      "url": "https://www.imdb.com/name/nm1123994/"
    },
    {
      "name": "Dean Devlin",
      "url": "https://www.imdb.com/name/nm0002041/"
    }
  ]
}