

{
  "type": "Movie",
  "name": "Keeping Up with the Joneses",
  "url": "https://www.imdb.com/tt2387499/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDU2OTU1NzE2Ml5BMl5BanBnXkFtZTgwMDQzMzgwMDI@._V1_.jpg",
  "description": "A suburban couple becomes embroiled in an international espionage plot when they discover that their seemingly perfect new neighbors are government spies.",
  "review": {
    "author": "ayoreinf",
    "dateCreated": "2016-10-20",
    "inLanguage": "English",
    "heading": "Another silly spy spoof saved by solid acting performances",
    "reviewBody": "I've got a thing for spy comedies, I've seen most of the recent ones and many of the older ones. It's a genre so based on plot twists that most of them can be seen a mile away, especially if you've already seen some. This one is no different. No real plot twist is really surprising, including the final joke. And still, I had loads of fun watching it, because most of the jokes are actually character driven, and the characters are very well written, and well performed by most. That is, Isla Fisher, Zach Galifianakis and Jon Hamm, are practically super. Gal Gadot got the warrior woman with the menacing looks nailed to the teeth, but is a bit less convincing when she has to be sensitive or subtle. It doesn't happen often during the movie, so it's not a big issue, but there are a few moments in which she's off character. But everybody else around does such a good job, the jokes work, and the pace is fast enough for us not to care it's not so very surprising. \n\nI liked it, most of the people around me in the cinema liked it too. If you don't expect a masterpiece, just plain simple fun - you'll find it here.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 67804,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "contentRating": "12A",
  "genre": [
    "Action",
    "Comedy"
  ],
  "datePublished": "2016-10-21",
  "keywords": "neighbor,spy,jumping out a window,jumping into a pool,house explosion",
  "duration": "PT1H45M",
  "actor": [
    {
      "name": "Zach Galifianakis",
      "url": "https://www.imdb.com/name/nm0302108/"
    },
    {
      "name": "Isla Fisher",
      "url": "https://www.imdb.com/name/nm0279545/"
    },
    {
      "name": "Jon Hamm",
      "url": "https://www.imdb.com/name/nm0358316/"
    }
  ],
  "director": [
    {
      "name": "Greg Mottola",
      "url": "https://www.imdb.com/name/nm0609549/"
    }
  ],
  "creator": [
    {
      "name": "Michael LeSieur",
      "url": "https://www.imdb.com/name/nm1942829/"
    }
  ]
}