

{
  "type": "Movie",
  "name": "Me Before You",
  "url": "https://www.imdb.com/tt2674426/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2NjE4NDE2NV5BMl5BanBnXkFtZTgwOTcwNDE5NzE@._V1_.jpg",
  "description": null,
  "review": {
    "author": "jbam_46",
    "dateCreated": "2016-06-01",
    "inLanguage": "English",
    "heading": "It was a pretty cute",
    "reviewBody": "Felt very derivative of Intouchables I did however really enjoy the romance that was in this film.\\n\\nEmilia Clark has the most expressive face I have ever seen on camera.\\n\\nWatch her eyebrows! That's all I have to say. You could almost watch this entire movie just staring at her eyebrows I had a hard time not doing that.\\n\\nI really enjoyed her character. She is a silly, eccentric, perpetually happy girl. With a pretty eclectic sense of style.\\n\\nEmilia Clarke was perfectly cast for this role.\\n\\nShe ventures far from her intense power house character the Mother of Dragons from Game of Thrones.\\n\\nAt times it was hard to tell if Emilia Clarke the actress is just extremely expressive with her face, or if it was something she was doing for the role which I suppose speaks to how well she did.\\n\\nBecause I'm thinking she was exaggerating it, therefore she played the part marvellously.\\n\\nThe male lead is Sam Claflin, who you will more than likely recognize but not be able to place. His largest role as of late is the water proficient fighter from the Hunger Games.\\n\\nI also feel he played the part very well. No complaints, He has a great smile, or smirk, that he does through out, which allows us to empathize with him a little more when he seeming unlikable.\\n\\nThere are a lot of light moments, actually the whole movie has a very light tone to it it's a serious topic, but with Clarke's character it's hard for anything to be too serious or solemn. There are those sombre moments, which is, I'm sure, why I was given a tissue box at the advance screening.\\n\\nThere were only a few editing aspects I didn't enjoy. There were far too many cuts in certain scenes Emilia walking up to the mansion for the first time and her conversation on the bench with her boyfriend. They were distracting. This was sprinkled throughout the film to greater or lesser degrees.\\n\\nI think the film looked pretty, great locations. And a wonderful set, really. The house Claflin's character lives in looks very nice. I loved all the walls that opened when pushed on. Very modern, and expensive I'm sure.\\n\\nThere is a little treat for any Harry Potter fans! Neville Longbottom, all grown up and looking fit, he plays the part of Emilia Clarke's boyfriend. I hope to see him in more roles, maybe even a lead one day.\\n\\nAs for family friendliness, this movie is a G, it is good to go. In the opening scene Claflin is presumably being intimate with his girlfriend, they are obviously naked, but nothing is shown, they are under sheets.\\n\\nThere is no cursing or obscenities in this movie worth mentioning.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 283402,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.4
  },
  "contentRating": "12A",
  "genre": [
    "Drama",
    "Romance"
  ],
  "datePublished": "2016-06-03",
  "keywords": "euthanasia,assisted suicide,accident,unemployment,extreme wealth",
  "duration": "PT1H50M",
  "actor": [
    {
      "name": "Emilia Clarke",
      "url": "https://www.imdb.com/name/nm3592338/"
    },
    {
      "name": "Sam Claflin",
      "url": "https://www.imdb.com/name/nm3510471/"
    },
    {
      "name": "Janet McTeer",
      "url": "https://www.imdb.com/name/nm0005216/"
    }
  ],
  "director": [
    {
      "name": "Thea Sharrock",
      "url": "https://www.imdb.com/name/nm4824763/"
    }
  ],
  "creator": [
    {
      "name": "Jojo Moyes",
      "url": "https://www.imdb.com/name/nm4424713/"
    }
  ]
}