

{
  "type": "Movie",
  "name": "Halloween",
  "url": "https://www.imdb.com/tt0077651/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzk1OGU2NmMtNTdhZC00NjdlLWE5YTMtZTQ0MGExZTQzOGQyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "Fifteen years after murdering his sister on Halloween night 1963, Michael Myers escapes from a mental hospital and returns to the small town of Haddonfield, Illinois to kill again.",
  "review": {
    "author": "TheMgnt",
    "dateCreated": "1998-08-04",
    "inLanguage": "English",
    "heading": "It *is* a classic",
    "reviewBody": "To begin, this is a twenty year old film. Few films remain as suspenseful today as they did when it came out. (see: Night of the Living Dead -- had people running from the theatres when released but is very tame today). Clearly a movie fan brought up on the standards of today's movies will fail to find enjoyment of such 'classic' films. But when watching Halloween today perhaps it helps to consider a few things: Halloween was a low budget film (read: bad acting, poor special effects) made for only $300,000. It was not a product of Hollywood but a bunch of 20 year olds. This was the first film to feature the Boogeyman that Wouldn't Die which has been ripped off time and time again in the Friday the 13th, Elm Street, Scream, etc. You're used to it now, but Halloween did it first. Even Scream ripped off the look of the villian in Halloween. The theme of teenagers being stalked by a madman has been ripped of numerous times as well (again, Halloween did it first) but what seperates Halloween from the imitators is that it plays on traditional fears: The Thing that Wouldn't Die; the Boogeyman coming to get you; being followed and stalked; the boyfriend returning to the room under a bedsheet -- and it's not really him; someone hiding in the car... all things that have made our skin crawl in real life at one time or another. Watching Halloween tonight again for the first time in years I found myself again on the edge of my seat. Classic? Hell, yes. Maybe not to a generation who feels Scream was a 'good' horror movie but a classic none the less.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 304637,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.7
  },
  "contentRating": "X",
  "genre": [
    "Horror",
    "Thriller"
  ],
  "datePublished": "1979-01-25",
  "keywords": "halloween,babysitting,year 1978,stabbed to death,homicidal maniac",
  "duration": "PT1H31M",
  "actor": [
    {
      "name": "Donald Pleasence",
      "url": "https://www.imdb.com/name/nm0000587/"
    },
    {
      "name": "Jamie Lee Curtis",
      "url": "https://www.imdb.com/name/nm0000130/"
    },
    {
      "name": "Tony Moran",
      "url": "https://www.imdb.com/name/nm0602985/"
    }
  ],
  "director": [
    {
      "name": "John Carpenter",
      "url": "https://www.imdb.com/name/nm0000118/"
    }
  ],
  "creator": [
    {
      "name": "John Carpenter",
      "url": "https://www.imdb.com/name/nm0000118/"
    },
    {
      "name": "Debra Hill",
      "url": "https://www.imdb.com/name/nm0384185/"
    }
  ]
}