

{
  "type": "Movie",
  "name": "I Know Who Killed Me",
  "url": "https://www.imdb.com/tt0897361/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQzZDA4MzMtNWIwOS00YzgxLWEyZjItZTNjYzM3NzBjNTBkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "A young woman who was missing reappears, but she claims to be someone else entirely.",
  "datePublished": "2007-07-27",
  "contentRating": "18",
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "duration": "PT1H46M",
  "keywords": "stripper,psychopathic killer,psycho killer,evil,first person title",
  "rating": {
    "ratingCount": 30799,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.6
  },
  "review": {
    "author": "Mark-129",
    "dateCreated": "2007-07-29",
    "inLanguage": "English",
    "heading": "I'm so sorry I went",
    "reviewBody": "Look, I have a strong stomach, but I have no use for Torture Porn in my entertainment. A few weeks ago, I saw a preview of this film that gave no indication of it's true nature. This, plus the intriguing poster led me to believe this was going to be a brooding drama in the Hitchcock tradition. Instead, I found myself watching the ugliest, most disgusting film I have ever attended of my own free will. I should have guessed when the cashier gave me a funny look while getting my ticket.\\n\\nThe first thing I realized was the script was by an amateur. The scenes and dialog jumping around with no thought or subtlety. Like other reviewers, I knew who the torturing villain was within the first few minutes. But, I still had to sit through several scenes of dismemberment and pain, which made me sick. Sick that I had spent money to watch this disaster.\\n\\nI can't imagine why Lindsay Lohan would agree to be in this production. There are other venues to stretch her acting talents. Neal McDonough and Julia Ormond's rent must have been due.\\n\\nThe story, such as it is has at it's core an interesting premise. A top director might have made a respectable film out of it with a total rewrite, without the gore and more atmosphere.\\n\\nThis movie is an absolute, total disaster. No one involved has anything to be proud of.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 1
    }
  },
  "actor": [
    {
      "name": "Lindsay Lohan",
      "url": "https://www.imdb.com/name/nm0517820/"
    },
    {
      "name": "Julia Ormond",
      "url": "https://www.imdb.com/name/nm0000566/"
    },
    {
      "name": "Neal McDonough",
      "url": "https://www.imdb.com/name/nm0568180/"
    }
  ],
  "director": [
    {
      "name": "Chris Sivertson",
      "url": "https://www.imdb.com/name/nm1032754/"
    }
  ],
  "creator": [
    {
      "name": "Jeff Hammond",
      "url": "https://www.imdb.com/name/nm2449810/"
    }
  ]
}