

{
  "type": "Movie",
  "name": "I'm Not There",
  "url": "https://www.imdb.com/tt0368794/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTY4MzM2MjcwNV5BMl5BanBnXkFtZTcwODg3MDU1MQ@@._V1_.jpg",
  "description": "Ruminations on the life of Bob Dylan, where six characters embody a different aspect of the musician's life and work.",
  "contentRating": "15",
  "genre": [
    "Biography",
    "Drama",
    "Music"
  ],
  "datePublished": "2007-12-21",
  "keywords": "voyeur,female voyeur,voyeurism,bob dylan character,actor",
  "duration": "PT2H15M",
  "rating": {
    "ratingCount": 60923,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "review": {
    "author": "randyhndrsn",
    "dateCreated": "2008-01-03",
    "inLanguage": "English",
    "heading": "This movie is good but in a weird way.",
    "reviewBody": "I recently watched I'm not there and this movie isn't done in a way that really makes sense sometimes or flows, but after the first 10 minutes you really understand what is happening.This movie has differen't stories from differen't characters that come in and differen't times, and they all have something to do with bob Dylan's life.I thought the movie was gonna show one story at a time, but they show one for like 5 minutes then another one and comeback to it later and sometimes only show a clip for it for a few seconds.This is done in a very art-house style and is for fans of the genre, it isn't abstract crap like some movies but actually has some great scenes that are visually wonderful.Some scenes play like Fellini's 81/2 and this movie feels like a foreign film a lot of the time but the characters speak English.This movie is far from perfect for my taste and I am not a huge Dylan fan but I respect him a lot, the movie pretty much does a good job at pulling you into it and you go for a ride.It's well made and the acting is good all around, don't watch the movie if you don't like art type films or movies that focus on characters and out of place scenes that are put there for a visual purpose.It's a cool flick and I think a lot of people can respect it, it's nice to see something original and not in some movie formula like a lot of Hollywood blockbusters we get these days.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "actor": [
    {
      "name": "Christian Bale",
      "url": "https://www.imdb.com/name/nm0000288/"
    },
    {
      "name": "Cate Blanchett",
      "url": "https://www.imdb.com/name/nm0000949/"
    },
    {
      "name": "Heath Ledger",
      "url": "https://www.imdb.com/name/nm0005132/"
    }
  ],
  "director": [
    {
      "name": "Todd Haynes",
      "url": "https://www.imdb.com/name/nm0001331/"
    }
  ],
  "creator": [
    {
      "name": "Todd Haynes",
      "url": "https://www.imdb.com/name/nm0001331/"
    },
    {
      "name": "Oren Moverman",
      "url": "https://www.imdb.com/name/nm0610219/"
    }
  ]
}