

{
  "type": "Movie",
  "name": "Sarah Landon and the Paranormal Hour",
  "url": "https://www.imdb.com/tt0990376/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTkwNzQ5MDM5N15BMl5BanBnXkFtZTcwMjI5OTQ1MQ@@._V1_.jpg",
  "description": "A 17-year-old girl has mysterious encounters with paranormal activity in the small town of Pine Valley.",
  "review": {
    "author": "LovecraftLass",
    "dateCreated": "2017-11-13",
    "inLanguage": "English",
    "heading": "Perfect for the Tweens",
    "reviewBody": "I'll lay out the plot of Sarah Landon and the Paranormal Hour (quite the title, huh?) real quick since none of the synopses I've found make it very clear. Don't worry, there won't be any spoilers as most of what I'm going to say is shown in the first ten minutes or so:\n\nSarah Landon has recently lost her best friend in a car accident caused by a drunk driver. When she's invited to spend the weekend with her friend's grandmother, she goes. On the way into town her car breaks down mysteriously so she ends up staying a little longer than planned. The mechanic has his assistant give her a ride to the grandmother's house but before she goes the mechanic tells her all about Matt's family. Apparently Matt and David's mother got in a car accident with her nephew, Johnny, town sports star and all around great guy. His dad was not so nice of a guy. He was always bragging about his son and when the crash happened he blamed his sister for Johnny's death and threatened to kill her son when David reaches the age his son was when the crash happened, 21. He was found dead, the day of his son's funeral. Afterwards his ghost torments Matt and David's mother, driving her insane. Their father, being the charming man he is, left his sons with an almost catatonic mother. David withdraws into himself, searching for a way to evade the curse. So that's the story Sarah jumps into.\n\nThe writing could be a bit better. A lot of the exposition is clunky and I honestly thought that it was partly adapted from a book. It was supposed to be the start of a series and I think if they had kept it as a video release it would have fared better. I'm a little disappointed it didn't, to be honest. However, the exposition cuts down on some of the moments that may be more intense for younger viewers. The acting is a bit awkward at times and you can definitely tell that the actors are not pros. I can hear you now...why give the movie a three? Because it's a cute, engaging story that is actually pretty coherent and follows its own logic well. The movie moves a bit slowly in the beginning due to all of the flashbacks and exposition but after that it moves at a fairly even pace. I think most of the low ratings come from adults viewing it with adult eyes. Most of the kids that have watched it (that I know of) have enjoyed it.\n\nThe cinematography in Sarah Landon and the Paranormal Hour isn't stunning but, again, it's adequate. It's not grainy, jerky or choppily edited. In fact, the editing is actually pretty good. There are no unnecessary scenes and they go together in a coherent, well-progressed manner. The few effects seemed to be mostly practical. Not surprising for a lower budget movie. They stick to what is easily done but it's also realistic within the frame of the movie. The ghostly effects are probably CGI (or a reasonable facsimile) but they didn't get too ambitious and make it look goofy.\n\nThe character of Sarah Landon is played to what I believe is the best of Rissa Walters' ability (and it was refreshing to see a girl who is pretty but not unrealistically so). The characters of the brothers are played by actual brothers and they bring what they have to the table too. They may not be pros but they give it their best and that counts for something. The story, despite the grim sounding outline above, is perfectly suitable for younger kids. I would put the age range between 7 or 8 - 13. To be honest, I still watch it from time to time, myself. I first watched it with my son when he was around 10 and he loved it. It had just the right amount of spookiness and creepiness for a younger audience. There might be one minor swear (I believe it's damn or hell). The romance angle (and you will rarely hear me say this) was cute and pretty believable. It wasn't insta-love or insta-lust, it was a date. There was no sucking of faces or pawing which will especially make it suitable for younger viewers.\n\nSo if you want a spooky story and don't mind acting ability that is more serviceable than outstanding, Sarah Landon and the Paranormal Hour is a great choice for those young ones that are in the in-betweens.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 725,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.8
  },
  "contentRating": "PG",
  "genre": [
    "Action",
    "Adventure",
    "Family"
  ],
  "datePublished": "2007-10-19",
  "keywords": "girl,town,character name in title",
  "duration": "PT1H21M",
  "actor": [
    {
      "name": "Rissa Walters",
      "url": "https://www.imdb.com/name/nm2595312/"
    },
    {
      "name": "Brian Comrie",
      "url": "https://www.imdb.com/name/nm2593877/"
    },
    {
      "name": "Dan Comrie",
      "url": "https://www.imdb.com/name/nm2595036/"
    }
  ],
  "director": [
    {
      "name": "Lisa Comrie",
      "url": "https://www.imdb.com/name/nm2593656/"
    }
  ],
  "creator": [
    {
      "name": "John Comrie",
      "url": "https://www.imdb.com/name/nm1219298/"
    },
    {
      "name": "Lisa Comrie",
      "url": "https://www.imdb.com/name/nm2593656/"
    }
  ]
}