

{
  "type": "Movie",
  "name": "Aqua Teen Hunger Force Colon Movie Film for Theaters",
  "url": "https://www.imdb.com/tt0455326/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc0OTQwNzYyNF5BMl5BanBnXkFtZTcwMDc5NTM0MQ@@._V1_.jpg",
  "description": "An action epic that explores the origins of Master Shake, Frylock, and Meatwad, better known as the Aqua Teen Hunger Force, who somehow become pitted in a battle over an immortal piece of exercise equipment.",
  "review": {
    "author": "DannyD1997",
    "dateCreated": "2020-05-09",
    "inLanguage": "English",
    "heading": "A mediocre movie based on an otherwise great show.",
    "reviewBody": "Don&apos;t get me wrong, I love Aqua Teen Hunger Force. It&apos;s one of my favorite Adult Swim cartoons. However, in all honesty, I don&apos;t like the movie as much. I was kind of disappointed by the movie. It&apos;s just nothing but a feature length episode of the TV show instead of a project that can stand on its own. I don&apos;t think the movie is bad either. What I do like about the movie is that it stays true to the original series it was adapted from. I like how it was the second time Cartoon Network had involvement with a theatrical feature film after the Powerpuff Girls Movie. The voice acting is pretty good, the animation is decent, some of the jokes did make me laugh, the soundtrack is pretty cool, the art is nice, introduction to Chicken Bittle, and I like how it&apos;s the first time Adult Swim had involvements with a theatrical feature film. What I don&apos;t like about the movie is that it acted way too much like the show it was based on. The characters are not as memorable as from the show, the writing is weak and offers nothing, most of the humor is stretched out and didn&apos;t make that much sense, how the ending just felt contradicting, how they sometimes almost censor the f word, judging by the fact that the movie is Rated R, how the story is on and off, and worst of all, how the movie was promoted with the infamous Boston Bomb Scare that ruined Cartoon Network in 2007.\\n\\nThey could&apos;ve done so much more with this movie. You shouldn&apos;t try to copy Disney, yes, you should be your own thing, but Movie Film for Theaters just felt weak. It&apos;s honestly not as fun to watch as movies like Beavis and Butt-Head Do America, South Park: Bigger, Longer and Uncut, or even the Simpsons Movie. Then again, it&apos;s not the worst movie I have ever seen.\\n\\nI understand that there are fans of the show that enjoy the movie, and there&apos;s nothing wrong with that. I just believe Aqua Teen Hunger Force works better in 10 minute shorts rather than a feature film.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 14451,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "15",
  "genre": [
    "Animation",
    "Action",
    "Adventure"
  ],
  "datePublished": "2007-04-13",
  "keywords": "midnight movie,adult animation,adult swim,comic relief,mature animation",
  "duration": "PT1H26M",
  "actor": [
    {
      "name": "Dana Snyder",
      "url": "https://www.imdb.com/name/nm1075468/"
    },
    {
      "name": "Dave Willis",
      "url": "https://www.imdb.com/name/nm0932302/"
    },
    {
      "name": "Carey Means",
      "url": "https://www.imdb.com/name/nm1052894/"
    }
  ],
  "director": [
    {
      "name": "Matt Maiellaro",
      "url": "https://www.imdb.com/name/nm0537410/"
    },
    {
      "name": "Dave Willis",
      "url": "https://www.imdb.com/name/nm0932302/"
    }
  ],
  "creator": [
    {
      "name": "Matt Maiellaro",
      "url": "https://www.imdb.com/name/nm0537410/"
    },
    {
      "name": "Dave Willis",
      "url": "https://www.imdb.com/name/nm0932302/"
    }
  ]
}