

{
  "type": "Movie",
  "name": "Jindabyne",
  "url": "https://www.imdb.com/tt0382765/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTk2OTM1MjE1OF5BMl5BanBnXkFtZTcwODgzNTM0MQ@@._V1_.jpg",
  "description": "After four men on a fishing trip discover a dead body in the water, they choose to delay reporting it and continue fishing.",
  "review": {
    "author": "Gordon-11",
    "dateCreated": "2007-03-31",
    "inLanguage": "English",
    "heading": "Complex interaction of different personalities when morality is questioned",
    "reviewBody": "This film is about a group of 4 men who discovers a dead body during a fishing trip. They continue fishing instead of reporting it to the police. This sparks outrage in the village, and the 4 men have to deal with the aftermath.\\n\\nThe character development is excellent. Each character is unique and different. Laura Linney deals with the tragedy by doing good deeds to redeem herself, while Gabriel Byrne deals with it by denial. The little girl, with an unfortunately unusual name, is provocatively antisocial. Billy is the histrionic one. Each character is different from another, and the interaction of them in the film is portrayed beautifully and convincingly in the film.\\n\\nLaura Linney does the best job in the film. She is so convincing in her genuine attempt to redeem her husband's wrongdoings. The frustration that results from her husband's denial is painfully portrayed. The scene where she throws the vase at the ground is also a memorable display of emotion.\\n\\nA comment says the film is dull. I am afraid I do not agree. This film is about the portrayal of different personalities when morality is in danger. The characters are so intriguing and complex, that just this alone makes viewing worthwhile.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 7055,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "15",
  "genre": [
    "Crime",
    "Drama",
    "Mystery"
  ],
  "datePublished": "2007-05-25",
  "keywords": "fishing trip,aborigine,murder,dead body,dead body in water",
  "duration": "PT2H3M",
  "actor": [
    {
      "name": "Laura Linney",
      "url": "https://www.imdb.com/name/nm0001473/"
    },
    {
      "name": "Gabriel Byrne",
      "url": "https://www.imdb.com/name/nm0000321/"
    },
    {
      "name": "John Howard",
      "url": "https://www.imdb.com/name/nm0397398/"
    }
  ],
  "director": [
    {
      "name": "Ray Lawrence",
      "url": "https://www.imdb.com/name/nm0492979/"
    }
  ],
  "creator": [
    {
      "name": "Beatrix Christian",
      "url": "https://www.imdb.com/name/nm1472231/"
    },
    {
      "name": "Raymond Carver",
      "url": "https://www.imdb.com/name/nm0142577/"
    }
  ]
}