

{
  "type": "Movie",
  "name": "Redline",
  "url": "https://www.imdb.com/tt1483797/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMDQ4MzU1NjUtOGE5Mi00MTIyLTk2NjItMGIyM2RiZDNmMDU0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
  "description": "A story about the most popular racing event in the galaxy, the Redline, and the various racers who compete in it.",
  "datePublished": "2010-10-09",
  "contentRating": "15",
  "genre": [
    "Animation",
    "Action",
    "Sci-Fi"
  ],
  "duration": "PT1H42M",
  "keywords": "younger version of character, nudity, female topless nudity, childhood crush, biopunk",
  "rating": {
    "ratingCount": 16917,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.5
  },
  "review": {
    "author": "Apex_P38",
    "dateCreated": "2011-08-29",
    "inLanguage": "English",
    "heading": "Take the Redline ride!",
    "reviewBody": "Redline is an anime movie directed by Takeshi Koike and written by Katsuhito Ishii. Originally Redline is a spin off anime of Trava: Fist Planet (2003) and although the characters from Trava: Fist Planet are in it briefly, this is a story that conceptually was developed from Trava: Fist Planet into a full length movie.\\n\\nRedline itself is a story about a race driver JP who is in driving under influence of some Yakuza/Mafia types. Although, JP is an excellent and exciting driver he just does what he&apos;s told. When he finds out he qualified for The Redline competition he&apos;s up and about and this time ready to race the way he wants no matter the consequences. However, the Redline race is unlike any other race and is hosted in a hostile war-like environment that can get you killed just for participating. Prior to the Redline race JP meets female driver Sonoshee. Though they do hit it off right away, they slowly come to realize they have met before.\\n\\nRedline takes you on an exciting ride that is visually stunning filled with hilarious animated characters. In the whole movie there is just one scene with some brief nudity but nothing that is shown in a sexual or perverted context. Personally, I would have liked them to have followed Trava&apos;s quest and competition in the Fist Planet Competition and maybe once again have a run in with Princess Mikuru, or even just have seen more of them in Redline which you do not see a whole lot of. Still Redline in itself is a cool anime movie and stands out by itself.\\n\\nYou do not have to see Trava: Fist Planet before watching Redline, but it wouldn&apos;t hurt to see it. I do recommend Trava: Fist Planet if you&apos;re into funny action packed anime with some nice trippy undertones and cool looking visuals. Redline is awesome! Check it out!",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "actor": [
    {
      "name": "Takuya Kimura",
      "url": "https://www.imdb.com/name/nm0454120/"
    },
    {
      "name": "Y\\u00fb Aoi",
      "url": "https://www.imdb.com/name/nm1066974/"
    },
    {
      "name": "Tadanobu Asano",
      "url": "https://www.imdb.com/name/nm0038355/"
    }
  ],
  "director": [
    {
      "name": "Takeshi Koike",
      "url": "https://www.imdb.com/name/nm1238086/"
    }
  ],
  "creator": [
    {
      "name": "Katsuhito Ishii",
      "url": "https://www.imdb.com/name/nm0411002/"
    },
    {
      "name": "Y\\u00f4ji Enokido",
      "url": "https://www.imdb.com/name/nm0257939/"
    },
    {
      "name": "Yoshiki Sakurai",
      "url": "https://www.imdb.com/name/nm1371924/"
    }
  ]
}