

{
  "type": "Movie",
  "name": "Napapiirin sankarit",
  "url": "https://www.imdb.com/tt1454505/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDQ1NDQ4MjM2MF5BMl5BanBnXkFtZTcwNTM3Mjg5OA@@._V1_.jpg",
  "description": "Janne has made a career out of living on welfare; suddenly, his girlfriend gives him an ultimatum: Buy a new digital TV box or she will leave him.",
  "datePublished": "2010-10-15",
  "contentRating": "Not Rated",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "duration": "PT1H32M",
  "keywords": "male friendship, male nudity, male pubic hair, suicide by hanging, snowstorm",
  "rating": {
    "ratingCount": 6519,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "review": {
    "author": "ernesti",
    "dateCreated": "2013-01-01",
    "inLanguage": "English",
    "heading": "A dull farce comedy packed with usual Finnish clichés",
    "reviewBody": "Napapiirin sankarit is an overly hyped Finnish movie that was said to portray a life of Finnish men. Well firstly the main characters in this film are hollow caricatures of the group of people they portray. They are nothing but stupid and live on welfare. That just seems boring and offensive enough and just every aspect of the plot is made clear in the beginning. I only found myself smiling a few times but that doesn't really make a good comedy because the film itself was dragging all the way.\n\nIt felt like the film lacked many elements that make it watchable and smooth. Firstly the characters weren't all that interesting, they just were plain stupid. Now that isn't enough for a viewer to actually care about them. Secondly the plot seriously needed more depth to it to make it last for the 90 minutes. Thirdly it seems like the script was written in a day as it isn't that complex. Fourthly the old and used clichés should have been avoided because this film is just full of them.\n\nLastly, all Finnish movies need some Russian character to misbehave or just remind of the second world war. It's amazing how many clichés can be packed in just one movie.\n\nOf course i understand that in farce comedies everything seems to go wrong but at least it should be funny. I don't know that would i actually need a mindset of a woman to actually find the overall silliness of the men really funny.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "actor": [
    {
      "name": "Pamela Tola",
      "url": "https://www.imdb.com/name/nm1533235/"
    },
    {
      "name": "Jussi Vatanen",
      "url": "https://www.imdb.com/name/nm1948103/"
    },
    {
      "name": "Jasper Pääkkönen",
      "url": "https://www.imdb.com/name/nm0701747/"
    }
  ],
  "director": [
    {
      "name": "Dome Karukoski",
      "url": "https://www.imdb.com/name/nm1933648/"
    }
  ],
  "creator": [
    {
      "name": "Pekko Pesonen",
      "url": "https://www.imdb.com/name/nm0676032/"
    }
  ]
}