

{
  "type": "Movie",
  "name": "Tony 'n' Tina's Wedding",
  "url": "https://www.imdb.com/tt0375145/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTI3NTczMDk3Ml5BMl5BanBnXkFtZTcwOTg3NzIzMQ@@._V1_.jpg",
  "description": "A comedy about two Italian families from different sides of the tracks. What can go wrong does go wrong in this comedy about an Italian-American wedding.",
  "genre": [
    "Comedy"
  ],
  "contentRating": "R",
  "datePublished": "2004-05-03",
  "keywords": "marriage ceremony, immersive theatre, italian wedding, wedding reception, improvisational comedy",
  "duration": "PT1H50M",
  "actor": [
    {
      "name": "Joey McIntyre",
      "url": "https://www.imdb.com/name/nm0570771/"
    },
    {
      "name": "Mila Kunis",
      "url": "https://www.imdb.com/name/nm0005109/"
    },
    {
      "name": "Krista Allen",
      "url": "https://www.imdb.com/name/nm0020739/"
    }
  ],
  "director": [
    {
      "name": "Roger Paradiso",
      "url": "https://www.imdb.com/name/nm0660881/"
    }
  ],
  "creator": [
    {
      "name": "Roger Paradiso",
      "url": "https://www.imdb.com/name/nm0660881/"
    }
  ],
  "review": {
    "author": "bkoganbing",
    "dateCreated": "2018-12-03",
    "inLanguage": "English",
    "heading": "The Nunzios and Vitales join",
    "reviewBody": "Watching Tony 'n' Tina's Wedding was like watching a newsreel on the lives of some very ordinary people whose children are getting married. In class these families, the Nunzios and Vitales aren't exactly the Montagues and Capulets. One hopes things go better for Tony Nunzio and Tina Vitale than for those other kids.\\n\\nThe film starts from just before the wedding and ends with the end of the wedding reception from hell. Joey McIntyre and Mila Kunis are our protagonists and both are from some very dysfunctional families. McIntyre's father John Fiore runs a strip club and its where he can exercise some serial infidelity with his employees. Kunis's mother Priscilla Lopez just wants to live her life again with her daughter vicariously. There's also some bad history with Lopez and Fiore from way back in the day.\\n\\nIf Joe Columbo's Italian American Civil Rights League was still around I doubt Tony 'n' Tina's Wedding would ever have been made. Every nasty Italo-American stereotype out there is in this film. The action takes place in 1988 but I think it could be made dated in the present without any plot problems.\\n\\nThe reception in a catering hall that's seen better days is a hoot. Topping it all off is the demolition of the wedding cake. Has to be seen to be believed.\\n\\nOther performances to take note of are Lenny Venito as the videographer of the proceedings which will I'm sure be edited into a comedy by him, Guillermo Diaz as the gay wedding planner who has some amusing observations on the whole scene and Matthew Saldivar as this stoner who is a friend of the bride who disrupts on all occasions.\\n\\nIf you're Italian you might get offended though.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 390,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 3.7
  }
}