{
  "type": "Movie",
  "name": "American Fable",
  "url": "https://www.imdb.com/tt4671002/",
  "poster": "https://m.media-amazon.com/images/M/MV5BM2ExZWJkYjctNzQwZi00YWExLWI1MDQtMDlkYzM0OTI5MTYzXkEyXkFqcGdeQXVyNjEwNTM2Mzc@._V1_.jpg",
  "description": "After 11-year-old Gitty discovers a man who can grant wishes hiding in her family's silo, she is forced to choose between saving the man's life and protecting her family.",
  "review": {
    "author": "Reno-Rangan",
    "dateCreated": "2018-01-04",
    "inLanguage": "English",
    "heading": "So innocent, imaginative young kid, and then there's an adult world full of complications.",
    "reviewBody": "A thriller from a debutante writer, director. Obviously she did not get support from a big production house, but within the small scale, she has given a nice film. Of course, there were a few flaws. Particularly in the writing section. Overall, the film is very intriguing. The music, locations, performances supported the narration so well. This could be one of the under-noticed film, due to unfamiliar cast and crew. But surely a decent film.\n\nThe story of a farmer family. In a small rural America, where farmers are surrendering to death for unable to pay back the loans, a 11 year old girl is not disturbed by the adult's way of life. Her best friend, a chicken named Happy, roam all over surrounding places. One day she finds a man trapped in her silo. They two becomes friends and help each others needs. But the girl never knew there's a complication behind meeting him. And when that breaks loose, drastically things changes and brings an end to the narration with a twist.\n\nThe storyline was good, but kind of reminds 'Pan's Labyrinth'. This was more a thriller than a fantasy, yet a few scenes defines it could be influenced by fable as the title say. It had a philosophical touch too. The timeline of the tale was 1980s and in the eyes of adult, it is a perfect thriller that focused on the farmers' issue. But, since the story was narrated from the eyes of a kid, that's where magical perspective blooms. So the mix of both these things makes the film very special.\n\n-xX] Important people don't have to say they're important. [Xx-\n\nWhen it comes to the film's drawback, the curves of the storytelling, the scenes were not smoothened enough. I mean the ideas were awesome, but small-small thing had hard time to get away with a perfect blend. For example, the girl could have broken the door/lock from the outside or given foods and other items through the window, instead of climbing up. But the major parts of the film had nothing wrong and can be enjoyed. What it all says is the rookie mistake, but surely the filmmaker has talent and hoping her next one would be a top notch.\n\nThe little girl was very impressive. It reminds many big stars of the present who once did such a wonderful film as a child artist. So I wish her future to be great. She was all over the film, the rest of the cast had little scope, but they all did good as well. Predicting the story is not hard, but there's always one thing bothers is that the doubt between reality and fiction. You know it's not usual for one to find a man trapped in a silo. It has to be one way or the other as I've said. For that, you have to wait till the commencement of the third act. Because sometimes, the could be the film's greatest twist.\n\nAs I've said, it was not a perfect thriller. Nor ignorable! Most of the scene seems intentional, because they were initiated in the early stage like an intro, only in the latter half, once again, they were brought into the narration with the following consequences. How such things were used to complete the storytelling was well planned design. On this, don't believe the film critics. Me either, if you are not a film fanatic. But all I say is, it is not a bad film as you see on the internet. Those who takes chances and appreciates small scale films should try it. But generally, I recommend it to all!\n\n7/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 4664,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.8
  },
  "contentRating": "Not Rated",
  "genre": [
    "Thriller"
  ],
  "datePublished": "2017-02-17",
  "keywords": "farm crisis,economic inequality,economic hardship,agricultural recession,foreclosure",
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Peyton Kennedy",
      "url": "https://www.imdb.com/name/nm4922528/"
    },
    {
      "name": "Richard Schiff",
      "url": "https://www.imdb.com/name/nm0771493/"
    },
    {
      "name": "Kip Pardue",
      "url": "https://www.imdb.com/name/nm0661164/"
    }
  ],
  "director": [
    {
      "name": "Anne Hamilton",
      "url": "https://www.imdb.com/name/nm4581620/"
    }
  ],
  "creator": [
    {
      "name": "Anne Hamilton",
      "url": "https://www.imdb.com/name/nm4581620/"
    }
  ]
}