{
  "type": "Movie",
  "name": "Deep Burial",
  "url": "https://www.imdb.com/tt2449638/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzRmYWM1MDYtZjRkMC00ZWRkLTgzZWUtNjg5NDdhYTE3ZDgzXkEyXkFqcGdeQXVyMzQwMTY2Nzk@._V1_.jpg",
  "description": "In the near future, when communications go offline at a remote nuclear power plant isolated in the desert, a young safety inspector, Abby Dixon, is forced to fly out to bring them back online. Once inside the facility, mysterious ...",
  "review": {
    "author": "Jscooter414",
    "dateCreated": "2017-04-06",
    "inLanguage": "English",
    "heading": "The same low budget rehash , waste of our money.",
    "reviewBody": "The people that agree with vicstevinson saying the film was sexist was low, the main problem with anything being made is lack of creativity and spending the time in coming up with something original as well as making it look better than this - in the opening part of the film, you can see a gap on the helmet of Abby (Sarah Habel), give me a break, that is just lazy, she is wearing this helmet for what reason, should be for oxygen - I thought, what other reason would there be ? I remember in working on Mr. Belvedere, on how lazy the writer's were, they would just copy other people's ideas for the show, that is what Hollywood always does, besides not being more detailed in having the surroundings looking convincing, these films are made by lazy people who unfortunately make way too much money for what they do, more like lack of what they should do, be very detailed and care more about making quality film's and television programs, earn your money, instead of cheating and being lazy, sorry but watching these film's is just frustrating, just like Ghost in the Shell, another great example of lazy - way over paid people. They seem to sit around a table and talk about how much money they can get for empty stuff, one dimensional garbage. The independent film's at least try and are not Hollywood crap driven, for the most part I believe.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 2413,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.2
  },
  "contentRating": "Not Rated",
  "genre": [
    "Sci-Fi",
    "Thriller"
  ],
  "datePublished": "2017-03-17",
  "keywords": "nuclear power,radiation,insanity,scientist,strong female lead",
  "duration": "PT1H21M",
  "actor": [
    {
      "name": "Tom Sizemore",
      "url": "https://www.imdb.com/name/nm0001744/"
    },
    {
      "name": "Sarah Habel",
      "url": "https://www.imdb.com/name/nm3080981/"
    },
    {
      "name": "Dominic Monaghan",
      "url": "https://www.imdb.com/name/nm0597480/"
    }
  ],
  "director": [
    {
      "name": "Dagen Merrill",
      "url": "https://www.imdb.com/name/nm1390673/"
    }
  ],
  "creator": [
    {
      "name": "Fred Armesto",
      "url": "https://www.imdb.com/name/nm4431349/"
    },
    {
      "name": "Kevin Burke",
      "url": "https://www.imdb.com/name/nm1461945/"
    },
    {
      "name": "Adam Gyngell",
      "url": "https://www.imdb.com/name/nm5327376/"
    }
  ]
}