{
  "type": "Movie",
  "name": "Bornless Ones",
  "url": "https://www.imdb.com/tt6010518/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMzk1NDI2MzM4MV5BMl5BanBnXkFtZTgwODAzNDAwMTI@._V1_.jpg",
  "description": "With the help of her friends, Emily moves to a remote home to take better care of her brother, Zack who is diagnosed with cerebral palsy. But what they don't know is that the house kept a terrifying secret that will haunt them one...",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2018-05-16",
    "inLanguage": "English",
    "heading": "Survival of evil",
    "reviewBody": "Saw 'Bornless Ones' being fond of horror/thriller regardless of budget (even if not my favourite genre), and the cover was cool. Was less taken by the concept though, which sounded ridiculous. Being behind on my film watching and reviewing, with a long to watch and review list that keeps getting longer, it took me a while to get round to watching and reviewing.\n\nUnfortunately, do have to agree with the low rating and the poor reviews. 'Bornless Ones' is one of those films that mostly didn't take off, starting off interestingly, but went downhill far too early, never recovered and progressively got worse, particularly in the near-unwatchable later stages. Never judge a film without seeing the whole thing and wanted to not make 'Bornless Ones' an exception, so gave it a fair chance.\n\n The location is also suitably spooky. \n\nHowever, so much brings 'Bornless Ones' down. All the acting is either over-histrionic or disinterested, both in a few cases, and the direction is so phoned in and pedestrian, one gets the sense that the director showed no interest in the film at all. Too much of the soundtrack is intrusive and annoying, made worse by the excessive and obvious sound effects that just cheapens the mood. The film looks drab generally and like it was made in haste, the photography especially betrays that with its amateurishness. The effects are far from special, the complete opposite in fact.\n\nWhere 'Bornless Ones' most underwhelms is the writing and story. The writing is incredibly lazy, it's awkward in dialogue, is gratuitously crude, confused because of not tying things up or going into full detail and doesn't feel complete. The story suffers from a very erratic pace, apparent early on and gets muddled and ridiculous in the second half. It further suffers from feeling too much like a short film stretched out with a lot of useless padding. The stereotypical characters are as unlikeable as they come, the inconsistent and illogical motivations bring them down further. \n\nFor a film billed as a horror, there is very little interesting and nothing remotely scary which makes a waste of such a spooky-looking location. The scares and thrills are too few, barely any even, and are far too predictable, anaemic and weakly timed to make impact, with the chaotic pacing and obvious sound editing cheapening them significantly. 'Bornless Ones' doesn't engage let alone thrill, the more it progressed the more chaotic but everything just feels chaotic and hasty), predictable and more nonsensical it became for a premise that was already far too derivative with far too many easily foreseeable moments. The ending leaves very little impact, very contrived and not much of one at all.\n\nOverall, very poor. 2/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 2
    }
  },
  "rating": {
    "ratingCount": 1206,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.5
  },
  "contentRating": null,
  "genre": [
    "Horror"
  ],
  "datePublished": "2017-02-10",
  "keywords": "symbol,exorcism,haunted house,female nudity,female topless nudity",
  "duration": "PT1H21M",
  "actor": [
    {
      "name": "Margaret Judson",
      "url": "https://www.imdb.com/name/nm4622699/"
    },
    {
      "name": "Devin Goodsell",
      "url": "https://www.imdb.com/name/nm4140200/"
    },
    {
      "name": "Michael Johnston",
      "url": "https://www.imdb.com/name/nm5076257/"
    }
  ],
  "director": [
    {
      "name": "Alexander Babaev",
      "url": "https://www.imdb.com/name/nm5192303/"
    }
  ],
  "creator": [
    {
      "name": "Alexander Babaev",
      "url": "https://www.imdb.com/name/nm5192303/"
    }
  ]
}