{
  "type": "Movie",
  "name": "Despicable Me: Minion Mayhem 3D",
  "url": "https://www.imdb.com/tt2755518/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYWVjMzQ2ODUtOTMwOS00MjAzLWFhYTItMTMxZTRmMDc4OGQ1XkEyXkFqcGdeQXVyMTA5ODEyNTc5._V1_.jpg",
  "description": "Gru, one of the world's greatest villains and fathers, has invented a new weapon, the Minion Gun, a machine capable of turning ordinary humans into Minions. He has let his three daughters (Margo, Edith and Agnes) in charge of training the Minions. The day plans to unveil the weapon to the world and use it on the Minions is spoiled when an unknown creature has been creating mutations turning the Minions into the beastly Purple Minions and begin the transformation from sweethearts to devilish devildogs.",
  "review": {
    "author": "Platypuschow",
    "dateCreated": "2018-06-20",
    "inLanguage": "English",
    "heading": "Despicable Me Minion Mayhem 3D: Just no....",
    "reviewBody": "I've been on a lot of these 3D experiences and I'm pretty sure I still haven't seen one I even remotely enjoyed. I like Despicable Me and adore Minions so logically I should have enjoyed this but the less than 10 minute experience is simply a mindless cashgrab and alike the others wasn't entertaining. Lots of noise, no actual plot, just a lot of motion with little purpose. I'm sure kids will love this, me not so much. The Good: Features the original voices The Bad: Just pure chaos Not even remotely funny Things I Learnt From This Short: These rides were entertaining enough in the 80's, not now.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 1204,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.2
  },
  "contentRating": "TV-PG",
  "genre": [
    "Animation",
    "Short",
    "Adventure"
  ],
  "datePublished": "2012-07-02",
  "keywords": "despicable me's minion character, young girl, cg animation, minion, anniversary",
  "duration": "PT14M",
  "actor": [
    {
      "name": "Steve Carell",
      "url": "https://www.imdb.com/name/nm0136797/"
    },
    {
      "name": "Miranda Cosgrove",
      "url": "https://www.imdb.com/name/nm1388927/"
    },
    {
      "name": "Dana Gaier",
      "url": "https://www.imdb.com/name/nm3269138/"
    }
  ],
  "director": [],
  "creator": [
    {
      "name": "Brian Lynch",
      "url": "https://www.imdb.com/name/nm0528244/"
    }
  ]
}