{
  "type": "Movie",
  "name": "Donald Cried",
  "url": "https://www.imdb.com/tt4442604/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTUyNjU2MzMzMl5BMl5BanBnXkFtZTgwNTUwNTcxMTI@._V1_.jpg",
  "description": "With sudden passing of his grandmother, Peter Latang returns to his hometown and encounters his long lost, childhood friend, Donald Treebeck. What begins as a simple favor, turns into a long day's journey into the past.",
  "review": {
    "author": "Jalow547",
    "dateCreated": "2017-08-22",
    "inLanguage": "English",
    "heading": "The best film I've seen in a while",
    "reviewBody": "I hadn't seen the trailer for this one or read much about it, so I didn't really know what to expect when I turned the movie on, and I was very pleasantly surprised. Despite the obviously low budget, the acting is extremely good. I might even say it's some of the best I've seen, which is very rare and something that's hardly ever seen in movies with such low budgets.\n\nThe story is about two high school friends who meet up again twenty years later. One has moved away and moved on with his life and the other is still a child. They reconnect after one of the friend returns home following the death of a relative, kind of like in Garden State. As a matter of fact, the guy who plays the Zach Braff character in this film even looks a lot like Braff. The guy who plays the Peter Sarsgaard character is much less cool than Sarsgaard but much more interesting. Like in Garden State, the two go on a day-long adventure around town together, but the similarities stop there.\n\nAfter watching this movie, I read a couple other reviews online and was surprised to find out that many people disliked it. Someone said it felt like the filmmakers were trying to make a movie like one of Adam McKay's, but failed because it wasn't funny enough. I don't know how they came up with that comparison, but Adam McKay is known for his dumb comedies, and this is something much more than that. Although very funny (even hysterical) at times, it doesn't go after cheap laughs or laugh-out-loud ridiculousness. It goes for authenticity, and it definitely succeeds in that realm. No matter what anyone went into this film expecting, it becomes pretty obvious in the first five or ten minutes that it is not just another dumb comedy. Not by a long shot.\n\nAnother reviewer blamed the low-key nature of the film on the small budget. I don't think he knew what he was talking about. The only thing I can think of is that these viewers are of below average intelligence and just don't understand life. They certainly don't understand this film, and perhaps find it hard to believe that these types of characters can exist in the real world. But they can, and they do. I've met many of them. And I found myself identifying and sympathizing with both of the two main characters at different points throughout the film.\n\nBut I guess for some, they think these guys would be better off in a dumb comedy with little substance and big dumb jokes that really aren't that funny anyway. I guess if you fall into that category I would recommend you watch a different film such as Mr. Woodcock or Homegrown, both starring Billy Bob Thornton, rather than this one. You may find those more to your liking.\n\nThe characters, and particularly the title character Donald, who is played by the film's director, are very complex and well-written. Their odd behavior would feel over-the-top and ridiculous and fake, except that the filmmakers somehow found that perfect sweet spot where instead they feel totally real. They're not the kinds of characters you normally see in movies, but they're then kind of people who exist in real life, with all their strange quirks and awkwardness. They feel almost like characters out of a John Cassavetes film.\n\nThe story also feels very real. Everything about it feels real as we spend time with the characters and learn about their lives. There are a lot of questions that don't get answered, and often the characters say so much by not saying anything at all. The story is sentimental and has a moral to it, but it doesn't try to trick the viewer at any point (at least I don't think it does!), which I like. It tells its story and its message by showing us a couple of days in the life of real, ordinary people.\n\nSo often characters in films are two dimensional, and that's how we see a lot of people in real life, too. You never really know someone. They keep their secrets to themselves. But this film shows us the lives of two real, complex people, which can help teach us something about those around us and blah blah blah.\n\nThe story here unfolds naturally and realistically, but it's never predictable. It is in no way contrived and it feels totally raw and authentic. If ever there was a perfect example of filmmakers doing the best they could with what little they had to work with, this is it.\n\nIt's the type of story that many of us could easily see happening in our own lives, and which we'd forget about it in two days as we get caught up in the next thing, being only mildly significant but totally relevant. But here, captured on film, it somehow seems profound and completely unforgettable. Although, to be fair, I did just watch it today, so it's possible that I'll forget the whole thing in two days as well. But I have a feeling it will stick with me for at least a little longer than that.\n\nSo no big laughs, no big story, but that's what is good about it. It's a story about people. You don't love them and you sometimes hate them, but you feel for them. Oh yeah, I should also say that even the minor characters, like the boss at the bowling alley, were really well done and fun to watch.\n\nAnyway, I enjoyed this movie very much for a lot of reasons and I very much look forward to seeing what these filmmakers come up with next. This was their first feature film and they knocked it out of the park so I bet they can come up with something even better next time! Hopefully they don't screw it up.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 1365,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "Not Rated",
  "genre": [
    "Comedy",
    "Drama"
  ],
  "datePublished": "2016-03-12",
  "keywords": "based on short film,two word title,lost wallet,hometown,rhode island",
  "duration": "PT1H25M",
  "actor": [
    {
      "name": "Jesse Wakeman",
      "url": "https://www.imdb.com/name/nm2208367/"
    },
    {
      "name": "Kris Avedisian",
      "url": "https://www.imdb.com/name/nm2858296/"
    },
    {
      "name": "William Billington",
      "url": "https://www.imdb.com/name/nm6690839/"
    }
  ],
  "director": [
    {
      "name": "Kris Avedisian",
      "url": "https://www.imdb.com/name/nm2858296/"
    }
  ],
  "creator": [
    {
      "name": "Kris Avedisian",
      "url": "https://www.imdb.com/name/nm2858296/"
    },
    {
      "name": "Kyle Espeleta",
      "url": "https://www.imdb.com/name/nm1879895/"
    },
    {
      "name": "Jesse Wakeman",
      "url": "https://www.imdb.com/name/nm2208367/"
    }
  ]
}