{
  "type": "Movie",
  "name": "Ferdinand",
  "url": "https://www.imdb.com/tt3411444/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI4Mjk0NzQwOF5BMl5BanBnXkFtZTgwNjg3MjI2MjI@._V1_.jpg",
  "description": "After Ferdinand, a bull with a big heart, is mistaken for a dangerous beast, he is captured and torn from his home. Determined to return to his family, he rallies a misfit team on the ultimate adventure.",
  "review": {
    "author": "scottshak_111",
    "dateCreated": "2018-08-10",
    "inLanguage": "English",
    "heading": "A Pacifist's Tale in a Violent World",
    "reviewBody": "Surprisingly a good movie! I would be honest with you. From the trailers, I didn't expect much from Ferdinand Movie. But I was wonderstruck when I actually saw it. Watching it become a powerhouse of emotions as the movie progressed, I knew I had been dead wrong. That a movie should not be judged by its trailer, just as no book should be judged by its cover. Ferdinand movie didn't pack in as many jests as you find in animated movies nowadays, but it was a great entertainer nevertheless. It was successful in walking a tightrope of emotions. That's where its true strength lurked. When you focus on other parts critically you realize there were tons of issues strewn around the movie as well. But all of that can be overlooked once you become the bull the movie cashes in on, and try to empathize with that creature who doesn't share his dream based on his appearance, rather stands by his decision to see what others fail to. Story and Characters Not everyone is same. We have been wired differently. Whilst a father wishes to be something, his son might not share his dream. He might have a dream of his own. Everyone has a choice. That very fact forms the basis of Ferdinand movie. You can't decide or judge someone by their size or appearance. What you can't see, their brain, in fact, holds the key to their vision. Place that impactful storyline into animation and you have got an enjoyable hoot to savour. That's what Ferdinand does with its bull, the protagonist voiced by John Cena. He is an out of place animal who doesn't share other's dreams. Bullfighting in Ferdinand Movie Either you are a fighter, or you are meat. What you might call as someone's dream is a brilliant mockery of materialism. In the movie, the dream of fellow bulls is to fight the matador. Whilst the bulls in the flick fail to see the pointlessness of it, (like all the people who consider bullfighting a sport) Ferdinand in his blatant sense of indifference towards the game, digs up the real truth behind it. They are all ending up getting slaughtered! Just as we had seen in Sausage Party, the blind followers are all prepping up to die. Sure, you get to fight in a magnificent stage, but it's just another chop shop! Ferdinand movie uncovers the ugliness that surrounds the sport in a way that will leave you teary-eyed. Ferdinand is all about saving the meek, helping others. He is finding it hard to explain it to others why he is the way he is. Doesn't that chime in with life? I don't know, like your very own? How many times have you felt that way? As if you are in someone's else body, forced to live someone else's dream. Are you fighting for it? It's good to see someone is. Ferdinand is willing to leave no stones unturned to make the world understand he is not like the others. He is different. Violence his not his place even though he has been bedecked with a body that leaves the onlookers marveling. Look at your pecs! They are like two tiny bulls inside a bull. But the world, being the world, judges Ferdinand by the way he looks and brands him as destructive. A Glance at Life Ferdinand is given a shot at identifying his life the way he wishes to live it. He finds it in a place right next to Nina voiced by Lily Day. That's where he wishes to be - In a patch of land where a bull is chosen over a dog, Nina teaches Ferd the Nerd what love is all about. Is this love? I love love. It's that taste of life that helps the bull in registering home - not where you are born but where you are supposed to be. Deprived of the life he desires to lead, Ferdinand is picked up and dropped at Ground zero once again. He ends up in Casa del Toro, the place that he had escaped from, to be prepped up for bullfighting, something he is not cut out for. Unable to understand what the fuss is all about Ferd tries to escape a bull's fate, but ends up drawing himself closer to the inescapable sport. Lupe voiced by Kate McKinnon is one of those weird funny characters, who brings in most of the punches and stays close by. El Primero (Miguel Angel Silvestre) is in search of a bull to fight his final fight. Marking Ferdinand as a perfect contender he awaits him in the center of all applause. Even though the main villain brings that heightened sense of befitting contrast to Ferdinand's character, you realize it is a typical cliched build-up that you have often seen in countless movies in the past. El Primero might have reminded you of Anton Ego from Ratatouille if only he had better words to say. The screenplay of the flick, unfortunately, isn't impressive and hence framing him as a villain to remember is something you might want to reconsider. The Final Showdown What tears you apart is the final face-off that puts the bull against El Primero. While there's an imminent death written in the frames, the demeanor of the bull is enough to shatter you into pieces. The multitude is busy cheering the one with the sword, but they easily forget that the one fighting without is a true champion",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 62982,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2017-12-14",
  "keywords": "bull,bullfighting,farm,flowers,village",
  "duration": "PT1H48M",
  "actor": [
    {
      "name": "John Cena",
      "url": "https://www.imdb.com/name/nm1078479/"
    },
    {
      "name": "Kate McKinnon",
      "url": "https://www.imdb.com/name/nm0571952/"
    },
    {
      "name": "Bobby Cannavale",
      "url": "https://www.imdb.com/name/nm0134072/"
    }
  ],
  "director": [
    {
      "name": "Carlos Saldanha",
      "url": "https://www.imdb.com/name/nm0757858/"
    }
  ],
  "creator": [
    {
      "name": "Robert L. Baird",
      "url": "https://www.imdb.com/name/nm0047916/"
    },
    {
      "name": "Tim Federle",
      "url": "https://www.imdb.com/name/nm8758198/"
    },
    {
      "name": "Brad Copeland",
      "url": "https://www.imdb.com/name/nm0178589/"
    }
  ]
}