{
  "type": "Movie",
  "name": "I Don&apos;t Feel at Home in This World Anymore.",
  "url": "https://www.imdb.com/tt5710514/",
  "poster": "https://m.media-amazon.com/images/M/MV5BYmM5Zjg5ZWEtYmQwOS00NmFmLTgxYzktYTJkZmY3OGM4NDQyXkEyXkFqcGdeQXVyNjk4NjM5Nzc@._V1_.jpg",
  "description": "When a depressed woman is burgled, she finds a new sense of purpose by tracking down the thieves along with her obnoxious neighbor. But they soon find themselves dangerously out of their depth against a pack of degenerate criminals.",
  "review": {
    "author": "CinemaClown",
    "dateCreated": "2017-03-05",
    "inLanguage": "English",
    "heading": "A Wicked Blend Of Crime & Comedy That&apos;s As Amusing As It Is Rueful",
    "reviewBody": "Macon Blair&apos;s feature film debut is a wicked blend of violence & hilarity that balances the elements of crime & comedy with flair, offers an interesting insight into the norms of lower-class American society, and is wonderfully uplifted by quirky inputs from its cast to succeed as an indie that&apos;s as amusing as it is rueful.\n\nI Don&apos;t Feel at Home in This World Anymore tells the story of a lonely woman who&apos;s sick of people being indecent all around her and is pushed to the limit when her home gets robbed. Enlisting the help of a neighbour, the two decide to go after the ones who burglarized her house but soon find themselves out of their depths.\n\nWritten & directed by Macon Blair in what&apos;s his directional debut, the film exhibits a shade or two of Jeremy Saulnier&apos;s thrillers when it comes to depicting violence but most of it is pierced by well- dosed humour that serves as a counterpoint. The plot takes a while to get going but once it gains the momentum, it is expertly maintained till the end.\n\nFeaturing an idiosyncratic list of characters whose arcs are embedded with serviceable depths, the first act attempts to establish our protagonist&apos;s lonely state & morals before bringing more people into the play. Melanie Lynskey plays her leading part brilliantly and supporting her throughout is Elijah Wood who delivers a downright hilarious performance as her neighbour.\n\nOn an overall scale, I Don&apos;t Feel at Home in This World Anymore is a confidently crafted beginning of Macon Blair&apos;s directional career and is a morality play that&apos;s quite timely but there was still room for improvement, for few segments are drawn out, narrative flow is inconsistent at times, and it settles for a safe conclusion. Nevertheless, for a debut feature, it is as good a start as any. Worth a shot.",
    "reviewRating": {
      "worstRating": null,
      "bestRating": null,
      "ratingValue": null
    }
  },
  "rating": {
    "ratingCount": 63717,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.9
  },
  "contentRating": "TV-MA",
  "genre": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "datePublished": "2017-02-24",
  "keywords": "revenge,vigilante,burglary,depression,defecating in toilet tank",
  "duration": "PT1H33M",
  "actor": [
    {
      "name": "Melanie Lynskey",
      "url": "https://www.imdb.com/name/nm0001491/"
    },
    {
      "name": "Chris Doubek",
      "url": "https://www.imdb.com/name/nm1953775/"
    },
    {
      "name": "Marilyn Faith Hickey",
      "url": "https://www.imdb.com/name/nm0382644/"
    }
  ],
  "director": [
    {
      "name": "Macon Blair",
      "url": "https://www.imdb.com/name/nm0086301/"
    }
  ],
  "creator": [
    {
      "name": "Macon Blair",
      "url": "https://www.imdb.com/name/nm0086301/"
    }
  ]
}