{
  "type": "Movie",
  "name": "I, Tonya",
  "url": "https://www.imdb.com/tt5580036/",
  "poster": "https://m.media-amazon.com/images/M/MV5BY2I4ODYwYTktODcxNC00NWJiLWE2ZTQtZDk1Yzk5MTNkZWU2XkEyXkFqcGdeQXVyNzQwNzQwMjA@._V1_.jpg",
  "description": "Competitive ice skater Tonya Harding rises amongst the ranks at the U.S. Figure Skating Championships, but her future in the activity is thrown into doubt when her ex-husband intervenes.",
  "review": {
    "author": "rockman182",
    "dateCreated": "2017-12-07",
    "inLanguage": "English",
    "heading": "I, Tonya (2017)",
    "reviewBody": "I think this film may have had the best trailer of 2017. I saw it and knew instantly how badly I wanted to see it. I&apos;ve never been a fan of Margot Robbie and her previous acting efforts but this looked like her awakening and where she would be proving me wrong. I believe it, she&apos;s quite sensational in this film. Her dedication to her role shows but really everyone involved has done very well. Craig Gillespie has his first real winner with I, Tonya.\n\nI, Tonya is a biographical picture about famed and disgraced figure skater, Tonya Harding. Tonya was pushed onto the rink by her abusive mother at a very young age and despite the abuse becomes a very talented ice skater. The cycle of abuse continues with her abusive husband but she tries to bear through and succeed. Everyone seems to be against her but her talent is hard to deny. The film also goes into the famed attack on fellow ice skater Nancy Kerrigan and the aftermath of the incident.\n\nThe film is sort of told from a mockumentary perspective as if key characters are being interviewed. The film also utilizes breaking the fourth wall where characters in a scene would talk to the audience. I thought this was interesting and separates itself from being a standard biopic and gives this film a real comedic depth. The soundtrack is catchy and literally every performance in this film makes for a very engaging time. I didn&apos;t even recognize the chameleon Bobby Cannavale until the credits rolled.\n\nSome wonder why the film was made but it kind of helps you identify with Tonya. She suffered physical and psychological abuse from both her foul mouthed mother and her rage filled husband. Her hands may not be completely clean in what happens to Nancy Kerrigan, but she is also just a victim of circumstances. Vastly talented, but just short of reaching her pinnacle due to outside factors and her image and attitude. The film isn&apos;t perfect but its vastly entertaining and could be giving Margot Robbie and Allison Janney Oscar nominations. I&apos;m going to let this sink in and I&apos;m sure its going to be something I go back to.\n\n7.5/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 240256,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.5
  },
  "contentRating": "R",
  "genre": [
    "Biography",
    "Comedy",
    "Drama"
  ],
  "datePublished": "2018-01-18",
  "keywords": "ice skating,violence,abusive mother,abuse,ice skater",
  "duration": "PT1H59M",
  "actor": [
    {
      "name": "Margot Robbie",
      "url": "https://www.imdb.com/name/nm3053338/"
    },
    {
      "name": "Sebastian Stan",
      "url": "https://www.imdb.com/name/nm1659221/"
    },
    {
      "name": "Allison Janney",
      "url": "https://www.imdb.com/name/nm0005049/"
    }
  ],
  "director": [
    {
      "name": "Craig Gillespie",
      "url": "https://www.imdb.com/name/nm0318916/"
    }
  ],
  "creator": [
    {
      "name": "Steven Rogers",
      "url": "https://www.imdb.com/name/nm0737216/"
    }
  ]
}