{
  "type": "Movie",
  "name": "Menashe",
  "url": "https://www.imdb.com/tt6333086/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjQxYTc1MGEtNzhhOS00YWJmLWJlOWUtZWJlZjA5Yzk4NDA0XkEyXkFqcGdeQXVyNTAzMTY4MDA@._V1_.jpg",
  "description": "Within Brooklyn&apos;s ultra-orthodox Jewish community, a widower battles for custody of his son. A tender drama performed entirely in Yiddish, the film intimately explores the nature of faith and the price of parenthood.",
  "review": {
    "author": "rannynm",
    "dateCreated": "2017-08-28",
    "inLanguage": "English",
    "heading": "Authentic, Emotional Masterpiece",
    "reviewBody": "Menashe is an authentic, emotional masterpiece telling the story of a kind, hapless, Hasidic grocery store clerk who battles to keep his family together after his wife dies. Directed by Joshua Z. Weinstein and starring Menashe Lustig, the film was shot clandestinely because of the beliefs of the Orthodox Jewish sect. I love this film because it took willpower to make. You can&apos;t say that about many films nowadays. \n\nMenashe is about a kindhearted, but miserable grocery store employee that must remarry in order to care for his only son. It is against the Hasidic beliefs that a child be taken care of without a mother in the home. While Menashe ponders his situation, his well-off brother-in-law is given custody of Rieven by their Rabbi. Menashe is frustrated by this and is only able to get back custody of his son for a week, while he looks for a new wife. It doesn&apos;t seem that he really wants to get remarried, because when he goes on one date he isn&apos;t particularly friendly. \n\nUnlike the rest of his family and friends, Menashe is more at ease with the secular society surrounding them in Brooklyn. He dresses more casually, without the requisite black hat and coat. While he takes his religion seriously, he wants to embrace life and freedom, more than the sect allows. My favorite part of this film is when Menashe drinks malt liquor with the Hispanic employees after his late night shift. They talk about life and try to get Menashe back on track. \n\nOne of the attributes of this film is the way it educates you about the culture of ultra Orthodox Judaism. The other very impressive fact is that it is the first film in 70 years to be filmed in Yiddish. Most of the film is subtitled for those who don&apos;t speak Yiddish. Both Menashe Lustig and young Ruben Niborski convey the closeness they have between father and son. One downside of the film is that it is low budget, which is reflected in its grainy resolution. Some of that could also be due to the fact that it was shot in secret. \n\nI give this film 4 out of 5 stars for its authenticity and emotional punch. I recommend it for ages 13 through 18. The film is in limited release throughout the country at art house cinemas. \n\nReviewed by Clayton P., KIDS FIRST! Film Critic.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 2502,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "PG",
  "genre": [
    "Drama"
  ],
  "datePublished": "2017-08-18",
  "keywords": "hasidic jew,father son relationship,single father,widower,orthodox jew",
  "duration": "PT1H22M",
  "actor": [
    {
      "name": "Menashe Lustig",
      "url": "https://www.imdb.com/name/nm8668507/"
    },
    {
      "name": "Anna Gansburg Nahmani",
      "url": "https://www.imdb.com/name/nm11077898/"
    },
    {
      "name": "Ariel Vaysman",
      "url": "https://www.imdb.com/name/nm9390539/"
    }
  ],
  "director": [
    {
      "name": "Joshua Z Weinstein",
      "url": "https://www.imdb.com/name/nm2922880/"
    }
  ],
  "creator": [
    {
      "name": "Alex Lipschultz",
      "url": "https://www.imdb.com/name/nm2483108/"
    },
    {
      "name": "Musa Syeed",
      "url": "https://www.imdb.com/name/nm3082897/"
    },
    {
      "name": "Joshua Z Weinstein",
      "url": "https://www.imdb.com/name/nm2922880/"
    }
  ]
}