{
  "type": "Movie",
  "name": "My Entire High School Sinking Into the Sea",
  "url": "https://www.imdb.com/tt5538568/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTc1ODk0NzEwNl5BMl5BanBnXkFtZTgwMjQ2MzQ1MTI@._V1_.jpg",
  "description": "An earthquake causes a high school to float into the sea, where it slowly sinks like a shipwreck.",
  "review": {
    "author": "RforFilm",
    "dateCreated": "2017-04-28",
    "inLanguage": "English",
    "heading": "My Entire High School Sinking Into the Sea exposes the hollowness most school social scenes are and fills them in with colorful substance",
    "reviewBody": "Social hierarchy defines the high school experience for most teenagers. On the verge of adulthood, these kids love to follow their peers on MTV and wherever their inspiration comes from to emulate them. Though rather then adapting it to their home life, they would rather take that life. For most kids, they simply cannot become a Karadashian nor an best selling novelist on the spot, so they try to duplicate the mannerisms of their idols to try to prove people that they are just as good as them. This is what makes the high school social life full, but also hollow and pointless.\n\nThe queen bee may be the most popular girl on campus, but will come face to face with wannabes in college. The Dungeons and Dragons geek may hate their lives in physical education, will come to find a friendlier crowd in the real world. I&apos;ve come to find the high school social scene a lot like a filming of an MTV reality show; full of people that think they know the world despite being in it less then eighteen years. The multitude of that experience and it&apos;s deeper levels are explored in the oddly titled, My Entire High School Sinking Into the Sea. \n\nYoung sophomore Dash (played by Jason Schwartzman) is contently convincing himself that his school newspaper is popular and that he&apos;s one of the best writers in school. The truth is that he would rather focus on publishing gossip to get people to read. His best friend Assaf (played by Reggie Watts) and fellow student Verti (played by Verti) are annoyed by his ego and ask Dash to leave. Dash fumes that the rest of the world does not understand him and cannot wait to leave to try and write a book. What he doesn&apos;t know is that he&apos;s about to live through a great story.\n\nThe day was already stormy, but rotting roots finally pushed the school into the Pacific Ocean. Now sinking, the students and faculty are scrambling to call for help and making it out as the building is drifting further out to sea. Dash teams up with popular girl Mary (played by Lena Dunham) to get to the top floor where the seniors are. The find Assaf and Verti along with lunch lady Lorraine (played by Susan Sarandon) fight through the water and dead students to make it out alive, along with seeing the problems of school cliché groups and administrative bureaucracy. \n\nKind of like Your Name, My Entire High School Sinking Into the Sea is another surprise animated movie that I liked. It&apos;s story of getting out of a sinking high school is both a parody of disaster movies, and a deeper story about the hollowness of the life inside of it. Some might question the short seventy-five minute running time, but the pacing makes it feel like a well balanced story and enough for it&apos;s animation style.\n\nNot only do we hand some hand-drawn animation, but the film also slips into paintings, sketches, and even abstract art that combines several elements. I can see this as an acquired taste, but animation fans should be welcoming of something this risky in an age of computer animation.\n\nThe voice acting is great for the cast that it got. My favorites were Lena Dunham, who captures the insecurities of a queen bee, and Susan Sarandon, whose character is so interesting, that I wouldn&apos;t mind seeing a spin-off story about lunch lady Lorraine. If I had any problem, that would be the main character who can be a tad selfish. I know a lot of kids are like this, but I think that Dash could have been written a tad more relatable (like dwelling more into his obsession with wanting to be popular). Otherwise, I have to commend this movie for entertaining me with such a bizarre premise.\n\nI&apos;ll give this eight high school papers out of ten. This movie is oddly animated in a crude manner, but it&apos;s final result is deep. Even if animation is not your forte, I&apos;d try to give this a chance and see how it can fill a hollowness with plenty of substance.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 1240,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.1
  },
  "contentRating": "PG-13",
  "genre": [
    "Animation",
    "Action",
    "Comedy"
  ],
  "datePublished": "2016-09-11",
  "keywords": "school",
  "duration": "PT1H15M",
  "actor": [
    {
      "name": "Jason Schwartzman",
      "url": "https://www.imdb.com/name/nm0005403/"
    },
    {
      "name": "Reggie Watts",
      "url": "https://www.imdb.com/name/nm2551886/"
    },
    {
      "name": "Adam Lustick",
      "url": "https://www.imdb.com/name/nm3713920/"
    }
  ],
  "director": [
    {
      "name": "Dash Shaw",
      "url": "https://www.imdb.com/name/nm2690651/"
    }
  ],
  "creator": [
    {
      "name": "Dash Shaw",
      "url": "https://www.imdb.com/name/nm2690651/"
    }
  ]
}