{
  "type": "Movie",
  "name": "Rock Dog 3 Battle the Beat",
  "url": "https://www.imdb.com/tt11207270/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNTAzODc1ZTgtZjRlZC00N2E4LWExNmQtODFkZGU1NTc2ZTBhXkEyXkFqcGdeQXVyMTU3NzMyMTY2._V1_.jpg",
  "description": "When the young performers on a music contest show admit they have never heard of Angus Scattergood, Bodi is compelled to join the show to restore the Rock Legend&apos;s good name.",
  "review": {
    "author": "Swandaxx",
    "dateCreated": "2023-02-26",
    "inLanguage": "English",
    "heading": "Just watch something else.",
    "reviewBody": "Rock Dog 3 is easily one of the least engaging movies I&apos;ve seen recently, both failing as a standalone film and as a sequel. The entire plot from beginning to end is as predictable as it can be, and the main conflict doesn&apos;t even make any logical sense once you actually think about it for more than a few seconds. This, combined with the consistently unfunny humor and some scenes of obnoxious dialogue, makes the movie boring at best and mentally draining at worst. I seriously struggled to sit through the entire movie again to write this review.\n\nNone of the new characters managed to become interesting or endearing in any way. Additionally, nearly all of the characters from the previous movies have either been completely butchered or contribute so little that they may as well not even have been included in the first place. While animation isn&apos;t terrible direct-to-DVD sequel of this type, the use of recycled footage and voice lines from previous movies is just embarrassing. Most of the voice acting and music are actually passable and sometimes even decent, but that&apos;s not nearly enough to make up for everything else I&apos;ve mentioned.\n\nEven though this isn&apos;t even close to being the worst movie I&apos;ve seen, I still wouldn&apos;t recommend watching it in the slightest. With all of the other, far more enjoyable animated movies that have been released recently, I see no reason to waste your time on this.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 2
    }
  },
  "rating": {
    "ratingCount": 250,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.9
  },
  "contentRating": "TV-Y",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2023-01-24",
  "keywords": "wilhelm scream,animal in title,numbered sequel,interspecies friendship,anthropomorphic animal as protagonist",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Graham Hamilton",
      "url": "https://www.imdb.com/name/nm10231739/"
    },
    {
      "name": "Ashleigh Ball",
      "url": "https://www.imdb.com/name/nm1868320/"
    },
    {
      "name": "Andrew Francis",
      "url": "https://www.imdb.com/name/nm0290075/"
    }
  ],
  "director": [
    {
      "name": "Anthony Bell",
      "url": "https://www.imdb.com/name/nm0068034/"
    }
  ],
  "creator": [
    {
      "name": "Rob Muir",
      "url": "https://www.imdb.com/name/nm0611390/"
    }
  ]
}