{
  "type": "Movie",
  "name": "The Case for Christ",
  "url": "https://www.imdb.com/tt6113488/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZTJmZWMwNDQtNGUzZS00MWRiLThmMjctNTY3NGY1ODE5M2ExL2ltYWdlXkEyXkFqcGdeQXVyNTQ3MjE4NTU@._V1_.jpg",
  "description": "An investigative journalist and self-proclaimed atheist sets out to disprove the existence of God after his wife becomes a Christian.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2017-10-10",
    "inLanguage": "English",
    "heading": "An unconvincing case",
    "reviewBody": "This is not coming from an atheist or somebody particularly religious, though finds the Bible and its stories fascinating. This is coming from someone who loves film of all genres and decades, would see anything with an open mind and an intent to judge it on what it set out to do and wanted to see as many films from 2017 as possible.\n\n2017 has been a mixed bag for film, with some good and more films, some disappointing and less films and some that fall somewhere in between. &apos;The Case for Christ&apos; is not among the year&apos;s very worst but is in the bottom half of the quality spectrum to me. It is understandable why atheists would hate it with a passion, though some here have to me not expressed their feelings very well, but it is my feeling that it&apos;s not only atheists who will dislike &apos;The Case for Christ&apos;. Critics were very mixed on it themselves and it is also my feeling that even the converted will find themselves preached at.\n\nComing from a non-atheist and as said someone not particularly religious, &apos;The Case for Christ&apos; did come over as too heavy-handed and one-sided and like it was trying too hard to appeal to Christians and the converted. There are a lot of theories presented here but these theories are little more than strongly put and theories masquerading as fact, that talk at you bombastically rather than provoking thought, with very little that holds weight to back it up. The bogus scientific elements too strain credibility to an unbelievable degree, science is practically re-invented here so scientific experts are another group that will find the film hard to swallow. In short, &apos;The Case for Christ&apos; has a script that does mean well and tries, and sometimes succeeds, in being sincere, but tends to be uninspired and patronising.\n\nWhen it comes to the storytelling, &apos;The Case for Christ&apos; never rises above superficial level. A few good, if familiar, ideas but never fully explored and cranks up the sentimentality to the point the sweetness and sugar makes one nauseous and the sentimentality is hard to stomach. Some of it is ludicrous too. The pace is dull and meandering, the music is forgettable at best and the direction has flashes of inspiration but is mostly blandly workmanlike.\n\nFor all those problems, &apos;The Case for Christ&apos; is not all bad. It looks pretty good and slick, handsomely shot and nicely mounted. It&apos;s particularly striking in how the look and feel of 1980 Chicago is captured, and the film does that very well. The acting is pretty decent, despite the awkward dialogue and thinly drawn characters, with the best performances coming from Faye Dunaway and particularly Mike Vogel.\n\nNot all the material is a disaster. The insights of the extent to which religion still shapes popular and political thinking in the United States and how are actually interesting and well argued. It is a pity that everything else in the writing fails to convince.\n\nIn summary, will be, and has been, very controversial for understandable reasons on both sides. Apart from a few good things and some intrigue and sincerity, it is very sad to say that &apos;The Case for Christ&apos; had a case that didn&apos;t convince me and didn&apos;t do much for me. 4/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 10142,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.3
  },
  "contentRating": "PG",
  "genre": [
    "Biography",
    "Drama"
  ],
  "datePublished": "2017-04-07",
  "keywords": "atheist,investigation,based on true story,journalist,christian",
  "duration": "PT1H52M",
  "actor": [
    {
      "name": "Mike Vogel",
      "url": "https://www.imdb.com/name/nm1036181/"
    },
    {
      "name": "Erika Christensen",
      "url": "https://www.imdb.com/name/nm0159776/"
    },
    {
      "name": "Faye Dunaway",
      "url": "https://www.imdb.com/name/nm0001159/"
    }
  ],
  "director": [
    {
      "name": "Jon Gunn",
      "url": "https://www.imdb.com/name/nm0348197/"
    }
  ],
  "creator": [
    {
      "name": "Brian Bird",
      "url": "https://www.imdb.com/name/nm0083349/"
    },
    {
      "name": "Lee Strobel",
      "url": "https://www.imdb.com/name/nm1798181/"
    }
  ]
}