{
  "type": "Movie",
  "name": "Transformers: The Last Knight",
  "url": "https://www.imdb.com/tt3371366/",
  "poster": "https://m.media-amazon.com/images/M/MV5BN2YwOWM4ODgtZTMzMi00ZmFmLTk5NTEtNmY4ZDcwNzQxNDhjXkEyXkFqcGdeQXVyNTI0NzAyNjY@._V1_.jpg",
  "description": "A deadly threat from Earth&apos;s history reappears and a hunt for a lost artifact takes place between Autobots and Decepticons, while Optimus Prime encounters his creator in space.",
  "review": {
    "author": "TheLittleSongbird",
    "dateCreated": "2017-07-01",
    "inLanguage": "English",
    "heading": "Pray let this be the last",
    "reviewBody": "Just for the record, before those defending the film jump down my throat and start accusing me of all kinds of unfounded things like they have done with their tiresome, uncalled for and disgustingly condescending critic bashing, this review is not coming from a &apos;Transformers&apos; detractor. Far from it actually oddly enough.\n\nMost of the animated show are really entertaining and well made, and the animated film likewise in a guilty pleasure sort of way. Of the live-action films, the first was enjoyable, &apos;Revenge of the Fallen&apos; (often considered the worst) for me wasn&apos;t that terrible but had a lot wrong with it while &apos;Dark of the Moon&apos; and &apos;Age of Extinction&apos; were mediocre. This is coming from somebody with a diverse taste in film and television (and a huge fan of classical music and opera), loving films of all genres old and new.\n\nAm honestly of the opinion that Michael Bay&apos;s &apos;Transformers&apos; franchise got worse with each instalment, and having seen some describe &apos;The Last Knight&apos; as the worst of the five having seen for myself with an open mind but with a little knowledge of its reception personally am in agreement. By all means, &apos;The Last Knight&apos; is not irredeemably bad, none of the &apos;Transformers&apos; films are. As usual the special effects are mostly of an awesome standard and the Transformers themselves are very well voiced, particularly a note-perfect Peter Cullen and Frank Welker.\n\nBringing some welcome gravitas and fun to the film is Anthony Hopkins in one of the better performances of all five films put together. The best character is the refreshingly witty Cogman, performed with sleek enthusiasm by Jim Carter.\n\nHowever, Bay&apos;s direction is smug and self-indulgent and while there is some audacious stylishness to some of the cinematography too much of the editing is enough to make one get a headache. The Transformers don&apos;t have enough to do and while well voiced their personalities have been better defined before and their scenes lack tension, fun, excitement or any kind of intrigue. While the action sequences worked in the first three films, they didn&apos;t here and &apos;Age of Extinction&apos;, especially here, being chaotic and dull in rhythm. Aside from them being so poorly edited that it was confusing making out what was going on and to the point it was seizure-inducing, they got increasingly repetitive and dull. So instead of feeling thrilled the only feeling I got was boredom, and that was true of a lot of the audience in the cinema.\n\nNone of the human characters are interesting, some are wasted and some are pointless (such as Izabella and Sqweeks). Others are annoying, of all the characters in the entire film faring worst in this regard is the complete failure of a comic relief character in Jimmy, annoyingly played by Jerrod Carmichael. Once again the script is very poor, which has the subtlety of a sledgehammer (even for a live-action &apos;Transformers&apos; film where subtlety was never a strong suit and wasn&apos;t expected, but this was nauseating overkill too often) and is laden with tiresome clichés and cheap lowbrow humour that is on &apos;Age of Extinction&apos; level and makes that of &apos;Revenge of the Fallen&apos; comparatively tame.\n\n&apos;The Last Knight&apos; is again overlong by an hour, with the basic story being very thin on the ground and both rushed and slow moving. To make up for this, or disguise it more like, a lot of subplots are added, far too many and many of them are unsatisfyingly resolved or explored or serve no point at all, all giving an over-stuffed feel. Hopkins aside, the acting for the human characters is really not good, with Mark Whalberg being wooden and unconvincing at being tough and Laura Haddock is completely out of her depth. The two generate zero chemistry throughout. Even John Tuturro, Stanley Tucci and Mitch Pileggi are lacklustre.\n\nIn conclusion, weak film and gives the sense that the &apos;Transformers&apos; franchise has run its course. 3/10 Bethany Cox",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 3
    }
  },
  "rating": {
    "ratingCount": 167358,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.2
  },
  "contentRating": "PG-13",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "datePublished": "2017-06-22",
  "keywords": "based on toy,fifth part,shootout,stabbed through the head,stabbed in the chest",
  "duration": "PT2H34M",
  "actor": [
    {
      "name": "Mark Wahlberg",
      "url": "https://www.imdb.com/name/nm0000242/"
    },
    {
      "name": "Anthony Hopkins",
      "url": "https://www.imdb.com/name/nm0000164/"
    },
    {
      "name": "Josh Duhamel",
      "url": "https://www.imdb.com/name/nm0241049/"
    }
  ],
  "director": [
    {
      "name": "Michael Bay",
      "url": "https://www.imdb.com/name/nm0000881/"
    }
  ],
  "creator": [
    {
      "name": "Art Marcum",
      "url": "https://www.imdb.com/name/nm1436466/"
    },
    {
      "name": "Matt Holloway",
      "url": "https://www.imdb.com/name/nm0391344/"
    },
    {
      "name": "Ken Nolan",
      "url": "https://www.imdb.com/name/nm0634307/"
    }
  ]
}