{
  "type": "Movie",
  "name": "Wish Upon",
  "url": "https://www.imdb.com/tt5322012/",
  "poster": "https://m.media-amazon.com/images/M/MV5BOGQxN2NlMWItNzMyOC00ODYxLThkNDktMWQ0ZjA2MjQyYjIwXkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_.jpg",
  "description": "A teenage girl discovers a box that carries magic powers and a deadly price for using them.",
  "review": {
    "author": "subxerogravity",
    "dateCreated": "2017-07-15",
    "inLanguage": "English",
    "heading": "Wish it was better (Like the death scenes though)",
    "reviewBody": "Not the best movie but in the horror element it kinda got me. The death scenes are pretty suspenseful. Not really the deaths, it was waiting for them to die that was really good, that&apos;s what makes the movie for me. Similar to Final Destination as there is no slasher, physically. \n\nIt&apos;s about a girl going through regular teenage angst (Even with the added plot of her mom committing suicide, it&apos;s still just the regular teenage problems). Her dad Ryan Phillippe finds some junk that turns out to be a Chinese artifact that grants her seven wishes but with each wish the coast is real high.\n\nBut getting back to the teen angst, it made this movie so annoying. Like I said, her mom killed herself and yet all her teenage problems still seems fairly normal by comparison. In a way, this dumb High School hi jinks of the main protagonist being uncool and uses her wishes to change that made for a sensible plot, but I could not help to be annoyed by it, possibly because it seems like more of that teen comedy stuff than any actually horror.\n\nA for effort. Like I said the death scenes have you on the edge of your seats (For that I would recommend seeing it in a theater filled with commentators cause it does add fun to it), it was pretty awesome sitting there seeing how gruesome the death was going to be which built it up and when it did happen, it did not reduce the gruesome. Wish it was more of that and less an episode of something on the CW\n\nhttp://cinemagardens.com",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "rating": {
    "ratingCount": 22725,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.1
  },
  "contentRating": "PG-13",
  "genre": [
    "Drama",
    "Fantasy",
    "Horror"
  ],
  "datePublished": "2017-07-14",
  "keywords": "teenage girl,garbage,suicide by hanging,blood spattered face,wishing box",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Joey King",
      "url": "https://www.imdb.com/name/nm1428821/"
    },
    {
      "name": "Ryan Phillippe",
      "url": "https://www.imdb.com/name/nm0000202/"
    },
    {
      "name": "Ki Hong Lee",
      "url": "https://www.imdb.com/name/nm3859624/"
    }
  ],
  "director": [
    {
      "name": "John R. Leonetti",
      "url": "https://www.imdb.com/name/nm0502954/"
    }
  ],
  "creator": [
    {
      "name": "Barbara Marshall",
      "url": "https://www.imdb.com/name/nm3011547/"
    }
  ]
}