

{
  "type": "Movie",
  "name": "Goodbye to All That",
  "url": "https://www.imdb.com/tt2437548/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzgxOTkwMzEyMV5BMl5BanBnXkFtZTgwMDY1Mzg1MzE@._V1_.jpg",
  "description": "When his wife unexpectedly informs him that she wants a divorce, well-meaning but oblivious husband Otto Wall finds himself thrust back into bachelorhood, where he searches for the real thing amidst a string of one night stands.",
  "review": {
    "author": "Reno-Rangan",
    "dateCreated": "2016-12-24",
    "inLanguage": "English",
    "heading": "The last ten minutes is to define the title!",
    "reviewBody": "Try to expect from the film what the title signifies. Then this will be a decent film to have. As we know there's no big names in the cast, as well as from behind the camera. But the whole film discloses is what people do when their marriage fails, in order to move on. That's not it, there's a message, that it ends with, especially about the children of the splitting couple. Seems it is a nice one from that angle, though overall film is not a clever enough to attract all kinds of viewers.\n\nWhen his wife suddenly breaks the news that she wants a divorce, the husband in a surprise tries his best to convince her not to, but nothing works. All the separation affair can be solved easily as they have a good understanding. So they try to move on, particularly the father who meets many women, including his old school and college mates. But what they are not seeing is their young daughter who is affected by all this. So where the story heads from there is told in the remaining.\n\nFor the first time direction, this is not a bad film. A low budget, short film with a simple storyline. Well intended film on what it wanted to say. But nothing was told straight, everything was about not being single, that means dating and sex was the priority. Only in the last ten minutes it tries to turn around. That's where the story and the title overlaps. Really the nice performances, particularly Paul Schneider, who has been seen mostly in the supporting roles. So I think it is worth a watch if you are not forcing yourself.\n\n6/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 2501,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "contentRating": "Unrated",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2014-12-17",
  "keywords": "reunion,north carolina,packing,moving,extramarital affair",
  "duration": "PT1H27M",
  "actor": [
    {
      "name": "Paul Schneider",
      "url": "https://www.imdb.com/name/nm0773973/"
    },
    {
      "name": "Melanie Lynskey",
      "url": "https://www.imdb.com/name/nm0001491/"
    },
    {
      "name": "Anna Camp",
      "url": "https://www.imdb.com/name/nm2319871/"
    }
  ],
  "director": [
    {
      "name": "Angus MacLachlan",
      "url": "https://www.imdb.com/name/nm0533666/"
    }
  ],
  "creator": [
    {
      "name": "Angus MacLachlan",
      "url": "https://www.imdb.com/name/nm0533666/"
    }
  ]
}