

{
  "type": "Movie",
  "name": "John Wick",
  "url": "https://www.imdb.com/tt2911666/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTU2NjA1ODgzMF5BMl5BanBnXkFtZTgwMTM2MTI4MjE@._V1_.jpg",
  "description": "An ex-hitman comes out of retirement to track down the gangsters who killed his dog and stole his car.",
  "review": {
    "author": "CountJonnie",
    "dateCreated": "2015-01-17",
    "inLanguage": "English",
    "heading": "Story: 3 minutes; Entertainment: 101 minutes.",
    "reviewBody": "It looks as if the filmmakers realized that the public was sick of certain movies. Most movies nowadays are full of wire work, sci-fi, etc. often topped with icing made of needless or predictable background stories that add nothing. For example the beautiful girlfriend who gives the moral speeches or the troubled teenage daughter, who aren't present here.\\n\\nNothing of that is in John Wick. John Wick adds hardly a story, no character development, no needless character or background, no misplaced drama, no misplaced humor and not too much eye candy, nothing of that. What John Wick offers is action, action and more action. In fact, it is one long action scene, with some lines and close ups added. But that is not a problem. The directors promise action and deliver. While delivering they made it look good and convincing, without trying to be more, and they're smart enough to give the movie a satisfying beginning and ending.\\n\\nAnd for those who claim that Keanu Reeves is a horrible actor..... you are right. But his blank expression is perfect for this movie. Leave the acting to the bad guys and the delicious guest part for Willem Dafoe.\\n\\nIf you're tired of movies with forced drama or loaded with CGI, John Wick will be a pleasant wake-up call.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 732590,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.4
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "datePublished": "2015-04-10",
  "keywords": "professional killer,one man army,vengeance,revenge,professional assassin",
  "duration": "PT1H41M",
  "actor": [
    {
      "name": "Keanu Reeves",
      "url": "https://www.imdb.com/name/nm0000206/"
    },
    {
      "name": "Michael Nyqvist",
      "url": "https://www.imdb.com/name/nm0638824/"
    },
    {
      "name": "Alfie Allen",
      "url": "https://www.imdb.com/name/nm0654295/"
    }
  ],
  "director": [
    {
      "name": "Chad Stahelski",
      "url": "https://www.imdb.com/name/nm0821432/"
    },
    {
      "name": "David Leitch",
      "url": "https://www.imdb.com/name/nm0500610/"
    }
  ],
  "creator": [
    {
      "name": "Derek Kolstad",
      "url": "https://www.imdb.com/name/nm4401003/"
    }
  ]
}