

{
  "type": "Movie",
  "name": "Let's Be Cops",
  "url": "https://www.imdb.com/tt1924435/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMjI3MDY2ODQwNF5BMl5BanBnXkFtZTgwNjUzNjE4MTE@._V1_.jpg",
  "description": null,
  "review": {
    "author": "bkrauser-81-311064",
    "dateCreated": "2014-09-16",
    "inLanguage": "English",
    "heading": "Reserved for the Old Blockbuster Crowd",
    "reviewBody": "Don't be fooled by the sophomoric title which conjures up images of idiots pretending to be cops to pick up chicks, get free things and otherwise act like fools in uniformwait, that is what happens in this film. Still don't be fooled by the title, the movie isn't so much face-palming as it is just mildly and reliably silly.\\n\\nThe movie stars Jake Johnson of New Girl (2011-2014) fame as a burned out former college sports prodigy who's currently unemployed and single in sunny Los Angeles. His roommate Damon Wayans Jr. is a video game designer who struggles to bring his ideas to life thanks to a petrifying fear of taking initiative. His new game pitch involves a Grand Theft Auto-type RPG boasting an authentic beat cop experience. So authentic in fact, that he borrows real police uniforms to place on his presentation mannequins. His boss doesn't go for it but at least the two can become a hit at a costume party, thus beginning a ruse that grabs the attention of the ladies, the criminals and the LAPD.\\n\\nThe film adds very little to the buddy cop genre save a realistic performance by Rob Riggle as a legit Police officer. The villains are serviceable in menace and acting ability while love interest Nina Dobrev of the ever popular Degrassi: The Next Generation (2006-2009) is breathtaking T&A. The notion of Dobrev's character aspiring to be a makeup artist and not an actress or model is about as silly as Fred Astaire aspiring to be a shoe-shiner. Try as they might the chemistry between the two leads is cordial but no where near the level of Murtaugh and Briggs, Cates and Hammond, Lee and Carter. At best they're Freebie and the Bean (1974) without the pretense of already being A-List stars.\\n\\nBut let's be real, this film isn't trying to be the next Rush Hour (1998), and yes that is the new marker of quality. It's a movie that tries to reassemble the old Blockbuster video crowd who rented Martin Lawrence's National Security (2003) and All About the Benjamins (2002) a hundred times because old habits die hard and The Marine (2006) was already rented out. While Johnson and Wayans Jr. may not have the established fan base of Martin Lawrence or Ice Cube, there's no denying the films refreshing lack of pretense and the actors' enthusiasm towards the one-trick pony screenplay.\\n\\nLet's cut the BS, what it all comes down to in movies like this is can it make you laugh? The short answer is yes and not just scattered chuckles either. Is it worth a re-watch; probably not. There are some truly inspired moments many of which are provided by Keegan-Michael Key (If Key and Jordan Peele were cast as the hapless fake cops instead of Johnson and Wayans who knows how deliciously absurd this movie could have gotten). Yet the buddy-banter all feels recycled and the action sequences are mundane.\\n\\nI tacitly approve even if Let's Be Cops appeared too late on the scene to be relevant. Those who are limitedly exposed to the clich\\u00e9s of boys-in-blue-type cinema will find something to like, especially when their parents aren't in the room. Those with more discerning taste might want to look the other way on this one, not because it's offensive, dumb or bad but because it's too little of anything.\\n\\nhttp://www.theyservepopcorninhell.blogspot.com",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 139483,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.4
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "datePublished": "2014-08-27",
  "keywords": "friendship between men,impersonating a police officer,football game,smoking marijuana,fictional tv commercial",
  "duration": "PT1H44M",
  "actor": [
    {
      "name": "Jake Johnson",
      "url": "https://www.imdb.com/name/nm2159926/"
    },
    {
      "name": "Damon Wayans Jr.",
      "url": "https://www.imdb.com/name/nm0915458/"
    },
    {
      "name": "Rob Riggle",
      "url": "https://www.imdb.com/name/nm1443527/"
    }
  ],
  "director": [
    {
      "name": "Luke Greenfield",
      "url": "https://www.imdb.com/name/nm0339004/"
    }
  ],
  "creator": [
    {
      "name": "Luke Greenfield",
      "url": "https://www.imdb.com/name/nm0339004/"
    },
    {
      "name": "Nicholas Thomas",
      "url": "https://www.imdb.com/name/nm1242846/"
    }
  ]
}