

{
  "type": "Movie",
  "name": "Ouija",
  "url": "https://www.imdb.com/tt1204977/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1NzcwMTU5MF5BMl5BanBnXkFtZTgwOTE5MzEyMjE@._V1_.jpg",
  "description": "A group of friends must confront their most terrifying fears when they awaken the dark powers of an ancient spirit board.",
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "datePublished": "2014-10-31",
  "duration": "PT1H29M",
  "contentRating": "15",
  "keywords": "ouija,ouija board,ghost,sister sister relationship,attic",
  "rating": {
    "ratingCount": 56628,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.5
  },
  "review": {
    "author": "ArchonCinemaReviews",
    "dateCreated": "2014-11-18",
    "inLanguage": "English",
    "heading": "Another avg BH Prod Horror",
    "reviewBody": "In recent times, never has a horror film centered entirely around the Ouija board game, and perhaps for good reason - it is a bit too foolish to be believable.\\n\\nOuija boards have been utilized in horror films countless times before, as a last ditch effort to communicate with a disturbed spirit on the other side when a medium led seance is out of the question. 2014&apos;s horror film Ouija instead puts the cause and focus of the strange disturbances directly upon the game itself.\\n\\nAfter one of their friends inexplicably is found dead in a suspected suicide, a group of friends turn toward her Ouija board in a desperate attempt to find answers and closure. When it appears a communication channel has been opened with the dead things take a dark and unsettling turn.\\n\\nStiles White co-writes and directs this painfully formulaic film. What audiences should expect to get from Ouija is your classic &apos;strange occurrences, oh no people dying, let&apos;s investigate to uncover the truth to hopefully appease the spirits&apos;. While formulas typically exist because on some level they do work, this one has been bludgeoned to boredom inducing death.\\n\\nTypically if a film is going to be this standard then some sort of redeemable part of it must shine through, either through stellar characters portrayed by undiscovered gems or uniquely gruesome horror scenes. Ouija is a film that opens incredibly weakly, like a rough cut that should have been a reshoot. Once the group of friends, led by up-and-coming horror queen Olivia Cooke, make contact through the Ouija board the terrifying scenes considerably improve but never prove wow-worthy and still border on clich\\u00e9.\\n\\nThe most substantial error in the entirety of the film is the overall serious tone. The teenage high school students are all a bit too earnest when it comes to using a Ouija board. Stiles and his co-screenplay writer Juliet Snowden just really have no idea how to write realistically for teen youths. There is no humor or sarcasm, no sass and no disbelief when one of the friends approaches the other to use the Ouija board.\\n\\nTeens, even in the event that one kills him or herself, use humor as a coping mechanism. if one of my friends said &apos;we need to talk to ____ on the other side&apos; I would laugh in his or her face from the ludicrous nature of the proposition.\\n\\nFurther everything that propels the story forward in Ouija is a bit far-fetched. Most of the teens are incredibly serious about dental hygiene, with several scenes featuring them flossing. The adults all must have minored in Paranormal Occurrences and How to Deal with It. Overall Ouija was not scary and the extenuating circumstances surrounding the plot were laughable at best.\\n\\nCheck our website for more full reviews of recent releases.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 5
    }
  },
  "actor": [
    {
      "name": "Olivia Cooke",
      "url": "https://www.imdb.com/name/nm4972453/"
    },
    {
      "name": "Ana Coto",
      "url": "https://www.imdb.com/name/nm4519628/"
    },
    {
      "name": "Daren Kagasoff",
      "url": "https://www.imdb.com/name/nm2973326/"
    }
  ],
  "director": [
    {
      "name": "Stiles White",
      "url": "https://www.imdb.com/name/nm0925482/"
    }
  ],
  "creator": [
    {
      "name": "Juliet Snowden",
      "url": "https://www.imdb.com/name/nm1340000/"
    },
    {
      "name": "Stiles White",
      "url": "https://www.imdb.com/name/nm0925482/"
    }
  ]
}