

{
  "type": "Movie",
  "name": "Somewhere Slow",
  "url": "https://www.imdb.com/tt1928338/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNDM4Mzg2NDY1MV5BMl5BanBnXkFtZTgwMDI4MjI4MDE@._V1_.jpg",
  "description": "When Anna Thompson gets mixed up in a convenience store robbery, she makes a split-second decision to walk out of her life and into the unknown. On her travels, she meets Travis, a teenage drifter on his own journey of self-discovery.",
  "review": {
    "author": "kibwe-64-331961",
    "dateCreated": "2014-07-27",
    "inLanguage": "English",
    "heading": "Raw yet enchanting!!",
    "reviewBody": "This is the sort of movie that knocks your socks off in it is subtlety. Excellent but powerful story about transition and transformation - and applicable to anyone's life journey. And great performances by lead actors, Jessalyn Gilsig and Graham Patrick Martin. An unlikely meeting of two people struggling with life's hurdles. Their encounter is surprisingly true to the name of the film. It took me to those slow, yet special times that are just that -- fleeting moments in life that we will long cherish. Beautifully filmed on location in a quaint New England setting, the film contains scenes with amazing texture and captures the characters in a captivating, almost dreamlike sequence of events that is powerful and enlightening for them and the viewer. With direction and screenplay by Jeremy O'Keefe, this is highly polished and professional for a newcomer's first full-length feature. A sleeper hit in the making and worthwhile independent film flying well under the radar. Romance meets coming of age - I highly recommend this movie if you are looking for either.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 307,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.1
  },
  "contentRating": "Not Rated",
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "datePublished": "2013-03-02",
  "keywords": [
    "bare chested male",
    "older woman younger man sex",
    "older woman younger man relationship",
    "journey"
  ],
  "duration": "PT1H36M",
  "actor": [
    {
      "name": "Jessalyn Gilsig",
      "url": "https://www.imdb.com/name/nm0319698/"
    },
    {
      "name": "Kelly Schumann",
      "url": "https://www.imdb.com/name/nm1893247/"
    },
    {
      "name": "Kim Yarbrough",
      "url": "https://www.imdb.com/name/nm3187683/"
    }
  ],
  "director": [
    {
      "name": "Jeremy O'Keefe",
      "url": "https://www.imdb.com/name/nm1077547/"
    }
  ],
  "creator": [
    {
      "name": "Jeremy O'Keefe",
      "url": "https://www.imdb.com/name/nm1077547/"
    }
  ]
}