

{
  "type": "Movie",
  "name": "Step Up All In",
  "url": "https://www.imdb.com/tt2626350/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTUzMjUyODA1Nl5BMl5BanBnXkFtZTgwMjIwNTQ5MTE@._V1_.jpg",
  "description": "All-stars from the previous Step Up installments come together in glittering Las Vegas, battling for a victory that could define their dreams and their careers.",
  "genre": [
    "Drama",
    "Music",
    "Romance"
  ],
  "datePublished": "2014-08-01",
  "duration": "PT1H52M",
  "contentRating": "12",
  "keywords": "competition,dancing,father figure,embarrassment,bully",
  "rating": {
    "ratingCount": 35902,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.9
  },
  "review": {
    "author": "quincytheodore",
    "dateCreated": "2014-07-15",
    "inLanguage": "English",
    "heading": "Should have all in with the stunning choreograph, and folded the cumbersome script and screenplay",
    "reviewBody": "One of these days Step Up will realize that it's better for the characters to just whimsically dance like in old musical movie without forcing an already stagnant plot. The movie boasts a dynamic choreography and stellar music to go with it, some are timed just right and they are admittedly entertaining. It commendably tries to bring a dancer's perspective on their life style and tribulation, but the plot often contradicts the effort by putting overly flamboyant characters or tired plot. In the end it's just another drawn out excuse for a dance battle, albeit a rather spectacular one.\n\nStory revolves around characters from previous installments, collaborating to make a crew to win the high stake dance competition. No Channing Tatum though. If this sounds familiar, it is. There are monetary issues, personal issues and dances in between. For what it's worth, the two leads try to bring more emotion to the mix, although only a few good moments come out of it. Adam Sevani (Moose) is a star, the uncrowned lead of the series. It's quiet amazing that his side story resonates more than the actual main plot.\n\nProblem arises when the movie attempts to exaggerate flamboyant lifestyle, especially those of celebrity's and their reality television. It's far from witty; in fact the humor tends to fall and becomes tiresome to watch. The main antagonists are mediocre unsavory characters; the male is copied directly from the typical random thug that messes with Chuck Norris or Steven Seagal at a bar, while the female is a botched version of Stanley Tucci's character from Hunger Games.\n\nWhen the characters don't banter they perform well. Using odd props and good dance moves, they manage to produce a spectacle. Most of the cast are primarily dancers, so they convince the audience better using motion than poorly written script. Wardrobe looks good, each dance is represented with unique costume, the steampunk one is particularly exceptional. With simple yet effective effect, these dance sequences are the heights of the movie.\n\nLike any other installments, the plot is almost a hindrance as audience waits for another dance scene to erupt. It does try to make audience relate, although it misses the mark more often than not, which is a shame since it invests plenty of time for it. The glossy choreograph and heart-thumping soundtracks present an enjoyable light flick, and to be fair it's what viewer would expect, but sadly nothing more.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "actor": [
    {
      "name": "Ryan Guzman",
      "url": "https://www.imdb.com/name/nm4554428/"
    },
    {
      "name": "Briana Evigan",
      "url": "https://www.imdb.com/name/nm0263759/"
    },
    {
      "name": "Adam Sevani",
      "url": "https://www.imdb.com/name/nm1782560/"
    }
  ],
  "director": [
    {
      "name": "Trish Sie",
      "url": "https://www.imdb.com/name/nm2586324/"
    }
  ],
  "creator": [
    {
      "name": "Duane Adler",
      "url": "https://www.imdb.com/name/nm0012137/"
    },
    {
      "name": "John Swetnam",
      "url": "https://www.imdb.com/name/nm4291727/"
    }
  ]
}