

{
  "type": "Movie",
  "name": "The Homesman",
  "url": "https://www.imdb.com/tt2398231/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4NTkxOTEyMl5BMl5BanBnXkFtZTgwOTI1NzcwMzE@._V1_.jpg",
  "description": "Three women who have been driven mad by pioneer life are to be transported across the country by covered wagon by the pious, independent-minded Mary Bee Cuddy, who in turn employs low-life drifter George Briggs to assist her.",
  "review": {
    "author": "Quinoa1984",
    "dateCreated": "2015-03-25",
    "inLanguage": "English",
    "heading": "a dark bleak, grimy Western with soul and strong performances",
    "reviewBody": "The Homesman, about a 31 year old (un-married/childless) woman (Hilary Swank) who takes up the challenge of bringing three crazed women across the Nebraska plains over five weeks with the help of a deserter-drifter left for dead (Jones), is in some ways meant to be a real Feminist Western (with a capital 'F'), and not in the way that a silly work like The Quick and the Dead was with Sharon Stone. Here, it's much more about depicting a time and place that was quite bleak and desolate and, in some spaces, without much hope. Ultimately Tommy Lee Jones, through the novel it's based on, sees a little more light at the end of the tunnel for his protagonist than, say, Eastwood did in Unforgiven. But it's a combination of things it's about, and emotionally the film does work quite well, in particular in the relationship that unfolds between the two leads.\\n\\nIf you're curious to see a western that has the love of the plains of the West visually speaking ala Ford, but has the dark contours of someone like Mann - and added to that those super dirty production designs and character realizations from Spaghetti Westerns - this might be it, at least up to a point. It's so unrelentingly dark in how it looks on at the deteriorating mental states of these women, and the desperation in the journey for Jones and Swanks' characters, that the few moments of humor are rather surprising - and welcome - especially when Jones first appears to Swank on the noose and the horse. It's the kind of scene that shows this actor, well into his 60's and pushing 70, trying something new in a performance (if only for a scene or two).\\n\\nIt's got a cast that is practically distracting for the who's who that shows up, mostly for one scene a piece: James Spader, Tim Blake Nelson, John Lithgow, William Fichtner, Meryl Streep (!) and Hailee Steinfeld (who appears almost to have wandered from the True Grit set to this one). There's so much going for the Homesman that it's a shame the script is uneven, and there's a plot twist two thirds of the way through that is sort of explained but not at all at the same time, and it leaves the film with a gaping tragedy that can never quite be filled. Interestingly, if you watch the behind the scenes on the blu-ray one of the screenwriters mentions the book left things unexplained as well. That might be fine in the book - or perhaps more was explained in other ways - but it still doesn't work, and what Jones goes for in awe-inspiring shots he leaves behind with some muddled story beats.\\n\\nNevertheless, The Homesman is a good Western, a solid western digging into the roots of the genre and mixing the unsavory and horrifying (not like a horror movie, just some repellant images at times, but for a point), though whether one will want to return to it like other, better Westerns is another story. It's the kind of picture I can't put down for its artistry, even if things can be looked at more critically, which may explain why it didn't find its way through the End-of-Awards-time (albeit it was accepted at Cannes).",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 7
    }
  },
  "rating": {
    "ratingCount": 35404,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "15",
  "genre": [
    "Drama",
    "Western"
  ],
  "datePublished": "2014-11-21",
  "keywords": "suicide by hanging,suicide,driven insane,abusive marriage,female nudity",
  "duration": "PT2H2M",
  "actor": [
    {
      "name": "Tommy Lee Jones",
      "url": "https://www.imdb.com/name/nm0000169/"
    },
    {
      "name": "Hilary Swank",
      "url": "https://www.imdb.com/name/nm0005476/"
    },
    {
      "name": "Grace Gummer",
      "url": "https://www.imdb.com/name/nm3501146/"
    }
  ],
  "director": [
    {
      "name": "Tommy Lee Jones",
      "url": "https://www.imdb.com/name/nm0000169/"
    }
  ],
  "creator": [
    {
      "name": "Tommy Lee Jones",
      "url": "https://www.imdb.com/name/nm0000169/"
    },
    {
      "name": "Kieran Fitzgerald",
      "url": "https://www.imdb.com/name/nm1634307/"
    },
    {
      "name": "Wesley A. Oliver",
      "url": "https://www.imdb.com/name/nm1364182/"
    }
  ]
}