

{
  "type": "Movie",
  "name": "Barnyard",
  "url": "https://www.imdb.com/tt0414853/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTU2NDE0ODYyNF5BMl5BanBnXkFtZTcwNjQ3NzAzMQ@@._V1_.jpg",
  "description": "When the farmer's away, all the animals play, and sing, and dance. Eventually, though, someone has to step in and run things, a responsibility that ends up going to Otis, a carefree cow.",
  "review": {
    "author": "HiddenVoice",
    "dateCreated": "2006-08-03",
    "inLanguage": "English",
    "heading": "It's silly,incredibly stupid looking,but hey ,I loved it.It made me laugh out loud more than the current live action comedies.",
    "reviewBody": "This film at sometimes feels like as if it were made by the Farrelly Brothers.It's slapstick humor and it's wildly nutty behaviour that makes it look like a R-rated comedy,makes it all the while more funny The story is sort of like a parody of Lion King.Farmers on a farm are keeping animals under their eye and well protected.And animals pretty much behave like,well,animals.But what happens when the farmers out.Well,the party begins,as these animals somehow behave more like humans,crazily partying around with the rest of the animals.And a carefree cow is held responsible for whatever goes on.He's in charge.And he needs to protect the farm from their enemies,the Coyotes.Otis the carefree cow,pretty much don't take it seriously.Ben ,a cow who takes it very seriously is giving advice to Otis to grow up and all that.When Ben is no longer able to lead, Otis tries to keep order but the role of leader does not come as naturally for him. Without Ben to keep everyone in line, absolute mayhem breaks loose and it isn't long before the farmer begins to get to the bottom of the animals' secret--and the scheming coyotes begin to think that the farm could be theirs for the taking.\n\nJust don't take this film seriously,especially not the story.The problem with the film is that ,we've seen it all before.Especially the recent animated films that are flooding cinema's.They are either about animals,or insects,or well CARS.And this film has similarities with many animated films.The story is nothing new at all.And that is its drawback.And it's approach is rather conventional with dumb looking characters that are half baked.But there are sweet moments that don't get too sentimental.Another weakness is its weaker than expected animation.It's not fair to have such an average animation to a funny movie.If the film's animation was heighten to a better quality,it would've been better than it already was.\n\nHowever,I really liked the jokes,which seem to have been aimed at adults.But the animation was passable.The film has some really outrageously hilarious moments,giving you snort out loud laughs.The animals are more human-like than actual animals,and they love partying around,all night.They behave like those characters from Ace Ventura films or other Oedekerk films.\n\nIn short,it's simply a mindless comedy with a lot of great laughs.I would take this any time over the disappointing Talladega nights.\n\nYou gotta moo at least once!What happens in the Barnyard,stays in the Barnyard.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 6
    }
  },
  "rating": {
    "ratingCount": 34171,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.6
  },
  "contentRating": "PG",
  "genre": [
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "datePublished": "2006-10-20",
  "keywords": "anthropomorphic animal,animal,chicken farm,farmer,talking animal",
  "duration": "PT1H30M",
  "actor": [
    {
      "name": "Kevin James",
      "url": "https://www.imdb.com/name/nm0416673/"
    },
    {
      "name": "Courteney Cox",
      "url": "https://www.imdb.com/name/nm0001073/"
    },
    {
      "name": "Danny Glover",
      "url": "https://www.imdb.com/name/nm0000418/"
    }
  ],
  "director": [
    {
      "name": "Steve Oedekerk",
      "url": "https://www.imdb.com/name/nm0644203/"
    }
  ],
  "creator": [
    {
      "name": "Steve Oedekerk",
      "url": "https://www.imdb.com/name/nm0644203/"
    }
  ]
}