

{
  "type": "Movie",
  "name": "Big Momma's House 2",
  "url": "https://www.imdb.com/tt0421729/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjZmYTQ3OTktODkzYy00YmQxLTgxMjEtY2ZkZDY4MDYzNDNmXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
  "description": "An FBI agent reprises his disguise as a corpulent old lady and takes a job as a nanny in a crime suspect's house.",
  "review": {
    "author": "tracker57",
    "dateCreated": "2006-02-13",
    "inLanguage": "English",
    "heading": "Certainly full of slapstick but plot could have used the work!!!",
    "reviewBody": "After settling down into a desk job inside the FBI, former Field Agent Malcolm Turner (Martin Lawrence) defies orders to stay out of the investigation of his former partners death and travels to Orange County, California to go undercover as Big Momma, working for an unhappy woman (Emily Proctor) who is under investigation for the murder. Little did he realise that he would become attached to the dysfunctional family\\n\\nAfter pouring myself a nice hot cup of tea, I settled down in the comfy chair of Screen 1 to brace myself for the print check and hopefully have some harmless viewing. The result; A relatively brain dead projectionist trying to get to grips of where the last hour and a half of his life disappeared to. Now, to tell you the truth, I&apos;ve never been much of a big fan of Martin Lawrence to start with but, like Jeremy Clarkson driving from London to Edinburgh and back ECONOMICALLY, shocks are everywhere. For the first time ever, I actually found Martin Lawrence&apos;s humour quite funny. Giving the dog a bowlful of tequila gave me a bit of a tickle, as did Big Momma&apos;s &apos;Baywatch&apos; style slow-mo run.\\n\\nThis is probably the only plus side on a film which lacked the power to keep a rather basic storyline going. The characters created weren&apos;t complex enough. The family consisted of three children. One who was 3 and wasn&apos;t able to speak, which you undoubtedly knew he would by the end. The 8 year old girl was a wannabe dancer, and there was a troubled teen, who would stop her rebellious ways by the end of the movie. Emily Proctor&apos;s acting throughout the film was, to be truthful, pretty lame. It&apos;s like she took Calleigh Duquesne&apos;s character from CSI: Miami and just took all of the weapons expertise out of it. No original work was added to the character.\\n\\nTo sum up, this is a sequel that should have been left WELL alone. If you are of the type of mind that requires a film that will challenge you, I&apos;d look elsewhere. Laughter is guaranteed as this film&apos;s storyline is clearly based around Big Momma, allowing Martin Lawrence breathing space to play with the character, but there were never any genuine references to the original film.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 4
    }
  },
  "rating": {
    "ratingCount": 46206,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 4.8
  },
  "contentRating": "PG",
  "genre": [
    "Comedy",
    "Crime"
  ],
  "datePublished": "2006-02-10",
  "keywords": "repeat sequel,fbi federal bureau of investigation,transvestism,impersonation,impostor",
  "duration": "PT1H39M",
  "actor": [
    {
      "name": "Martin Lawrence",
      "url": "https://www.imdb.com/name/nm0001454/"
    },
    {
      "name": "Emily Procter",
      "url": "https://www.imdb.com/name/nm0698346/"
    },
    {
      "name": "Nia Long",
      "url": "https://www.imdb.com/name/nm0000505/"
    }
  ],
  "director": [
    {
      "name": "John Whitesell",
      "url": "https://www.imdb.com/name/nm0925870/"
    }
  ],
  "creator": [
    {
      "name": "Don Rhymer",
      "url": "https://www.imdb.com/name/nm0722610/"
    },
    {
      "name": "Darryl Quarles",
      "url": "https://www.imdb.com/name/nm0702912/"
    }
  ]
}