

{
  "type": "Movie",
  "name": "Candy Land",
  "url": "https://www.imdb.com/tt13857556/",
  "poster": "https://m.media-amazon.com/images/M/MV5BM2Y3ODZiNjAtYTdmYS00YWE2LWFmNmMtMTdlNjYyMWQyZTI3XkEyXkFqcGdeQXVyMDA4NzMyOA@@._V1_.jpg",
  "description": null,
  "datePublished": "2023-01-06",
  "contentRating": "TV-MA",
  "genre": [
    "Horror",
    "Thriller"
  ],
  "duration": "PT1H33M",
  "rating": {
    "ratingCount": 3530,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "review": {
    "author": "PedroPires90",
    "dateCreated": "2022-10-08",
    "inLanguage": "English",
    "heading": "Very good",
    "reviewBody": "Candy Land is another good example that it doesn't take a lot of different sets or a huge budget to create a visually appealing work - what a nice cinematography, but even better, what an incredible editing! - that, at the same time, fulfills its goals of entertaining with quality.\n\nAll this could seem like a kind of sexploitation. That's what the beginning of the first act implies. Calm down. Let those who already had stones to throw calm down. Let those who thought they were going to watch a porno also calm down. The first 15 minutes show more explicit nudity than what we're used to in North American cinema (which, truth be told, is very limited), but that's pretty much the end of it. Better yet, these women are true characters, all of them are very well built and are dignified by a story that doesn't just want to show their tits nor wants them to be seen only with pity. They do what they have to do, things are going relatively well and they form a real team with moments of real camaraderie that are very well-built. There's also a man in the same circumstances, but Candy Land's greatest triumph is that it's always interesting in the way it tells its story and explores gray areas.\n\nEven when it commits excesses - such slaughter in such a short space of time makes us have to question our credulity in the story - it continues to be a work with something to say and very well constructed. It is in its excesses that it also has many of its virtues, but it is in its simplicity that its characters conquer us. It tells us a lot about prejudice, religious fanaticism, and friendship, without forgetting to entertain us and give us a real bloodbath.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 3530,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 5.3
  },
  "keywords": "vulva,labia,female pubic hair,vagina,female star appears nude",
  "actor": [
    {
      "name": "Olivia Luccardi",
      "url": "https://www.imdb.com/name/nm3459140/"
    },
    {
      "name": "Sam Quartin",
      "url": "https://www.imdb.com/name/nm4545984/"
    },
    {
      "name": "Eden Brolin",
      "url": "https://www.imdb.com/name/nm2863262/"
    }
  ],
  "director": [
    {
      "name": "John Swab",
      "url": "https://www.imdb.com/name/nm6461537/"
    }
  ],
  "creator": [
    {
      "name": "John Swab",
      "url": "https://www.imdb.com/name/nm6461537/"
    }
  ]
}