

{
  "type": "Movie",
  "name": "Huo Yuan Jia",
  "url": "https://www.imdb.com/tt0446059/",
  "poster": "https://m.media-amazon.com/images/M/MV5BZjkzZDViNTYtN2ZjMy00NzY4LTgwMjktNGY5YjUxYmY1NzBiXkEyXkFqcGdeQXVyMjgyNjk3MzE@._V1_.jpg",
  "description": null,
  "review": {
    "author": "zxantosdragon",
    "dateCreated": "2006-02-07",
    "inLanguage": "English",
    "heading": "Jet Li's best film in years!",
    "reviewBody": "Let's get to the point. This is Jet Li's best movie in years. Not because of the fight scenes, but because the plot is engaging throughout and the emotional tension of the movie works, even though it was a bit tangled with a bit of preach.\\n\\nThe plot is simple. I think everyone here knows about it, so I won't spent time talking too much about it. Jet Li plays Huo Yuan Jia, an arrogant young man that has no regard for human life so to speak, and in one brash move, he indirectly caused the death of his family. He journey to a remote village to learn humility. This is probably the weakest part of the film. Mainly because a large part of it was cut out from the theatrical release. Huo had a few dialogues with Betty Sun, who played a blind girl. Their relationship was very underdeveloped. And Huo's return to Shanghai to fight was with brevity, and hardly explained. He returns to Shanghai and defends his country's honor.\\n\\nI thought Jet Li did a great job acting both as the arrogant man and as the wiser wushu master. But people of course, came to see Jet Li fight. And to me, the earlier fight scenes are good, but have too much computer effects and slow motion. Still, it was refreshing to see Jet Li return to using Chinese Kung Fu.\\n\\nThe best fight scenes in the movie are definitely the battle between Huo and Nathan Jones, the hulking giant and the weapons fight between the Japanese Samurai and Jet Li using the sword against the three sectional staff. The ending was very emotional, and it was refreshing to see a different take unlike most endings of old Jet Li movies.\\n\\nThe movie could have been better of course, but I was very satisfied with it, both the plot and the action sequences.\\n\\n9/10",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "rating": {
    "ratingCount": 78445,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 7.6
  },
  "contentRating": "15",
  "genre": [
    "Action",
    "Biography",
    "Drama"
  ],
  "datePublished": "2006-06-23",
  "keywords": "martial arts,spiritual,ancient china,kung fu,male protagonist",
  "duration": "PT1H44M",
  "actor": [
    {
      "name": "Jet Li",
      "url": "https://www.imdb.com/name/nm0001472/"
    },
    {
      "name": "Li Sun",
      "url": "https://www.imdb.com/name/nm2111748/"
    },
    {
      "name": "Yong Dong",
      "url": "https://www.imdb.com/name/nm1275406/"
    }
  ],
  "director": [
    {
      "name": "Ronny Yu",
      "url": "https://www.imdb.com/name/nm0950553/"
    }
  ],
  "creator": [
    {
      "name": "Chris Chow",
      "url": "https://www.imdb.com/name/nm0159443/"
    },
    {
      "name": "Richard Epcar",
      "url": "https://www.imdb.com/name/nm0258268/"
    },
    {
      "name": "Chi-Long To",
      "url": "https://www.imdb.com/name/nm1644613/"
    }
  ]
}