

{
  "type": "Movie",
  "name": "The Good Shepherd",
  "url": "https://www.imdb.com/tt0343737/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTU5MjExMzA1Nl5BMl5BanBnXkFtZTgwMzIxNzQxMTE@._V1_.jpg",
  "description": "The tumultuous early history of the Central Intelligence Agency is viewed through the prism of one man&apos;s life.",
  "datePublished": "2007-02-23",
  "contentRating": "15",
  "genre": [
    "Drama",
    "History",
    "Thriller"
  ],
  "duration": "PT2H47M",
  "keywords": "espionage,cold war,year 1962,year 1960,year 1958",
  "rating": {
    "ratingCount": 107926,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.7
  },
  "review": {
    "author": "deanmasters",
    "dateCreated": "2006-12-28",
    "inLanguage": "English",
    "heading": "Finally a film that doesn&apos;t assume you&apos;re an idiot",
    "reviewBody": "After enduring trailer after trailer with endless stings of explosions, ridiculous CG-assisted stunts and mindless action, I felt very rewarded with an intelligent and intriguing film that defies the status quo of bigger and louder is better. \\n\\nThe Good Sheperd doesn&apos;t insult your intelligence, it stimulates it, sometimes confuses it, and forces you to look several layers beneath the surface. It feels like a throwback to another era of films when the complexity of a character was of greater importance than spectacle. \\n\\nDe Niro took a page from his producer&apos;s best work, Francis Ford Coppola, emulating films like The Godfather, The Conversation and Apacalypse Now. The drama rises not from the usual blatant conventional devices but rather by raising questions because of what we&apos;re not told and not shown. It requires a great deal of courage to use this style as films have gravitated more and more toward assuming the average moviegoer is of substandard intelligence. The scope of the film is enormous, yet the point of view is narrowly focused to be seen through the eyes of one man. There are a dozen of subplots, but all are carefully tied into the through-line of the story to match the main character&apos;s progression. \\n\\nThe film may require some understanding of American history from WWII through the Kennedy administration. It starts with the later years of the story, The Bay of Pigs debacle, and traces the steps that lead to it, one of the more embarrassing moments in the history of U.S. foreign policy. I found it a bit annoying that Matt Damon&apos;s character, Edward Wilson, barely seemed to age in the film while others around him did (the best way to determine his age is whether he&apos;s wearing wire-rimmed or horn-rimmed glasses), but it didn&apos;t ruin the film for me. \\n\\nOverall though, definitely one of the best films of 2006. A rare film that makes you want to think and understand, rather than forget.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 9
    }
  },
  "actor": [
    {
      "name": "Matt Damon",
      "url": "https://www.imdb.com/name/nm0000354/"
    },
    {
      "name": "Angelina Jolie",
      "url": "https://www.imdb.com/name/nm0001401/"
    },
    {
      "name": "Robert De Niro",
      "url": "https://www.imdb.com/name/nm0000134/"
    }
  ],
  "director": [
    {
      "name": "Robert De Niro",
      "url": "https://www.imdb.com/name/nm0000134/"
    }
  ],
  "creator": [
    {
      "name": "Eric Roth",
      "url": "https://www.imdb.com/name/nm0744839/"
    }
  ]
}