

{
  "type": "Movie",
  "name": "The Dead Girl",
  "url": "https://www.imdb.com/tt0783238/",
  "poster": "https://m.media-amazon.com/images/M/MV5BNzE4MDYzMzg3MF5BMl5BanBnXkFtZTcwNDU2ODA0MQ@@._V1_.jpg",
  "description": "The clues to a young woman's death come together as the lives of seemingly unrelated people begin to intersect.",
  "review": {
    "author": "DICK STEEL",
    "dateCreated": "2007-09-30",
    "inLanguage": "English",
    "heading": "A Nutshell Review: The Dead Girl",
    "reviewBody": "The story brought memories of an old television cult series called Twin Peaks. A dead, blonde girl's body is being discovered in the grasslands of an idyllic village, and this provides the catalyst for the movie as the plot unravels to tell of the stories that centers around that discovery. In summary, it had a total of 5 short stories all inter-weaved through a fragmented timeline, and a host of characters in those stories who have one way or another, played a part in the girl's life, during when she was alive, and after.\\n\\nThe Stranger stars Toni Collette as the woman who discovered the body, and how she gets thrust into the media limelight, yet yearning for that freedom to flee from her domineering mother. The Sister tells of a pathologist's inability to fight on and continue her family's believe that her missing sister is still out there somewhere, and not to throw in the towel and give up hope. The Wife will manage to rile you up, with the story of a neglected wife, and her hopes for reconciling with her estranged husband, who prefers gallivanting late at night to spending time with her, and of course, with her decision to protect her husband's secrets to losing him for sure altogether when revealed. And The Mother reminds you that a mother's love knows no bounds. Hurt by her daughter's disappearance, the worse case scenario happens, and Mum has got to heal old wounds. It's a touching short, and I thought one of the most powerful amongst the rest. And rounding it up, like the last pieces of a jigsaw, is The Dead Girl's story, where we see a foul mouthed Brittany Murphy bringing it all on.\\n\\nThe movie had excellent performances all round by the ensemble cast, and it doesn't have any big bang moments to shock and awe. It's a dramatic story, rather than a mystery- thriller-whodunnit. I was glad that it didn't go down the torture porn route, although it could have, but didn't need to. Leaving it where it is will already allow your imagination to run wild what the outcome will be. However, this might serve as a let down to some as it might seem that it failed to want to bridge the missing gap in the timeline. Fragmented timeline and multiple, parallel stories do seem to be the rage these days (Babel anyone?), but it all boils down to how much of a story you can make out of a single drop in the pond. That's what The Dead Girl feels like, with the stories the inevitable ripples that fan out.\\n\\nYou Are My Sunshine looks like a song very popularly used in end credits, and so far I had thought that it was a simple childhood nursery song. But when used in this context, it had a profound depth telling of longing and missing, that everyone has their own sunshine that they hold very dear to. Recommended movie, especially if you're into the fragmented timeline fad.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 16111,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.6
  },
  "contentRating": "15",
  "genre": [
    "Crime",
    "Drama",
    "Mystery"
  ],
  "datePublished": "2007-04-26",
  "keywords": "dead body,title directed by female,girl,storage unit,police",
  "duration": "PT1H25M",
  "actor": [
    {
      "name": "Toni Collette",
      "url": "https://www.imdb.com/name/nm0001057/"
    },
    {
      "name": "Brittany Murphy",
      "url": "https://www.imdb.com/name/nm0005261/"
    },
    {
      "name": "Marcia Gay Harden",
      "url": "https://www.imdb.com/name/nm0001315/"
    }
  ],
  "director": [
    {
      "name": "Karen Moncrieff",
      "url": "https://www.imdb.com/name/nm0597673/"
    }
  ],
  "creator": [
    {
      "name": "Karen Moncrieff",
      "url": "https://www.imdb.com/name/nm0597673/"
    }
  ]
}