

{
  "type": "Movie",
  "name": "Tristan + Isolde",
  "url": "https://www.imdb.com/tt0375154/",
  "poster": "https://m.media-amazon.com/images/M/MV5BMTRiZmY5ODMtNzI4Ny00YTE3LTgyYTgtZGE5MDZhZjAyMTQ1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
  "description": "An affair between the second in line to Britain's throne and the princess of the feuding Irish spells doom for the young lovers.",
  "datePublished": "2006-04-21",
  "contentRating": "12A",
  "genre": [
    "Action",
    "Drama",
    "Romance"
  ],
  "duration": "PT2H5M",
  "keywords": "6th century,adultery,brother sister relationship,human in a cage,york england",
  "rating": {
    "ratingCount": 54132,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "review": {
    "author": "inkblot11",
    "dateCreated": "2014-05-05",
    "inLanguage": "English",
    "heading": "Before Arthur, Lancelot and Guinevere, there was another timeless love triangle",
    "reviewBody": "Tristan (James Franco) was orphaned as a boy. Irish warriors interrupted a dinner in Cornwall, which his parents were attending, and killed many, including the lad's father and mother. Brave Uncle Marke (Rufus Sewell) saved his nephew, losing a hand in the process. Now, Tristan is grown and a fine swordsman himself. Yet, the Irish and the clans of Britain are still at odds. In another skirmish, after a valiant fight, Tristan is wounded by a poisonous sword. Thinking him dead, his grieving uncle and other men put him in a boat and release him to the waves. This is the burial ceremony of the times. But, by a twist of fate, the boat crosses the sea and lands in Ireland. Spying the vessel is beautiful Isolde (Sophia Miles), the daughter of the king. Realizing the man is alive but gravely, sickened, this beautiful princess and her lady in waiting nurse Tristan back to health in a secret cove. Before long, Isolde is deeply in love with her patient, although she gives him a false name for herself, and he is in love with her. But, danger lurks, due to his heritage. Just as the Irish are about to discover the secrets, Isolde releases Tristan in his boat, telling him their love can never be. Both are shattered inside. When Tristan arrives back in Cornwall, his uncle is overjoyed. Before long, the Irish king offers his daughter to the knight who can defeat all others in a tournament. Tristan vows to win a wife for the never married Marke. Sure enough, Tristan wins the contest. But, horror indeed when the lady's veil is lifted and it is his dear love. No matter, Isolde must marry Marke, for all parties are bound by honor. Yet, can Tristan really forget his love for Isolde or can she truly love her husband? In addition, if they give into their past feelings, what will be the consequences in the near future? This timeless tale of a love triangle is a legend that came before King Arthur himself. One could probably say it influenced the later story. As such, it is just as beautiful and tragic. Franco, Sewell, and Miles are a most lovely and talented threesome while the lesser actors are equally well chosen. The sets and costumes, which depict a time long ago, are wonderful to behold while the script and direction fulfill the story's telling well. Yes, there is some violence but it is muted; even so, those who shiver at sword fights and such should be advised accordingly. Nevertheless, this is a stellar two hours of entertainment.",
    "reviewRating": {
      "worstRating": 1,
      "bestRating": 10,
      "ratingValue": 8
    }
  },
  "rating": {
    "ratingCount": 54132,
    "bestRating": 10,
    "worstRating": 1,
    "ratingValue": 6.8
  },
  "actor": [
    {
      "name": "James Franco",
      "url": "https://www.imdb.com/name/nm0290556/"
    },
    {
      "name": "Sophia Myles",
      "url": "https://www.imdb.com/name/nm0617009/"
    },
    {
      "name": "Rufus Sewell",
      "url": "https://www.imdb.com/name/nm0001722/"
    }
  ],
  "director": [
    {
      "name": "Kevin Reynolds",
      "url": "https://www.imdb.com/name/nm0721817/"
    }
  ],
  "creator": [
    {
      "name": "Dean Georgaris",
      "url": "https://www.imdb.com/name/nm1212988/"
    }
  ]
}